87 : Job ID ab288a22005c488888ae90c5922d8ff4
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order is "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_DYNAMOSA.py ....... [ 10%]
........                                                                 [ 22%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py ............ [ 40%]
........                                                                 [ 52%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MOSA.py ........... [ 68%]
.....                                                                    [ 76%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py .... [ 82%]
............                                                             [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:163
  /home/auri/temp/lucca/python_experiments/binarySearchTree2/binarySearchTree2.py:163: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if order is "inOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-

88 : Job ID e2405ae823124e47abdd74322040fe37
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order is "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_DYNAMOSA.py ....... [ 10%]
........                                                                 [ 22%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py ............ [ 40%]
........                                                                 [ 52%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MOSA.py ........... [ 68%]
.....                                                                    [ 76%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py .... [ 82%]
............                                                             [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:166
  /home/auri/temp/lucca/python_experiments/binarySearchTree2/binarySearchTree2.py:166: SyntaxWarning: "is" with a literal. Did you mean "=="?
    elif order is "preOrder":
-- Docs: https://docs.p

89 : Job ID 6844ce35f87e452cb7042d021942bedb
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order is "postOrder":
             postOrder(self.root)
             return traversal
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_DYNAMOSA.py ....... [ 10%]
........                                                                 [ 22%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MIO.py ............ [ 40%]
........                                                                 [ 52%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_MOSA.py ........... [ 68%]
.....                                                                    [ 76%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py .... [ 82%]
............                                                             [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:169
  /home/auri/temp/lucca/python_experiments/binarySearchTree2/binarySearchTree2.py:169: SyntaxWarning: "is" with a literal. Did you mean "=="?
    elif order is "postOrder":
-- Docs: https://docs.pytest.org/en/stable/how-to/c
