87 : Job ID 215d5167ef754858abc81677359ef538
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order is "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
timeout

88 : Job ID 745eeb9041724152ae16a96c5aed1b64
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order is "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
timeout

89 : Job ID 97a9dced64a146bcb0fdc40aa96504e2
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 3
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order is "postOrder":
             postOrder(self.root)
             return traversal
timeout

90 : Job ID 25d72e23963a44fab8b8ca822449693c
test outcome: killed
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ is "__main__":
     tree = BST()
timeout

99 : Job ID b11c22f1adfc4bc6a307aff5191a2aea
test outcome: killed
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 8
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ is not "__main__":
     tree = BST()
timeout
