61 : Job ID da9656a4f4114dd1aa9c820efaf3697b
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ != "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.14s ==============================

67 : Job ID 783f5c85d9c1470fb013a5edad672098
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ < "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.23s ==============================

73 : Job ID 270e58351591477aac1ffbd1196d1cc3
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ <= "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.29s ==============================

79 : Job ID 6c568a66506343488f3bdfaecca57bef
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ > "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.20s ==============================

85 : Job ID b0870d1a9b5b45fb815ddb60e328ffc9
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ >= "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.20s ==============================

90 : Job ID 48b5b5dc0df64913a46d09009d35ee86
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 4
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ is "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:186
  /home/auri/temp/lucca/python_experiments/binarySearchTree2/binarySearchTree2.py:186: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if __name__ is "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 16 passed, 1 warning in 0.17s =========================

96 : Job ID 51a06f0a8bee4946938dcf659b7d026a
test outcome: killed
binarySearchTree2.py, start pos: (163, 17), end pos: (163, 19)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 5
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -160,7 +160,7 @@
                 traversal.append(root.value)
         traversal = []
-        if order == "inOrder":
+        if order is not "inOrder":
             inOrder(self.root)
             return traversal
         elif order == "preOrder":
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py FF.....F.......F       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.add(b_s_t_0)
        assert len(b_s_t_0) == 1
        var_1 = b_s_t_0.remove(b_s_t_0)
        assert len(b_s_t_0) == 0
        var_2 = b_s_t_0.__str__()
>       assert var_2 == '[]'
E       AssertionError: assert 'None' == '[]'
E         - []
E         + None
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py:13: AssertionError
_________________________________ test_case_1 __________________________________
    def test_case_1():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        var_0 = b_s_t_0.contains(b_s_t_0)
        assert var_0 is False
        var_1 = b_s_t_0.getOrder(b_s_t_0)
        v

97 : Job ID c4a2095ff9874d9abf75d3f5fbf4b759
test outcome: killed
binarySearchTree2.py, start pos: (166, 19), end pos: (166, 21)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 6
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -163,7 +163,7 @@
         if order == "inOrder":
             inOrder(self.root)
             return traversal
-        elif order == "preOrder":
+        elif order is not "preOrder":
             preOrder(self.root)
             return traversal
         elif order == "postOrder":
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ...............F       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_15 _________________________________
    def test_case_15():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        str_0 = 'Uqfh9M*4'
        int_0 = 1695
        list_0 = [int_0, int_0, int_0, int_0]
        b_s_t_1 = module_0.BST()
        assert len(b_s_t_1) == 0
        var_0 = b_s_t_1.getOrder(str_0)
        var_1 = var_0.__str__()
>       assert var_1 == 'None'
E       AssertionError: assert '[]' == 'None'
E         - None
E         + []
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py:190: AssertionError
=============================== warnings summary ===============================
binarySearchTree2.py:166
  /home/auri/temp/lucca/python_experiments/binarySearchTree2/binarySearchTree2.py:166: SyntaxWar

98 : Job ID 720e99f7187b4a339f98f820e6ddaa77
test outcome: killed
binarySearchTree2.py, start pos: (169, 19), end pos: (169, 21)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 7
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -166,7 +166,7 @@
         elif order == "preOrder":
             preOrder(self.root)
             return traversal
-        elif order == "postOrder":
+        elif order is not "postOrder":
             postOrder(self.root)
             return traversal
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ...............F       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_15 _________________________________
    def test_case_15():
        b_s_t_0 = module_0.BST()
        assert len(b_s_t_0) == 0
        str_0 = 'Uqfh9M*4'
        int_0 = 1695
        list_0 = [int_0, int_0, int_0, int_0]
        b_s_t_1 = module_0.BST()
        assert len(b_s_t_1) == 0
        var_0 = b_s_t_1.getOrder(str_0)
        var_1 = var_0.__str__()
>       assert var_1 == 'None'
E       AssertionError: assert '[]' == 'None'
E         - None
E         + []
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py:190: AssertionError
=============================== warnings summary ===============================
binarySearchTree2.py:169
  /home/auri/temp/lucca/python_experiments/binarySearchTree2/binarySearchTree2.py:169: SyntaxWarning: "is not" with a literal

99 : Job ID 9ffb1fb734604091ba41a37acaaf0ea2
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 12), end pos: (186, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 8
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if __name__ is not "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
=============================== warnings summary ===============================
binarySearchTree2.py:186
  /home/auri/temp/lucca/python_experiments/binarySearchTree2/binarySearchTree2.py:186: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if __name__ is not "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 16 passed, 1 warning in 0.27s =========================

167 : Job ID 3ac775b3e17f45aba7cc64ea65befcbb
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (186, 3), end pos: (186, 25)
operator: core/AddNot, occurrence: 19
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -183,7 +183,7 @@
         return str(self.getOrder())
-if __name__ == "__main__":
+if not __name__ == "__main__":
     tree = BST()
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.27s ==============================

197 : Job ID c41e0aa8e9ac439db2a93c35ec0bcdbc
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (190, 13), end pos: (190, 14)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -187,7 +187,7 @@
     tree = BST()
-    tree.add(3)
+    tree.add( 4)
     tree.add(2)
     tree.add(4)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.22s ==============================

198 : Job ID 08cf895141d641c08e32e44ae1590639
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (190, 13), end pos: (190, 14)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -187,7 +187,7 @@
     tree = BST()
-    tree.add(3)
+    tree.add( 2)
     tree.add(2)
     tree.add(4)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.27s ==============================

199 : Job ID 55d8bbbc879b4b5089dfae1b50c68ea1
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (191, 13), end pos: (191, 14)
operator: core/NumberReplacer, occurrence: 28
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -188,7 +188,7 @@
     tree = BST()
     tree.add(3)
-    tree.add(2)
+    tree.add( 3)
     tree.add(4)
     # print(tree.root.value)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.26s ==============================

200 : Job ID 981ce8ce51964401ab2056923f671c51
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (191, 13), end pos: (191, 14)
operator: core/NumberReplacer, occurrence: 29
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -188,7 +188,7 @@
     tree = BST()
     tree.add(3)
-    tree.add(2)
+    tree.add( 1)
     tree.add(4)
     # print(tree.root.value)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.28s ==============================

201 : Job ID 339161d20338416dbae50a5e797581de
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (192, 13), end pos: (192, 14)
operator: core/NumberReplacer, occurrence: 30
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -189,7 +189,7 @@
     tree.add(3)
     tree.add(2)
-    tree.add(4)
+    tree.add( 5)
     # print(tree.root.value)
     # print(tree.root.left.value)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.29s ==============================

202 : Job ID db559c41e9924300adc228d0f3d9a3d5
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (192, 13), end pos: (192, 14)
operator: core/NumberReplacer, occurrence: 31
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -189,7 +189,7 @@
     tree.add(3)
     tree.add(2)
-    tree.add(4)
+    tree.add( 3)
     # print(tree.root.value)
     # print(tree.root.left.value)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.18s ==============================

203 : Job ID 1ea9d8e5ad64472da2b8e14ca9e008b0
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (199, 17), end pos: (199, 18)
operator: core/NumberReplacer, occurrence: 32
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -196,7 +196,7 @@
     # print(tree.root.right.value)
     tree2 = BST()
-    tree2.build([1, 2, 3])
+    tree2.build([ 2, 2, 3])
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.14s ==============================

204 : Job ID 8345d5b293fc459b871a37b1ceaf167e
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (199, 17), end pos: (199, 18)
operator: core/NumberReplacer, occurrence: 33
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -196,7 +196,7 @@
     # print(tree.root.right.value)
     tree2 = BST()
-    tree2.build([1, 2, 3])
+    tree2.build([ 0, 2, 3])
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.22s ==============================

205 : Job ID 5c51b7dfdef44f1cb76a632cba0af9fd
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (199, 20), end pos: (199, 21)
operator: core/NumberReplacer, occurrence: 34
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -196,7 +196,7 @@
     # print(tree.root.right.value)
     tree2 = BST()
-    tree2.build([1, 2, 3])
+    tree2.build([1, 3, 3])
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.26s ==============================

206 : Job ID 7f34bd04974741c7860224199d77a498
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (199, 20), end pos: (199, 21)
operator: core/NumberReplacer, occurrence: 35
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -196,7 +196,7 @@
     # print(tree.root.right.value)
     tree2 = BST()
-    tree2.build([1, 2, 3])
+    tree2.build([1, 1, 3])
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.27s ==============================

207 : Job ID c9a1a70094784884843bf27ee7f0c365
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (199, 23), end pos: (199, 24)
operator: core/NumberReplacer, occurrence: 36
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -196,7 +196,7 @@
     # print(tree.root.right.value)
     tree2 = BST()
-    tree2.build([1, 2, 3])
+    tree2.build([1, 2, 4])
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.19s ==============================

208 : Job ID 20405dd76b154f70bc64028c6ed60971
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (199, 23), end pos: (199, 24)
operator: core/NumberReplacer, occurrence: 37
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -196,7 +196,7 @@
     # print(tree.root.right.value)
     tree2 = BST()
-    tree2.build([1, 2, 3])
+    tree2.build([1, 2, 2])
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.26s ==============================

209 : Job ID 821c33fd908741d19e37f48f054c2612
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (201, 17), end pos: (201, 18)
operator: core/NumberReplacer, occurrence: 38
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -198,7 +198,7 @@
     tree2 = BST()
     tree2.build([1, 2, 3])
     print(tree2, tree2.size)
-    tree2.remove(1)
+    tree2.remove( 2)
     print(tree2, tree2.size)
     tree2.remove(3)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.29s ==============================

210 : Job ID 08b05c0f08414b8cab1f6f0df7e15fe6
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (201, 17), end pos: (201, 18)
operator: core/NumberReplacer, occurrence: 39
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -198,7 +198,7 @@
     tree2 = BST()
     tree2.build([1, 2, 3])
     print(tree2, tree2.size)
-    tree2.remove(1)
+    tree2.remove( 0)
     print(tree2, tree2.size)
     tree2.remove(3)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.21s ==============================

211 : Job ID 80a5411bc5784a59b440520c6f32a68f
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (203, 17), end pos: (203, 18)
operator: core/NumberReplacer, occurrence: 40
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -200,7 +200,7 @@
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
-    tree2.remove(3)
+    tree2.remove( 4)
     print(tree2, tree2.size)
     tree2.remove(2)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.16s ==============================

212 : Job ID 4bd2732a95304c00bad1e23506eca526
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (203, 17), end pos: (203, 18)
operator: core/NumberReplacer, occurrence: 41
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -200,7 +200,7 @@
     print(tree2, tree2.size)
     tree2.remove(1)
     print(tree2, tree2.size)
-    tree2.remove(3)
+    tree2.remove( 2)
     print(tree2, tree2.size)
     tree2.remove(2)
     print(tree2, tree2.size)
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.14s ==============================

213 : Job ID a037099c2df84142b8dd2ceea33cdaee
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (205, 17), end pos: (205, 18)
operator: core/NumberReplacer, occurrence: 42
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -202,6 +202,6 @@
     print(tree2, tree2.size)
     tree2.remove(3)
     print(tree2, tree2.size)
-    tree2.remove(2)
-    print(tree2, tree2.size)
-
+    tree2.remove( 3)
+    print(tree2, tree2.size)
+
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.21s ==============================

214 : Job ID 94e0aaa8a0d1482ca84aa31edadc0ce3
SURVIVED
test outcome: survived
binarySearchTree2.py, start pos: (205, 17), end pos: (205, 18)
operator: core/NumberReplacer, occurrence: 43
--- mutation diff ---
--- abinarySearchTree2.py
+++ bbinarySearchTree2.py
@@ -202,6 +202,6 @@
     print(tree2, tree2.size)
     tree2.remove(3)
     print(tree2, tree2.size)
-    tree2.remove(2)
-    print(tree2, tree2.size)
-
+    tree2.remove( 1)
+    print(tree2, tree2.size)
+
WHOLE_SUITE/test_binarySearchTree2_WHOLE_SUITE.py ................       [100%]
============================== 16 passed in 0.28s ==============================
