57 : Job ID 3c8219bdbcdd485caa79eaa24e46df18
SURVIVED
test outcome: survived
binarySearchTree3.py, start pos: (398, 32), end pos: (398, 34)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 5
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -395,7 +395,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() is 'left':
                     return self.parent
                 else:
                     node.parent.right = None
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py ....... [  4%]
...................................                                      [ 26%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MIO.py ............ [ 34%]
......................................                                   [ 58%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py ........... [ 65%]
............................                                             [ 83%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py .... [ 85%]
......................                                                   [100%]
=============================== warnings summary ===============================
binarySearchTree3.py:398
  /home/auri/temp/lucca/python_experiments/binarySearchTree3/binarySearchTree3.py:398: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if node._side() is 'left'

63 : Job ID 974093c63b56492a905b902bc723372d
SURVIVED
test outcome: survived
binarySearchTree3.py, start pos: (398, 32), end pos: (398, 34)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 5
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -395,7 +395,7 @@
             return self._findmin(node.right)
         else:
             if node.parent:
-                if node._side() == 'left':
+                if node._side() is not 'left':
                     return self.parent
                 else:
                     node.parent.right = None
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py ....... [  4%]
...................................                                      [ 26%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MIO.py ............ [ 34%]
......................................                                   [ 58%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_MOSA.py ........... [ 65%]
............................                                             [ 83%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py .... [ 85%]
......................                                                   [100%]
=============================== warnings summary ===============================
binarySearchTree3.py:398
  /home/auri/temp/lucca/python_experiments/binarySearchTree3/binarySearchTree3.py:398: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if node._side(
