60 : Job ID 5810649c4dba4973b253365686aaf202
test outcome: killed
binarySearchTree3.py, start pos: (310, 16), end pos: (310, 18)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -307,7 +307,7 @@
     def pre_order(self, node='root'):
         """Depth first pre-order traversal of tree."""
-        if node == 'root':
+        if node is not 'root':
             node = self.root
         if not node:
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py F...........F... [ 23%]
........F.................                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py F............ [ 80%]
.............                                                            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.pre_order()
>       queue_0 = module_0.Queue(var_1)
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

61 : Job ID 96d049736fb04e269436a5962ba173bb
test outcome: killed
binarySearchTree3.py, start pos: (325, 16), end pos: (325, 18)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -322,7 +322,7 @@
     def in_order(self, node='root'):
         """Depth first in-order traversal of tree."""
-        if node == 'root':
+        if node is not 'root':
             node = self.root
         if not node:
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py ....F........... [ 23%]
F...........F.......F.F...                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py ......F...... [ 80%]
.............                                                            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.in_order()
>       queue_0 = module_0.Queue(var_0)
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:42: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3.py:135: in __init__
    self._container = DoubleLinkedList(data)
binarySearchTree3.py:35: in __init__
    f

62 : Job ID 7ee6917376fa4211b53756299a92b538
test outcome: killed
binarySearchTree3.py, start pos: (339, 16), end pos: (339, 18)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 4
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -336,7 +336,7 @@
     def post_order(self, node='root'):
         """Depth frist post_order traversal of tree."""
-        if node == 'root':
+        if node is not 'root':
             node = self.root
         if not node:
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py ................ [ 23%]
.................F...F.F.F                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py ............. [ 80%]
........FF...                                                            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_33 _________________________________
    def test_case_33():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.post_order()
>       queue_0 = module_0.Queue(var_0)
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:391: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3.py:135: in __init__
    self._container = DoubleLinkedList(data)
binarySearchTree3.py:35: in __init

159 : Job ID 916622cc9f434a30bbddcf91b54dee1e
test outcome: killed
binarySearchTree3.py, start pos: (169, 15), end pos: (169, 18)
operator: core/ReplaceUnaryOperator_Delete_Not, occurrence: 1
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -166,7 +166,7 @@
     def _is_leaf(self):
         """Return true if a leaf."""
-        return not (self.right or self.left)
+        return  (self.right or self.left)
     def _is_interior(self):
         """Return true if a interior node."""
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py .......F.F.....F [ 23%]
...........F.FF.F..F....FF                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py ............. [ 80%]
.F.F.........                                                            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        queue_0 = module_0.Queue()
        assert f'{type(queue_0).__module__}.{type(queue_0).__qualname__}' == 'binarySearchTree3.Queue'
        var_0 = queue_0.size()
        assert var_0 == 0
        double_linked_list_0 = module_0.DoubleLinkedList()
        assert double_linked_list_0.head is None
        assert double_linked_list_0.tail is None
        var_1 = double_linked_list_0.push(double_linked_list_0)
        assert f'{type(double_linked_list_0.tail).__module__}.{ty

173 : Job ID b368245df7494a71a43062df1e813118
test outcome: killed
binarySearchTree3.py, start pos: (45, 11), end pos: (45, 19)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -42,7 +42,7 @@
         """Add val to the head of the list."""
         old_head = self.head
         self.head = NodeDLL(val, next_node=old_head)
-        if old_head:
+        if not old_head:
             old_head.prev = self.head
         if not self.tail:
             self.tail = self.head
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py F..F.F.F.F...... [ 23%]
......F.FFFFFFFFF.FF.FFF.F                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py F..FFFFFFFFF. [ 80%]
..F.F........                                                            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.insert(bst_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree3.Node'
        var_1 = bst_0.pre_order()
>       queue_0 = module_0.Queue(var_1)
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:12: 
_ _ _ _ _ _ _ _

178 : Job ID 312b8ad3e2274fe2983b5da21ecc16f5
test outcome: killed
binarySearchTree3.py, start pos: (70, 11), end pos: (70, 19)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -67,7 +67,7 @@
         """Add val to the tail of the list."""
         old_tail = self.tail
         self.tail = NodeDLL(val, prev=old_tail)
-        if old_tail:
+        if not old_tail:
             old_tail.next = self.tail
         if self._length < 1:
             self.head = self.tail
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py .F...FF......... [ 23%]
..........................                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py ............. [ 80%]
......FF.....                                                            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bst_0 = module_0.Bst()
        assert f'{type(bst_0).__module__}.{type(bst_0).__qualname__}' == 'binarySearchTree3.Bst'
        assert bst_0.root is None
        var_0 = bst_0.breadth_first()
>       queue_0 = module_0.Queue(var_0)
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py:20: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
binarySearchTree3.py:135: in __init__
    self._container = DoubleLinkedList(

223 : Job ID 46c58d6e54d448748b63da2bc99eb2bf
SURVIVED
test outcome: survived
binarySearchTree3.py, start pos: (173, 27), end pos: (173, 30)
operator: core/ReplaceAndWithOr, occurrence: 1
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -170,7 +170,7 @@
     def _is_interior(self):
         """Return true if a interior node."""
-        return (self.right and self.left)
+        return (self.right or self.left)
     def _onlychild(self):
         """Return string depending on children."""
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py ................ [ 23%]
..........................                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py ............. [ 80%]
.............                                                            [100%]
============================== 68 passed in 0.27s ==============================

226 : Job ID c642fa592a0d498c982546657a8f9ae5
SURVIVED
test outcome: survived
binarySearchTree3.py, start pos: (169, 31), end pos: (169, 33)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- abinarySearchTree3.py
+++ bbinarySearchTree3.py
@@ -166,7 +166,7 @@
     def _is_leaf(self):
         """Return true if a leaf."""
-        return not (self.right or self.left)
+        return not (self.right and self.left)
     def _is_interior(self):
         """Return true if a interior node."""
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_DYNAMOSA.py ................ [ 23%]
..........................                                               [ 61%]
DYNAMOSA-WHOLE_SUITE/test_binarySearchTree3_WHOLE_SUITE.py ............. [ 80%]
.............                                                            [100%]
============================== 68 passed in 0.27s ==============================
