1 : Job ID d39c352352dc414e9779421be438edf2
test outcome: killed
binarySearchTree4.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if data == node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ..F......F   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py .F....F...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py ......F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bst_0 = module_0.Bst()
        str_0 = 'Eq$Iy6fg;+)U <2SrvUq'
        var_0 = bst_0.insert(str_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == 'Eq$Iy6fg;+)U <2SrvUq'
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
>       with pytest.raises(TypeErro

2 : Job ID db9123b12a0845769292e77a8bfe2991
test outcome: killed
binarySearchTree4.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if data != node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ..F...FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py .F.FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F.....FF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bst_0 = module_0.Bst()
        str_0 = 'Eq$Iy6fg;+)U <2SrvUq'
        var_0 = bst_0.insert(str_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == 'Eq$Iy6fg;+)U <2SrvUq'
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
>       with pytest.raises(TypeE

3 : Job ID a283e12f7d154809a5f18fdd33905e19
test outcome: killed
binarySearchTree4.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if data < node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py .......FF.   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ...F.FF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F......F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = False
        node_0 = module_0.Node(bool_0)
        var_0 = node_0.__repr__()
        bst_0 = module_0.Bst()
        var_1 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree4.Node'
        assert var_1.data is False
        assert var_1.left is None
        assert var_1.right is None
        assert var_1.parent is

4 : Job ID 40a1eda3822f41b080599131890705f8
test outcome: killed
binarySearchTree4.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if data > node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ......FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ...FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F......F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool_0 = False
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst(bst_0)
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is False
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(b

5 : Job ID 2d39b23a290a4650a7de1c9bb7b35d69
test outcome: killed
binarySearchTree4.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if data >= node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ......F..F   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ....FFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F........ [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool_0 = False
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst(bst_0)
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is False
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node

6 : Job ID 07dfc4258a434b05b98dc36d02aeb058
test outcome: killed
binarySearchTree4.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if data is node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ..F......F   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py .F....F...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py ......F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bst_0 = module_0.Bst()
        str_0 = 'Eq$Iy6fg;+)U <2SrvUq'
        var_0 = bst_0.insert(str_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == 'Eq$Iy6fg;+)U <2SrvUq'
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
>       with pytest.raises(TypeErro

7 : Job ID 1e665de8afab40bd91fcab2248383bf2
test outcome: killed
binarySearchTree4.py, start pos: (29, 16), end pos: (29, 18)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if data is not node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ..F...FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py .F.FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F.....FF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bst_0 = module_0.Bst()
        str_0 = 'Eq$Iy6fg;+)U <2SrvUq'
        var_0 = bst_0.insert(str_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == 'Eq$Iy6fg;+)U <2SrvUq'
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
>       with pytest.raises(T

8 : Job ID 203ca34dbe8f4114a33e5890c717a1f2
test outcome: killed
binarySearchTree4.py, start pos: (18, 16), end pos: (18, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -15,7 +15,7 @@
         self.root = root
     def insert(self, data):
-        if data is None:
+        if data is not None:
             raise TypeError('data cannot be None')
         if self.root is None:
             self.root = Node(data)
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py FFF.F.FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py FFFFFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F...FFFF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        none_type_0 = None
        bst_0 = module_0.Bst()
>       with pytest.raises(TypeError):
E       Failed: DID NOT RAISE <class 'TypeError'>
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py:8: Failed
_________________________________ test_case_1 __________________________________
    def test_case_1():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        bst_0 = module_0.Bst()
>       var_0 = bst_0.insert(bst_0)
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

9 : Job ID fddd79f1f5424859927e91ad022aaae8
test outcome: killed
binarySearchTree4.py, start pos: (20, 21), end pos: (20, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -17,7 +17,7 @@
     def insert(self, data):
         if data is None:
             raise TypeError('data cannot be None')
-        if self.root is None:
+        if self.root is not None:
             self.root = Node(data)
             return self.root
         else:
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py .FF.F.FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py FF.FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F.....FF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        bst_0 = module_0.Bst()
        var_0 = bst_0.insert(bst_0)
>       assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
E       AssertionError: assert 'builtins.NoneType' == 'binarySearchTree4.Node'
E         - binarySearchTree4.Node
E         + builtins.NoneType
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py:16: AssertionError
_________________________________ test_case_2 _______________________

10 : Job ID 3036897a5a454db5b1c59348426d86b4
test outcome: killed
binarySearchTree4.py, start pos: (27, 16), end pos: (27, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -24,7 +24,7 @@
             return self._insert(self.root, data)
     def _insert(self, node, data):
-        if node is None:
+        if node is not None:
             return Node(data)
         if data <= node.data:
             if node.left is None:
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ..F...FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py .F.FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F.....FF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bst_0 = module_0.Bst()
        str_0 = 'Eq$Iy6fg;+)U <2SrvUq'
        var_0 = bst_0.insert(str_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == 'Eq$Iy6fg;+)U <2SrvUq'
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
>       with pytest.raises(TypeError):
E       Failed: DID NOT RAISE <class 'TypeEr

11 : Job ID 6c8192ff86004d04bcd6e5cd9efa386c
test outcome: killed
binarySearchTree4.py, start pos: (30, 25), end pos: (30, 27)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -27,7 +27,7 @@
         if node is None:
             return Node(data)
         if data <= node.data:
-            if node.left is None:
+            if node.left is not None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
                 return node.left
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py .......FFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ...F.FF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F......F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = False
        node_0 = module_0.Node(bool_0)
        var_0 = node_0.__repr__()
        bst_0 = module_0.Bst()
        var_1 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree4.Node'
        assert var_1.data is False
        assert var_1.left is None
        assert var_1.right is None
        assert var_1.

12 : Job ID e13b163c70c34d34a8585743c4336a04
test outcome: killed
binarySearchTree4.py, start pos: (37, 26), end pos: (37, 28)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 4
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -34,7 +34,7 @@
             else:
                 return self._insert(node.left, data)
         else:
-            if node.right is None:
+            if node.right is not None:
                 node.right = self._insert(node.right, data)
                 node.right.parent = node
                 return node.right
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ......F..F   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ....FF....        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F........ [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool_0 = False
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst(bst_0)
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is False
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 =

13 : Job ID 059ee97ba46141aca43e88b98b50131e
test outcome: killed
binarySearchTree4.py, start pos: (18, 11), end pos: (18, 23)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -15,7 +15,7 @@
         self.root = root
     def insert(self, data):
-        if data is None:
+        if not data is None:
             raise TypeError('data cannot be None')
         if self.root is None:
             self.root = Node(data)
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py FFF.F.FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py FFFFFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F...FFFF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        none_type_0 = None
        bst_0 = module_0.Bst()
>       with pytest.raises(TypeError):
E       Failed: DID NOT RAISE <class 'TypeError'>
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py:8: Failed
_________________________________ test_case_1 __________________________________
    def test_case_1():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        bst_0 = module_0.Bst()
>       var_0 = bst_0.insert(bst_0)
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

14 : Job ID 58b1e835a91e4135b040078a974b11ef
test outcome: killed
binarySearchTree4.py, start pos: (20, 11), end pos: (20, 28)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -17,7 +17,7 @@
     def insert(self, data):
         if data is None:
             raise TypeError('data cannot be None')
-        if self.root is None:
+        if not self.root is None:
             self.root = Node(data)
             return self.root
         else:
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py .FF.F.FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py FF.FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F.....FF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        none_type_0 = None
        node_0 = module_0.Node(none_type_0)
        bst_0 = module_0.Bst()
        var_0 = bst_0.insert(bst_0)
>       assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
E       AssertionError: assert 'builtins.NoneType' == 'binarySearchTree4.Node'
E         - binarySearchTree4.Node
E         + builtins.NoneType
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py:16: AssertionError
_________________________________ test_case_2 __________________________________
    def test_ca

15 : Job ID 7c975718dc5741feb060693392cbd015
test outcome: killed
binarySearchTree4.py, start pos: (27, 11), end pos: (27, 23)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -24,7 +24,7 @@
             return self._insert(self.root, data)
     def _insert(self, node, data):
-        if node is None:
+        if not node is None:
             return Node(data)
         if data <= node.data:
             if node.left is None:
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ..F...FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py .F.FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F.....FF. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bst_0 = module_0.Bst()
        str_0 = 'Eq$Iy6fg;+)U <2SrvUq'
        var_0 = bst_0.insert(str_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data == 'Eq$Iy6fg;+)U <2SrvUq'
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
>       with pytest.raises(TypeError):
E       Failed: DID NOT RAISE <class 'TypeError'>
DYNAMOSA-MIO-WHOLE_SUI

16 : Job ID c25aa4ca321745b8af70f45395607356
test outcome: killed
binarySearchTree4.py, start pos: (29, 11), end pos: (29, 28)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -26,7 +26,7 @@
     def _insert(self, node, data):
         if node is None:
             return Node(data)
-        if data <= node.data:
+        if not data <= node.data:
             if node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ......FFFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ...FFFF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F......F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool_0 = False
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst(bst_0)
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is False
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(bool_0)
        bst_2

17 : Job ID c1afa2eecb7a42d4929007c2e6c2e31a
test outcome: killed
binarySearchTree4.py, start pos: (30, 15), end pos: (30, 32)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -27,7 +27,7 @@
         if node is None:
             return Node(data)
         if data <= node.data:
-            if node.left is None:
+            if not node.left is None:
                 node.left = self._insert(node.left, data)
                 node.left.parent = node
                 return node.left
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py .......FFF   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ...F.FF...        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F......F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = False
        node_0 = module_0.Node(bool_0)
        var_0 = node_0.__repr__()
        bst_0 = module_0.Bst()
        var_1 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'binarySearchTree4.Node'
        assert var_1.data is False
        assert var_1.left is None
        assert var_1.right is None
        assert var_1.parent is None
        var_2

18 : Job ID 66a28f530a8e45cd9693d4478bb4a6eb
test outcome: killed
binarySearchTree4.py, start pos: (37, 15), end pos: (37, 33)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- abinarySearchTree4.py
+++ bbinarySearchTree4.py
@@ -34,7 +34,7 @@
             else:
                 return self._insert(node.left, data)
         else:
-            if node.right is None:
+            if not node.right is None:
                 node.right = self._insert(node.right, data)
                 node.right.parent = node
                 return node.right
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_DYNAMOSA.py ......F..F   [ 34%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_MIO.py ....FF....        [ 68%]
DYNAMOSA-MIO-WHOLE_SUITE/test_binarySearchTree4_WHOLE_SUITE.py F........ [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool_0 = False
        bst_0 = module_0.Bst()
        bst_1 = module_0.Bst(bst_0)
        var_0 = bst_0.insert(bool_0)
        assert f'{type(bst_0.root).__module__}.{type(bst_0.root).__qualname__}' == 'binarySearchTree4.Node'
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'binarySearchTree4.Node'
        assert var_0.data is False
        assert var_0.left is None
        assert var_0.right is None
        assert var_0.parent is None
        node_0 = module_0.Node(bool_0)
