38 : Job ID d2670657a1ed4d21b62a7ccd238e1f32
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        str_0 = 'Y'
        list_0 = []
        identifier_0 = module_0.Identifier(*list_0)
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py:59: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pyt

88 : Job ID 5929c233e1314916af51a518130dfd5b
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ........F...           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        str_0 = 'Y'
        list_0 = []
        identifier_0 = module_0.Identifier(*list_0)
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py:59: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pyt

93 : Job ID 6a5010c3087d485db800c5819c2d712a
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.......           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        str_0 = '!W'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py:30: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en

94 : Job ID 07b0f1d071fb41a891248dcc1a127b67
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')):
             return True
         else:
             return False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py ....F.......           [ 50%]
DYNAMOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        str_0 = '!W'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
DYNAMOSA-WHOLE_SUITE/test_identifier1_DYNAMOSA.py:30: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en
