41 : Job ID c1e909ff17da4919972bd47c6995944f
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA/test_identifier1_DYNAMOSA.py .F..........                       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'ij'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
DYNAMOSA/test_identifier1_DYNAMOSA.py:15: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/st

42 : Job ID c0494bcf2b0c40958c018718c58b222d
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is '9')):
             return True
         else:
             return False
DYNAMOSA/test_identifier1_DYNAMOSA.py F...........                       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
DYNAMOSA/test_identifier1_DYNAMOSA.py:9: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is '9')):
-- Docs: https://docs.pytest.org/en/st

45 : Job ID 5a383478fc5e4ce2b46e5aeacf4aad04
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA/test_identifier1_DYNAMOSA.py ...F........                       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'K^'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
DYNAMOSA/test_identifier1_DYNAMOSA.py:24: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.

91 : Job ID 079d04345da449498e5ae73fe7c7e8e4
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA/test_identifier1_DYNAMOSA.py .F..........                       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'ij'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
DYNAMOSA/test_identifier1_DYNAMOSA.py:15: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/st

92 : Job ID 3b6a97397809441f94e8c682fe5e9c91
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA/test_identifier1_DYNAMOSA.py F...........                       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        str_0 = 'i8'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
DYNAMOSA/test_identifier1_DYNAMOSA.py:9: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/sta

97 : Job ID 99bd13e0a7b643c981fdf65d7ec9d83c
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
             return True
         else:
             return False
DYNAMOSA/test_identifier1_DYNAMOSA.py ......F.....                       [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = "w'"
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
DYNAMOSA/test_identifier1_DYNAMOSA.py:42: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
-- Docs: https://docs.
