38 : Job ID 5fd167ac135d4ddeaea240410603c5ab
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
MIO-WHOLE_SUITE/test_identifier1_MIO.py ..F........                      [ 47%]
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............             [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        str_0 = 'M'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MIO-WHOLE_SUITE/test_identifier1_MIO.py:20: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warn

39 : Job ID 041c35cce3a44538822ba04270a0d52b
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')):
             return True
         else:
             return False
MIO-WHOLE_SUITE/test_identifier1_MIO.py ...........                      [ 47%]
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....             [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'u'
        bytes_0 = b'~P%d\x99S'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py:56: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')):
-- Docs: https://docs.p

88 : Job ID 7dc5f420755e4a4a8d77ead158197c07
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
MIO-WHOLE_SUITE/test_identifier1_MIO.py ..F........                      [ 47%]
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............             [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        str_0 = 'M'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MIO-WHOLE_SUITE/test_identifier1_MIO.py:20: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warn

89 : Job ID 5dc5198865044332987c710f9beadfaf
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')):
             return True
         else:
             return False
MIO-WHOLE_SUITE/test_identifier1_MIO.py ...........                      [ 47%]
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ......F.....             [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'u'
        bytes_0 = b'~P%d\x99S'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py:56: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')):
-- Docs: https://docs.p

93 : Job ID 2ff9c4d17ba44a1f9bd36ec4e7b45a2b
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
MIO-WHOLE_SUITE/test_identifier1_MIO.py .F.........                      [ 47%]
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............             [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = ''
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_s(str_0)
>       assert var_0 is False
E       assert True is False
MIO-WHOLE_SUITE/test_identifier1_MIO.py:14: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-

94 : Job ID 8fbb36ea3f5c4f4fbbc90b8a54876003
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')):
             return True
         else:
             return False
MIO-WHOLE_SUITE/test_identifier1_MIO.py .F.........                      [ 47%]
MIO-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............             [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = ''
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_s(str_0)
>       assert var_0 is False
E       assert True is False
MIO-WHOLE_SUITE/test_identifier1_MIO.py:14: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-
