40 : Job ID 45333f55bd7f4b2c8e332f3c8c0553b2
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MIO/test_identifier1_MIO.py ......F....                                  [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        identifier_0 = module_0.Identifier()
        str_0 = 'HI8ft5A\x0bj%%;.q.1@'
        var_0 = identifier_0.valid_f(str_0)
>       assert var_0 is True
E       assert False is True
MIO/test_identifier1_MIO.py:44: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stabl

41 : Job ID 58db112b1bff4cdca32d2a84c90abf61
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MIO/test_identifier1_MIO.py ....F......                                  [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        str_0 = 'y'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_f(str_0)
>       assert var_0 is True
E       assert False is True
MIO/test_identifier1_MIO.py:32: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-wa

47 : Job ID 21a86448a8774fd292f9f03b866ed701
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is not '9')):
             return True
         else:
             return False
MIO/test_identifier1_MIO.py F..........                                  [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        str_0 = 'e=g'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
MIO/test_identifier1_MIO.py:8: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is not '9')):
-- Docs: https://docs.pytest.or

90 : Job ID e2ec8de47ecc475ab872ecc172ef1621
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MIO/test_identifier1_MIO.py ......F....                                  [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        identifier_0 = module_0.Identifier()
        str_0 = 'HI8ft5A\x0bj%%;.q.1@'
        var_0 = identifier_0.valid_f(str_0)
>       assert var_0 is True
E       assert False is True
MIO/test_identifier1_MIO.py:44: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stabl

91 : Job ID 88e717a664284f8289d5abb2886ab756
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MIO/test_identifier1_MIO.py ....F......                                  [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        str_0 = 'y'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_f(str_0)
>       assert var_0 is True
E       assert False is True
MIO/test_identifier1_MIO.py:32: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-wa

97 : Job ID 7226e899e3ae465d959c0db20159ae9a
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
             return True
         else:
             return False
MIO/test_identifier1_MIO.py .....F.....                                  [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        str_0 = 'S\x0c'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
MIO/test_identifier1_MIO.py:38: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
-- Docs: https://docs.pytest.
