38 : Job ID 8e23b8a5cc314f948f30a1ea2edbaba4
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
MOSA-WHOLE_SUITE/test_identifier1_MOSA.py F..........                    [ 47%]
MOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        identifier_0 = module_0.Identifier()
        str_0 = 'H9'
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MOSA-WHOLE_SUITE/test_identifier1_MOSA.py:9: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-wa

88 : Job ID ce9c8159ddd1408386e683f999603488
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
MOSA-WHOLE_SUITE/test_identifier1_MOSA.py F..........                    [ 47%]
MOSA-WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ............            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        identifier_0 = module_0.Identifier()
        str_0 = 'H9'
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MOSA-WHOLE_SUITE/test_identifier1_MOSA.py:9: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-wa
