40 : Job ID 81c7a0c2cc624f7dae28db066e8b16ab
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MOSA/test_identifier1_MOSA.py ........F..                                [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        str_0 = 'e6zLE'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MOSA/test_identifier1_MOSA.py:55: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/

41 : Job ID 72dc4339669b45258566f81221e5cb34
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MOSA/test_identifier1_MOSA.py .......F...                                [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        str_0 = 'e6v'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MOSA/test_identifier1_MOSA.py:48: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/ho

45 : Job ID 892d1ad4107842a69107a3308046f2dc
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MOSA/test_identifier1_MOSA.py .....F.....                                [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        identifier_0 = module_0.Identifier()
        str_0 = 'j{'
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
MOSA/test_identifier1_MOSA.py:36: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.o

90 : Job ID 4fe87a8a3ba24830b00c8613186a5dac
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MOSA/test_identifier1_MOSA.py ........F..                                [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        str_0 = 'e6zLE'
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is True
E       assert False is True
MOSA/test_identifier1_MOSA.py:55: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.org/en/stable/

95 : Job ID 8fa5c818bba84668a8e54833ae4d3c87
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MOSA/test_identifier1_MOSA.py ......F....                                [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        identifier_0 = module_0.Identifier()
        str_0 = 'g$'
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
MOSA/test_identifier1_MOSA.py:42: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.o

96 : Job ID 753925a8ff49428ca4c69d41bb8b0857
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
MOSA/test_identifier1_MOSA.py ......F....                                [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        identifier_0 = module_0.Identifier()
        str_0 = 'g$'
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
MOSA/test_identifier1_MOSA.py:42: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
-- Docs: https://docs.pytest.o

97 : Job ID c007abc620504ee6b7ed01afe45b4f29
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
             return True
         else:
             return False
MOSA/test_identifier1_MOSA.py ......F....                                [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        identifier_0 = module_0.Identifier()
        str_0 = 'g$'
        var_0 = identifier_0.validateIdentifier(str_0)
>       assert var_0 is False
E       assert True is False
MOSA/test_identifier1_MOSA.py:42: AssertionError
=============================== warnings summary ===============================
identifier1.py:14
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:14: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
-- Docs: https://docs.pytest.o
