38 : Job ID 07ed03bc070b47ef941eaa2608db54ed
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
.............................................................

39 : Job ID f2e8a683bbb646808d867b4ff3be82e9
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
......................................................F................. [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
.............................................................

40 : Job ID 6c80bff3011c4242ad90b1b2ec41419f
test outcome: killed
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
.....F.................................................................. [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
.......................................................................

41 : Job ID e96e2383a85442f98117a5a85a7d9f2f
test outcome: killed
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
timeout

42 : Job ID 79505d55539f4590b47d59d41f85ecc5
test outcome: killed
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
..........................................................F...........

43 : Job ID 8d556eac7c134d08ad0bf0281635aa3d
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
......................................................

44 : Job ID 2039e83cf9b24382bbfc98a06bf3214e
SURVIVED
test outcome: survived
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
...........................................

45 : Job ID fa9fd838ed384c0aafc8bddff0c03339
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 32), end pos: (14, 34)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
.....................................................

46 : Job ID 2c67fbaf06114510a40150cedf51e6d4
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 65), end pos: (14, 67)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
.....................................................

47 : Job ID d8926f3585944456934507644610c98f
SURVIVED
test outcome: survived
identifier1.py, start pos: (14, 98), end pos: (14, 100)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch is not '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
....................................................

88 : Job ID ca0bc803f68144e4981409d4116d8511
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
.............................................................

89 : Job ID 98a6c23b59024dfeada46e655f740288
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
......................................................F................. [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
.............................................................

90 : Job ID d041474571dc4871b812f4b685fad269
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch is 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
.....F.................................................................. [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
.......................................................................

91 : Job ID 87a62c4d039c41ebae849d290b9a33f5
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
timeout

92 : Job ID 4fde9610f7c54cf99a3e187bb1897dcd
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is '0') and (ch <= '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
..........................................................F............

93 : Job ID fdf564160e36423cb66bbe0800d7a664
test outcome: killed
identifier1.py, start pos: (7, 16), end pos: (7, 18)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
......................................................

94 : Job ID c5e21947d4804f009c36b70f4f74461c
test outcome: killed
identifier1.py, start pos: (7, 49), end pos: (7, 51)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
........................................................................ [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
........................................................................ [ 20%]
......................................................

95 : Job ID e9dd2976dac34e0bb0cfbfed9e20b15a
test outcome: killed
identifier1.py, start pos: (14, 16), end pos: (14, 18)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 2
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch is not 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
.............................F.......................................... [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
................................................................

96 : Job ID 621e09e54b724d6c911918f65008ef5f
test outcome: killed
identifier1.py, start pos: (14, 49), end pos: (14, 51)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 3
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch is not 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
             return True
         else:
             return False
timeout

97 : Job ID fd1a647e5ca04544a8184526a22d844d
test outcome: killed
identifier1.py, start pos: (14, 82), end pos: (14, 84)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 4
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -11,7 +11,7 @@
     def valid_f(self, ch):
         """ generated source for method valid_f """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch >= '0') and (ch <= '9')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')) or ((ch is not '0') and (ch <= '9')):
             return True
         else:
             return False
RANDOM/test_identifier1_RANDOM.py ...................................... [  1%]
........................................................................ [  2%]
........................................................................ [  4%]
........................................................................ [  6%]
........................................................................ [  8%]
........................................................................ [ 10%]
.............................F.......................................... [ 12%]
........................................................................ [ 14%]
........................................................................ [ 16%]
........................................................................ [ 18%]
................................................................
