43 : Job ID feeac06f37c24192ab86a1b56f6074e3
test outcome: killed
identifier1.py, start pos: (7, 32), end pos: (7, 34)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')):
             return True
         else:
             return False
WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...                 [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        object_0 = module_1.object()
        int_0 = 2545
        str_0 = "}#Ys%@&Kx,u=M)6'V"
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_s(str_0)
>       assert var_0 is False
E       assert True is False
WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py:69: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch is not 'Z')) or ((ch >= 'a') and (ch <= 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-w

44 : Job ID b633bf90216b428f905eb7aa16b4c617
test outcome: killed
identifier1.py, start pos: (7, 65), end pos: (7, 67)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 1
--- mutation diff ---
--- aidentifier1.py
+++ bidentifier1.py
@@ -4,7 +4,7 @@
     def valid_s(self, ch):
         """ generated source for method valid_s """
-        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch <= 'z')):
+        if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')):
             return True
         else:
             return False
WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py ........F...                 [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        object_0 = module_1.object()
        int_0 = 2545
        str_0 = "}#Ys%@&Kx,u=M)6'V"
        identifier_0 = module_0.Identifier()
        var_0 = identifier_0.valid_s(str_0)
>       assert var_0 is False
E       assert True is False
WHOLE_SUITE/test_identifier1_WHOLE_SUITE.py:69: AssertionError
=============================== warnings summary ===============================
identifier1.py:7
  /home/auri/temp/lucca/python_experiments/identifier1/identifier1.py:7: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if ((ch >= 'A') and (ch <= 'Z')) or ((ch >= 'a') and (ch is not 'z')):
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-w
