1 : Job ID 6de78f7f04d14a34aeaae4e1d438e1be
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size + 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list

2 : Job ID 403ca890f7b54c21a181fcd378d6fa9f
test outcome: killed
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index + 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
F..F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........................F.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_25 _________________________________
    def test_case_25():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        var_1 = var_0.append(var_0)
        assert len(doubly_linked_list_0) == 1
        assert len(var_0) == 1
        var_2 = var_0.append(var_1)
        assert len(doubly_linked_list_

3 : Job ID 7877dfb418d7472aada7c22bbcb8b8de
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size * 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list

4 : Job ID d7e76179d2904a54bfda54a7fe4e490d
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index * 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

5 : Job ID 84bfe7c052424dce8c2d7dbfd2f642b1
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size / 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list

6 : Job ID c7c4006c8aef4166966f411e994eb30b
test outcome: killed
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index / 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....................F... [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F....... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........................F.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_21 _________________________________
    def test_case_21():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        var_1 = var_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        assert len(var_0) == 1
        var_2 = var_0.__iter__()
        assert len

7 : Job ID 99695bd834404d0782484c849117daf1
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size // 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linke

8 : Job ID e7fec611621e47a0999063581f9dc15a
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index // 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

9 : Job ID 577782b7224f4579ab1a2f2f8ee3ab9e
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size % 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..................F...... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ............................F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........F.........F.F..F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_18 _________________________________
    def test_case_18():
        bool_0 = False
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.next()
        assert var_1 is False
        var_2 = doubly_linked_list_

10 : Job ID 43a3fc4c086b49ad89f374aef95d6f6d
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index % 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

11 : Job ID ebc31438399741c9ae71b9293c7821c4
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size ** 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_li

12 : Job ID f05418964d064f27a92a993883b5146c
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index ** 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.40s ==============================

13 : Job ID b5248c673ad349919ba1275a2c3b4b4c
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size >> 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
F..F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........................F.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_25 _________________________________
    def test_case_25():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        var_1 = var_0.append(var_0)
        assert len(doubly_linked_list_0) == 1
        assert len(var_0) == 1
        var_2 = var_0.append(var_

14 : Job ID e258235e5f794b5196f0528ebe40a8ea
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index >> 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

15 : Job ID d4e9742088c648099ae31becc7bef5df
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size << 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked

16 : Job ID 2cae5ada8d534059a416a661a852d7ea
test outcome: killed
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index << 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
F..F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........................F.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_25 _________________________________
    def test_case_25():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        var_1 = var_0.append(var_0)
        assert len(doubly_linked_list_0) == 1
        assert len(var_0) == 1
        var_2 = var_0.append(var_1)
        assert len(doubly_linked_

17 : Job ID 694ef657c26b4228afba0b886610a846
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size | 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_l

18 : Job ID 29f339b08bc543179100b81a1c0c4d11
test outcome: killed
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index | 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_28 _________________________________
    def test_case_28():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        var_1 = var_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        assert len(var_0) == 1
        var_2 = doubly_linked_list_0.__len__()

19 : Job ID 6822b639ad294453829fae0b0ae8935b
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size & 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF...FF. [ 27%]
F...                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_

20 : Job ID 7c9869413f4a41c5b6de0efbc9e5a0c5
test outcome: killed
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index & 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F....... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_22 _________________________________
    def test_case_22():
        int_0 = -2627
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(int_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.append(int_0)
        assert len(doubly_linked_list_0) == 2
>       var_2 = doubly_linked_list_0.insert(in

21 : Job ID 1b18e460e8d743ac8a492c42ff17cc7a
test outcome: killed
linkedList1.py, start pos: (130, 34), end pos: (130, 35)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size ^ 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........F.........F....F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_10 _________________________________
    def test_case_10():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__len__()
        assert var_0 == 0
        var_1 = doubly_linked_list_0.append(var_0)
        assert len(doubly_linked_list_0) == 1
        var_2 = doubly_linked_list_0.__iter__()
