22 : Job ID fdbb060ea8184da98af667ab7277c31e
test outcome: killed
linkedList1.py, start pos: (151, 37), end pos: (151, 38)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index ^ 1):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_28 _________________________________
    def test_case_28():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        bool_0 = True
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        var_1 = var_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        assert len(var_0) == 1
        var_2 = doubly_linked_list_0.__len__()

23 : Job ID 230dd7e4c20642958742251a845953c6
test outcome: killed
linkedList1.py, start pos: (130, 21), end pos: (130, 23)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index != self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF..FFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F..FF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F.F.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linke

24 : Job ID b42773f35f1b4cbbab9b8a01a656a3b2
SURVIVED
test outcome: survived
linkedList1.py, start pos: (134, 23), end pos: (134, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -131,7 +131,7 @@
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
-            elif index == 0:
+            elif index != 0:
                 #              _____   _____
                 # self.head|->|  A  | |  C  |
                 #           <-|_____| |_____|
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

25 : Job ID dbd52da3852c40db87e4a0c50c688837
test outcome: killed
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ != '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
==================================== ERRORS ====================================
_______ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ________
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
__________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
_________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py:3: in <module>
    import linkedList1 as mo

26 : Job ID 4db6bc3c71364768969ae7ec67dc4fd6
test outcome: killed
linkedList1.py, start pos: (130, 21), end pos: (130, 23)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index < self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF..FFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F..FF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F.F.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_li

27 : Job ID 82ddaf4f91e24dcc95d62d0a7baef7bf
SURVIVED
test outcome: survived
linkedList1.py, start pos: (134, 23), end pos: (134, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -131,7 +131,7 @@
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
-            elif index == 0:
+            elif index < 0:
                 #              _____   _____
                 # self.head|->|  A  | |  C  |
                 #           <-|_____| |_____|
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.43s ==============================

28 : Job ID 8a148805bba548c9a92fbe1704651894
SURVIVED
test outcome: survived
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ < '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

29 : Job ID d8667e7616df4dc69264ba215f4f9447
test outcome: killed
linkedList1.py, start pos: (130, 21), end pos: (130, 23)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index <= self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..................F..F... [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.....F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ......................F...F.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_18 _________________________________
    def test_case_18():
        bool_0 = False
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.next()
        assert var_1 is False
        var_2 = doubly_linked_l

30 : Job ID 6a73386258f94b8299d28adbe6180ebc
SURVIVED
test outcome: survived
linkedList1.py, start pos: (134, 23), end pos: (134, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -131,7 +131,7 @@
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
-            elif index == 0:
+            elif index <= 0:
                 #              _____   _____
                 # self.head|->|  A  | |  C  |
                 #           <-|_____| |_____|
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.40s ==============================

31 : Job ID 8efa9cebc9bd4c41ada965d188ff47bc
SURVIVED
test outcome: survived
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ <= '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

32 : Job ID 10d43508e7bd4fa9b260d0c749b9a303
test outcome: killed
linkedList1.py, start pos: (130, 21), end pos: (130, 23)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index > self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_li

33 : Job ID ef5b4cd5a93442fdad63abf34875f8c2
SURVIVED
test outcome: survived
linkedList1.py, start pos: (134, 23), end pos: (134, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -131,7 +131,7 @@
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
-            elif index == 0:
+            elif index > 0:
                 #              _____   _____
                 # self.head|->|  A  | |  C  |
                 #           <-|_____| |_____|
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

34 : Job ID 7eb054b2f8174c398e8e1bf6b7af7a96
test outcome: killed
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ > '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
==================================== ERRORS ====================================
_______ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ________
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
__________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
_________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py:3: in <module>
    import linkedList1 as module

35 : Job ID 9b9c246cf4c545aca099e9fb531cdf20
SURVIVED
test outcome: survived
linkedList1.py, start pos: (130, 21), end pos: (130, 23)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index >= self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

36 : Job ID eadbc9ff2f6a45c7959a256e378d4146
SURVIVED
test outcome: survived
linkedList1.py, start pos: (134, 23), end pos: (134, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -131,7 +131,7 @@
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
-            elif index == 0:
+            elif index >= 0:
                 #              _____   _____
                 # self.head|->|  A  | |  C  |
                 #           <-|_____| |_____|
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

37 : Job ID 55ca75e679a446e9a2a8d16b9fa7a7cf
test outcome: killed
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ >= '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
==================================== ERRORS ====================================
_______ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ________
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
__________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
_________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py:3: in <module>
    import linkedList1 as modu

38 : Job ID e7ac0cc7126f4252baf8b3364c987fd7
test outcome: killed
linkedList1.py, start pos: (130, 21), end pos: (130, 23)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index is self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................F.... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_l

39 : Job ID e3a51f8902d049d4a6d58fbf97363219
SURVIVED
test outcome: survived
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ is '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=============================== warnings summary ===============================
linkedList1.py:180
  /home/auri/temp/lucca/python_experiments/linkedList1/linkedList1.py:180: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if __name__ is '__main__':
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 91 passed, 1 warning in 0.41s =========================

40 : Job ID fddcd72f83cf4c83a6328d1c16ac0f4c
test outcome: killed
linkedList1.py, start pos: (130, 21), end pos: (130, 23)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index is not self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..................F..F... [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F...F.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ......................F...F.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_18 _________________________________
    def test_case_18():
        bool_0 = False
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.next()
        assert var_1 is False
        var_2 = doubly_li

41 : Job ID 9fd88df564444528a568d3737520664f
test outcome: killed
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ is not '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
==================================== ERRORS ====================================
_______ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ________
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
__________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
_________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py:3: in <module>
    import linkedList1 a

42 : Job ID 603d961018af469caff337b49bcd1f65
test outcome: killed
linkedList1.py, start pos: (35, 39), end pos: (35, 40)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size or index == 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..F...................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......FF...................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..F............F............. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        int_0 = -1461
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__getitem__(int_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList object

43 : Job ID a9308a26abfc4ef69e6658c5c2fd5393
test outcome: killed
linkedList1.py, start pos: (44, 39), end pos: (44, 40)
operator: core/ReplaceComparisonOperator_Lt_Eq, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size or index == 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F......FFFF..F.F [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........FF................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ................F......F..... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        var_3
