44 : Job ID a3a014aa8b0e4166a85874e4ef63f06e
test outcome: killed
linkedList1.py, start pos: (35, 39), end pos: (35, 40)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size or index != 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F........................ [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........................F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_22 _________________________________
    def test_case_22():
        bytes_0 = b'}\xd9\xff\xe7\xea\xfbPJk\x0328\x8b\xd4`'
        bool_0 = False
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__c

45 : Job ID 7886ee7198fd43fe9bd40c931fda1b99
test outcome: killed
linkedList1.py, start pos: (44, 39), end pos: (44, 40)
operator: core/ReplaceComparisonOperator_Lt_NotEq, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size or index != 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ....................FF... [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........................F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_20 _________________________________
    def test_case_20():
        bool_0 = True
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        none_type_0 = None
        var_1 = doubly_linked_list_0.__contains__(none_type_0)
        assert var_1 is False
        object_0 = module_1.object()
        var_2 = doubly_linke

46 : Job ID 052819c069a14e99af20a1c51f570cf4
test outcome: killed
linkedList1.py, start pos: (35, 39), end pos: (35, 40)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size or index <= 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......F....................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ...............F............. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        var_1 = doubly_linked_list_0.append(var_0)
        assert len(doubly_linked_list_0) == 1
>       var_2 = doubly_linked_list_0.__getitem__(var_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_

47 : Job ID 7335d7ea39324049813052918af8d3e5
test outcome: killed
linkedList1.py, start pos: (44, 39), end pos: (44, 40)
operator: core/ReplaceComparisonOperator_Lt_LtE, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size or index <= 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F......FFFF..F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........F.................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ................F............ [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        var_

48 : Job ID 4fd443c960714cfe90e392318b97250e
test outcome: killed
linkedList1.py, start pos: (35, 39), end pos: (35, 40)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size or index > 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..F...................F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F.F...................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..F......................F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        int_0 = -1461
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__getitem__(int_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList object a

49 : Job ID 1cd76d5c8feb4964a0b545e203b33503
test outcome: killed
linkedList1.py, start pos: (44, 39), end pos: (44, 40)
operator: core/ReplaceComparisonOperator_Lt_Gt, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size or index > 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ....................FF..F [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ..........F................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .......................F..F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_20 _________________________________
    def test_case_20():
        bool_0 = True
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        none_type_0 = None
        var_1 = doubly_linked_list_0.__contains__(none_type_0)
        assert var_1 is False
        object_0 = module_1.object()
        var_2 = doubly_linked_li

50 : Job ID d0ccf259983045f88ca9eb29e4da27ad
test outcome: killed
linkedList1.py, start pos: (35, 39), end pos: (35, 40)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size or index >= 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..F...................F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....FFF...................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..F............F.........F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        int_0 = -1461
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__getitem__(int_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList object

51 : Job ID c900fbf2a1184fbcba9b2c57f94095ac
test outcome: killed
linkedList1.py, start pos: (44, 39), end pos: (44, 40)
operator: core/ReplaceComparisonOperator_Lt_GtE, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size or index >= 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F......FFFFFFF.F [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........FF................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ................F......F..F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        var_

52 : Job ID a9c7143580784e26addd693aeba8bbeb
test outcome: killed
linkedList1.py, start pos: (35, 17), end pos: (35, 19)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index == self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .............F............... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_13 _________________________________
    def test_case_13():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(doubly_linked_list_0)
        singly_linked_list_1 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_1) == 0

53 : Job ID cda785971cb34c91bfc0cbe72d35241c
test outcome: killed
linkedList1.py, start pos: (44, 17), end pos: (44, 19)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index == self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..............F.............. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_14 _________________________________
    def test_case_14():
        bool_0 = True
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           singly_linked_list_0.__setitem__(bool_0, bool_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py:186: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.SinglyLinkedList object at 0x7fb5d5

54 : Job ID 16156d7c744a42ed847030c11936acb1
test outcome: killed
linkedList1.py, start pos: (123, 17), end pos: (123, 19)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if index == self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ............F..F......... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_12 _________________________________
    def test_case_12():
        float_0 = 1672.3461366306228
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(float_0)
        assert var_0 is False
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qual

55 : Job ID 7dc45fc868244cf29588f238539cbe5e
test outcome: killed
linkedList1.py, start pos: (35, 17), end pos: (35, 19)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index != self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...........F..........F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....FF.F..................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ...............F.........F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_11 _________________________________
    def test_case_11():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__contains__(doubly_linked_list_1)
        assert var_1 is False

56 : Job ID 8b2f3a6bac5f4caea0072e28349ff3d6
test outcome: killed
linkedList1.py, start pos: (44, 17), end pos: (44, 19)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index != self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F....F.FFFFFFF.. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........F.F.................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ................F.........F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        va

57 : Job ID 1bcb943d03744ec8aa3585d0e50122d0
test outcome: killed
linkedList1.py, start pos: (123, 17), end pos: (123, 19)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if index != self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF..FFF. [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.FFF.FF [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F....F..FFF.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1
        var_2 = doubly_linked_list_0.__setitem__(var_0, var_1)
>

58 : Job ID 4c3af017d4dd4bc3b3e14815fef635ab
test outcome: killed
linkedList1.py, start pos: (35, 17), end pos: (35, 19)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index < self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...........F..........F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....FF.F..................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .............F.F.........F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_11 _________________________________
    def test_case_11():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__contains__(doubly_linked_list_1)
        assert var_1 is False

59 : Job ID ababc92426cd445f809a9348ac005af3
test outcome: killed
linkedList1.py, start pos: (44, 17), end pos: (44, 19)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index < self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F....F.FFFFFFF.. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........F.F.................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..............F.F.........F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        var_3

60 : Job ID a15b8ae22fc74cfdb7a208c540b85e0d
test outcome: killed
linkedList1.py, start pos: (123, 17), end pos: (123, 19)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if index < self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ............F..F.FF..FFF. [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.FFF.FF [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F....F..FFF.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_12 _________________________________
    def test_case_12():
        float_0 = 1672.3461366306228
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(float_0)
        assert var_0 is False
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualn

61 : Job ID 6955617934e24c86b2fac0ac898cd3d9
test outcome: killed
linkedList1.py, start pos: (35, 17), end pos: (35, 19)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index <= self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....FF....................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .............F.F.........F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_22 _________________________________
    def test_case_22():
        bytes_0 = b'}\xd9\xff\xe7\xea\xfbPJk\x0328\x8b\xd4`'
        bool_0 = False
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__con

62 : Job ID c2972212925d45f19ba29453cf2025da
test outcome: killed
linkedList1.py, start pos: (44, 17), end pos: (44, 19)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index <= self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F......FFFFFFF.. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........F.................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..............F.F.........F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        var_
