63 : Job ID 9847a7a9d77c473ca8e03ea3ea9f0c23
test outcome: killed
linkedList1.py, start pos: (123, 17), end pos: (123, 19)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if index <= self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ............F..F.FF..FFF. [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.FFF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F.......FFF.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_12 _________________________________
    def test_case_12():
        float_0 = 1672.3461366306228
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(float_0)
        assert var_0 is False
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qua

64 : Job ID 440700a64aa34855af0aaeb18dd1a9be
test outcome: killed
linkedList1.py, start pos: (35, 17), end pos: (35, 19)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index > self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...........F............. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ........F..................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_11 _________________________________
    def test_case_11():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__contains__(doubly_linked_list_1)
        assert var_1 is False

65 : Job ID 64a30a59cc814b028a8d102f06eabeb6
test outcome: killed
linkedList1.py, start pos: (44, 17), end pos: (44, 19)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index > self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..............F.......... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ...........F.................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_14 _________________________________
    def test_case_14():
        bool_0 = False
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__setitem__(bool_0, doubly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:152: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList

66 : Job ID 471e031aafb64a99a47a4ec9b0ac5a7a
test outcome: killed
linkedList1.py, start pos: (123, 17), end pos: (123, 19)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if index > self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................F [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .................F........... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_29 _________________________________
    def test_case_29():
        bool_0 = False
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
>       with pytest.raises(IndexError):
E       Failed: DID NOT RAISE <class 'IndexError'>
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py:314: Failed
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = mod

67 : Job ID c0789a8ad718404f9e0999a948c14c58
test outcome: killed
linkedList1.py, start pos: (35, 17), end pos: (35, 19)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index is self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...........F............. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ........F..................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .............F............... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_11 _________________________________
    def test_case_11():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__contains__(doubly_linked_list_1)
        assert var_1 is False

68 : Job ID 6eba07b7052b485483f87fadb968504f
test outcome: killed
linkedList1.py, start pos: (44, 17), end pos: (44, 19)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index is self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..............F.......... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ...........F.................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..............F.............. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_14 _________________________________
    def test_case_14():
        bool_0 = False
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__setitem__(bool_0, doubly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:152: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList

69 : Job ID 77f8ddf0d44e43d1a03157f6181a827f
test outcome: killed
linkedList1.py, start pos: (123, 17), end pos: (123, 19)
operator: core/ReplaceComparisonOperator_GtE_Is, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if index is self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ............F..F......... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................F [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .................F........... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_12 _________________________________
    def test_case_12():
        float_0 = 1672.3461366306228
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(float_0)
        assert var_0 is False
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qual

70 : Job ID 3c9c845d3c564b78837e30a506bca5eb
test outcome: killed
linkedList1.py, start pos: (35, 17), end pos: (35, 19)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index is not self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....FF....................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ...............F.........F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_22 _________________________________
    def test_case_22():
        bytes_0 = b'}\xd9\xff\xe7\xea\xfbPJk\x0328\x8b\xd4`'
        bool_0 = False
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0

71 : Job ID 4947b8816d81443ca83880213f6d409a
test outcome: killed
linkedList1.py, start pos: (44, 17), end pos: (44, 19)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index is not self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F......FFFFFFF.. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........F.................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ................F.........F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2

72 : Job ID fed180e9e5b14bf8985f10b327080819
test outcome: killed
linkedList1.py, start pos: (123, 17), end pos: (123, 19)
operator: core/ReplaceComparisonOperator_GtE_IsNot, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if index is not self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF..FFF. [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.FFF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F.......FFF.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1
        var_2 = doubly_linked_list_0.__setitem__(var_0, var_

73 : Job ID 2084054f97914e93a0b9d1794ac57d52
SURVIVED
test outcome: survived
linkedList1.py, start pos: (24, 28), end pos: (24, 30)
operator: core/ReplaceComparisonOperator_Is_Eq, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if cur.data == item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

74 : Job ID 0850d693479c4f76ae954d2902887ffb
test outcome: killed
linkedList1.py, start pos: (24, 28), end pos: (24, 30)
operator: core/ReplaceComparisonOperator_Is_NotEq, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if cur.data != item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F.....F..F.FFFFFF. [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FF..F.........FF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF..F..FF..........F.... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNA

75 : Job ID 83bca568c49540398a3e54be7ca86b1c
test outcome: killed
linkedList1.py, start pos: (24, 28), end pos: (24, 30)
operator: core/ReplaceComparisonOperator_Is_Lt, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if cur.data < item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F.....F..F.FFFFFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FFF.F........FFF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF..FF.FF......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
>       var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

76 : Job ID 3fb027c6fe48415fb299ad5825e09dc5
test outcome: killed
linkedList1.py, start pos: (24, 28), end pos: (24, 30)
operator: core/ReplaceComparisonOperator_Is_LtE, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if cur.data <= item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F.....F..F.FFFFFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FFF.F........FFF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF..F..FF......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
>       var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

77 : Job ID bb19824f90c14c1aa3ff994589ec8e3a
test outcome: killed
linkedList1.py, start pos: (24, 28), end pos: (24, 30)
operator: core/ReplaceComparisonOperator_Is_Gt, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if cur.data > item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F.....F..F.FFFFFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FFF.F........FFF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF..FF.FF......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
>       var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

78 : Job ID f4bb699af7384e2eba734d5c91baa478
test outcome: killed
linkedList1.py, start pos: (24, 28), end pos: (24, 30)
operator: core/ReplaceComparisonOperator_Is_GtE, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if cur.data >= item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F.....F..F.FFFFFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FFF.F........FFF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF..F..FF......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
>       var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:47: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

79 : Job ID 8d39967a23eb4f2da0eee2199eb7ce5f
test outcome: killed
linkedList1.py, start pos: (24, 28), end pos: (24, 30)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if cur.data is not item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F.....F..F.FFFFFF. [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FF..F.........FF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF..F..FF..........F.... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedList1_

80 : Job ID 28e8a782fb7d418aa2033563a1bb72ef
test outcome: killed
linkedList1.py, start pos: (53, 23), end pos: (53, 25)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -50,7 +50,7 @@
             cur.data = value
     def next(self):
-        if self.cursor is None:
+        if self.cursor is not None:
             raise StopIteration()
         else:
             node = self.cursor.data
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...FF.............F..F.F. [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F......FF..F..F.......... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ...F.....F..............FF.F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(StopIteration):
>           doubly_linked_list_0.next()
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList object at 0x7f0857241720>
    def next(self):
        if self.cursor is not None:

81 : Job ID 87054599225f466b8d02abda541bb5e0
test outcome: killed
linkedList1.py, start pos: (65, 21), end pos: (65, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -62,7 +62,7 @@
             however, insertion is O(1), giving it an
             advantage over arrays.
         """
-        if self.head is None:
+        if self.head is not None:
             self.head = SinglyLinkedNode(data)
             self.cursor = self.head
         else:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ....F....F............... [ 27%]
.F.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F........FFFF............ [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F..F.....F....F...FF.F....FF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        float_0 = 1673.4114
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
>       var_0 = singly_linked_list_0.append(singly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:33: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.SinglyLinkedList object at 0

82 : Job ID 834600ba24f24fddaf3f7e5f36b70d99
test outcome: killed
linkedList1.py, start pos: (95, 28), end pos: (95, 30)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 3
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -92,7 +92,7 @@
         super(DoublyLinkedList, self).__init__()
     def previous(self):
-        if self.cursor.prev is None:
+        if self.cursor.prev is not None:
             raise StopIteration()
         else:
             self.cursor.prev
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..........F........FF.FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ..................FF.......... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........F.........F.F....F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_10 _________________________________
    def test_case_10():
        bool_0 = True
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        with pytest.raises(StopIteration):
>           doubly_linked_list_0.previous()
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:97: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
