84 : Job ID 22f9f0f57500485494a7a61ea9d1f8d9
test outcome: killed
linkedList1.py, start pos: (125, 21), end pos: (125, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 5
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -122,7 +122,7 @@
     def insert(self, data, index):
         if index >= self.size:
             raise IndexError()
-        if self.head is None:
+        if self.head is not None:
             self.head = DoublyLinkedNode(data)
             self.cursor = self.head
         else:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
..F.                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ........................FFF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F.......FF..FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1
        var_2 = doubly_linked_list

85 : Job ID a3aa012f92844d428b8c9ebbea98215a
test outcome: killed
linkedList1.py, start pos: (21, 21), end pos: (21, 27)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -18,7 +18,7 @@
         return self
     def __contains__(self, item):
-        if self.head is not None:
+        if self.head is None:
             cur = self.head
             while cur is not None:
                 if cur.data is item:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F........F...FFFF. [ 27%]
FF..                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .F.F..........F............... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF...F..F......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:48: AssertionError
___________

86 : Job ID 5ff7d4997e104c9f8f54c3925eeb5a4f
test outcome: killed
linkedList1.py, start pos: (23, 22), end pos: (23, 28)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -20,7 +20,7 @@
     def __contains__(self, item):
         if self.head is not None:
             cur = self.head
-            while cur is not None:
+            while cur is None:
                 if cur.data is item:
                     return True
                 cur = cur.next
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F........F...FFFF. [ 27%]
FF..                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .F.F..........F............... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF...F..F......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedLis

87 : Job ID ba0ede5002ba49e3a0b21a012ef4ccec
test outcome: killed
linkedList1.py, start pos: (71, 28), end pos: (71, 34)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -68,7 +68,7 @@
         else:
             node = self.head
             # This is a common pattern with linked lists
-            while node.next is not None:
+            while node.next is None:
                 node = node.next
             # [node] [new_node]->None
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F............... [ 27%]
.F.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F........FFF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........F........FF.F.....F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
>       var_2 = singly_linked_list_0.append(singly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYN

89 : Job ID 41980e2c1de5469ba7f224b46e4e8e81
SURVIVED
test outcome: survived
linkedList1.py, start pos: (189, 16), end pos: (189, 17)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -186,4 +186,4 @@
     print (test[0])
     print (test[1])
     print (test[2])
-    print (test[-1])
+    print (test[+1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

90 : Job ID a6f5a2fa821c48af8182f4a54acfcc38
SURVIVED
test outcome: survived
linkedList1.py, start pos: (189, 16), end pos: (189, 17)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -186,4 +186,4 @@
     print (test[0])
     print (test[1])
     print (test[2])
-    print (test[-1])
+    print (test[~1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

91 : Job ID 8de481a63756473b9fc8d1c07e1ec46e
SURVIVED
test outcome: survived
linkedList1.py, start pos: (189, 16), end pos: (189, 17)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -186,4 +186,4 @@
     print (test[0])
     print (test[1])
     print (test[2])
-    print (test[-1])
+    print (test[not 1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

92 : Job ID 854f7bc091a841f5b8e897085076a7ee
SURVIVED
test outcome: survived
linkedList1.py, start pos: (189, 16), end pos: (189, 17)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -186,4 +186,4 @@
     print (test[0])
     print (test[1])
     print (test[2])
-    print (test[-1])
+    print (test[1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

93 : Job ID d532453110cc445795e92fed18fe3a00
test outcome: killed
linkedList1.py, start pos: (21, 11), end pos: (21, 32)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -18,7 +18,7 @@
         return self
     def __contains__(self, item):
-        if self.head is not None:
+        if not self.head is not None:
             cur = self.head
             while cur is not None:
                 if cur.data is item:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F........F...FFFF. [ 27%]
FF..                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .F.F..........F............... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF...F..F......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:48: AssertionError
_______________________________

94 : Job ID 566da2dde8404c1ab3511aa67b596a9b
test outcome: killed
linkedList1.py, start pos: (23, 18), end pos: (23, 33)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -20,7 +20,7 @@
     def __contains__(self, item):
         if self.head is not None:
             cur = self.head
-            while cur is not None:
+            while not cur is not None:
                 if cur.data is item:
                     return True
                 cur = cur.next
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F........F...FFFF. [ 27%]
FF..                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .F.F..........F............... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF...F..F......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:48: A

95 : Job ID cb8c720ba2f14fce96148f6c7c44a92a
test outcome: killed
linkedList1.py, start pos: (24, 19), end pos: (24, 35)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -21,7 +21,7 @@
         if self.head is not None:
             cur = self.head
             while cur is not None:
-                if cur.data is item:
+                if not cur.data is item:
                     return True
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F.....F..F.FFFFFF. [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FF..F.........FF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF..F..FF..........F.... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:48: AssertionErr

96 : Job ID 6813e105321148d39a49007b30660315
test outcome: killed
linkedList1.py, start pos: (35, 11), end pos: (35, 42)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if not index >= self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...........F..........F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....FF.F..................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .............F.F.........F... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_11 _________________________________
    def test_case_11():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__contains__(doubly_linked_list_1)
        assert var_1 is False
        doubly_linked_list

97 : Job ID ecde2201409c42bf8bed21e6914a657e
test outcome: killed
linkedList1.py, start pos: (44, 11), end pos: (44, 42)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if not index >= self.size or index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F....F.FFFFFFF.. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........F.F.................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..............F.F.........F.. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        var_3 = singly_linked_list_

98 : Job ID 226a3f34bb9a4b3dae611340fd45fd72
test outcome: killed
linkedList1.py, start pos: (53, 11), end pos: (53, 30)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -50,7 +50,7 @@
             cur.data = value
     def next(self):
-        if self.cursor is None:
+        if not self.cursor is None:
             raise StopIteration()
         else:
             node = self.cursor.data
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...FF.............F..F.F. [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F......FF..F..F.......... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ...F.....F..............FF.F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(StopIteration):
>           doubly_linked_list_0.next()
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList object at 0x7efe4341e3b0>
    def next(self):
        if not self.cursor is None:
            raise StopIterati

99 : Job ID d9c88af8a434498797438953a4829963
test outcome: killed
linkedList1.py, start pos: (65, 11), end pos: (65, 28)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -62,7 +62,7 @@
             however, insertion is O(1), giving it an
             advantage over arrays.
         """
-        if self.head is None:
+        if not self.head is None:
             self.head = SinglyLinkedNode(data)
             self.cursor = self.head
         else:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ....F....F............... [ 27%]
.F.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F........FFFF............ [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F..F.....F....F...FF.F....FF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        float_0 = 1673.4114
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
>       var_0 = singly_linked_list_0.append(singly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:33: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.SinglyLinkedList object at 0x7fc5a0b51db0>
data = <linke

100 : Job ID 7a207bcf379344e8933c4ae88c260d7a
test outcome: killed
linkedList1.py, start pos: (71, 18), end pos: (71, 39)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -68,7 +68,7 @@
         else:
             node = self.head
             # This is a common pattern with linked lists
-            while node.next is not None:
+            while not node.next is not None:
                 node = node.next
             # [node] [new_node]->None
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F............... [ 27%]
.F.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F........FFF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........F........FF.F.....F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
>       var_2 = singly_linked_list_0.append(singly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:81: 
_ _ _

101 : Job ID e75b9870e15f4a3e9f3ddc997b16285f
test outcome: killed
linkedList1.py, start pos: (95, 11), end pos: (95, 35)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -92,7 +92,7 @@
         super(DoublyLinkedList, self).__init__()
     def previous(self):
-        if self.cursor.prev is None:
+        if not self.cursor.prev is None:
             raise StopIteration()
         else:
             self.cursor.prev
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..........F........FF.FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ..................FF.......... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..........F.........F.F....F. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_10 _________________________________
    def test_case_10():
        bool_0 = True
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        with pytest.raises(StopIteration):
>           doubly_linked_list_0.previous()
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:97: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

104 : Job ID bf964b593c354edb8f0bf8b6b01d2a42
test outcome: killed
linkedList1.py, start pos: (123, 11), end pos: (123, 29)
operator: core/AddNot, occurrence: 11
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -120,7 +120,7 @@
         self.size += 1
     def insert(self, data, index):
-        if index >= self.size:
+        if not index >= self.size:
             raise IndexError()
         if self.head is None:
             self.head = DoublyLinkedNode(data)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ............F..F.FF..FFF. [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.FFF.FF [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F....F..FFF.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_12 _________________________________
    def test_case_12():
        float_0 = 1672.3461366306228
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(float_0)
        assert var_0 is False
        doubly_linked_node_0 = module_0.DoublyLinkedNode(doubly_linked_list_0)
        assert f'{type(doubly_linked_node_0.data).__module__}.{type(doubly_linked_node_0.data).__qualname__}' == 'linkedL

105 : Job ID 83b775ee618448479a6c24e652910e2a
test outcome: killed
linkedList1.py, start pos: (125, 11), end pos: (125, 28)
operator: core/AddNot, occurrence: 12
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -122,7 +122,7 @@
     def insert(self, data, index):
         if index >= self.size:
             raise IndexError()
-        if self.head is None:
+        if not self.head is None:
             self.head = DoublyLinkedNode(data)
             self.cursor = self.head
         else:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
..F.                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ........................FFF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F.......FF..FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1
        var_2 = doubly_linked_list_0.__setitem__(var_0, var_

106 : Job ID 1455b9cd13ed429c86b2477cecbf77ff
test outcome: killed
linkedList1.py, start pos: (130, 15), end pos: (130, 37)
operator: core/AddNot, occurrence: 13
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if not index == self.size - 1:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF..FFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F..FF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F.F.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1

107 : Job ID cffb64bce41b4cc3be76ac54368db642
test outcome: killed
linkedList1.py, start pos: (180, 3), end pos: (180, 25)
operator: core/AddNot, occurrence: 14
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if not __name__ == '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
==================================== ERRORS ====================================
_______ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ________
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
__________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:189: in <module>
    print (test[-1])
linkedList1.py:36: in __getitem__
    raise IndexError()
E   IndexError
------------------------------- Captured stdout --------------------------------
2
3
4
_________ ERROR collecting DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py __________
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py:3: in <module>
    import linkedList1 as module_0
linkedList1.py:1
