108 : Job ID 0e95db844c7c4bde8b0d0b59ec8866ab
test outcome: killed
linkedList1.py, start pos: (25, 27), end pos: (25, 31)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -22,7 +22,7 @@
             cur = self.head
             while cur is not None:
                 if cur.data is item:
-                    return True
+                    return False
                 cur = cur.next
         return False
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....F.F........F...FFFF. [ 27%]
FF..                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .F.F..........F............... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F...FF...F..F......F...FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
>       assert var_1 is True
E       assert False is True
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:48: AssertionError
_________________________

109 : Job ID b63c801807da4cd7b61f90d099c56de0
test outcome: killed
linkedList1.py, start pos: (27, 15), end pos: (27, 20)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -24,7 +24,7 @@
                 if cur.data is item:
                     return True
                 cur = cur.next
-        return False
+        return True
     """ Both getitem and setitem represent the magic methods
         for the object[index] and object[index] = other operations
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ...........FFF..FFFFFFFF. [ 27%]
...F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ..F.FFF........FF............. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........F..F..FFF......F.... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_11 _________________________________
    def test_case_11():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__iter__()
        assert len(var_0) == 0
        doubly_linked_list_1 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_1) == 0
        var_1 = doubly_linked_list_1.__contains__(doubly_linked_list_1)
>       assert var_1 is

110 : Job ID 5d5582cecde14fa2847d4ab6f9372066
test outcome: killed
linkedList1.py, start pos: (35, 30), end pos: (35, 32)
operator: core/ReplaceOrWithAnd, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size and index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..F........F............. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .......FF..................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..F..........F............... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        int_0 = -1461
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__getitem__(int_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:21: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList object at 0x7fadf4c10

111 : Job ID 342d77926a4246d88073a53b2ffebc37
test outcome: killed
linkedList1.py, start pos: (44, 30), end pos: (44, 32)
operator: core/ReplaceOrWithAnd, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size and index < 0:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ..............F.........F [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ..........FF.................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ..............F........F..... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_14 _________________________________
    def test_case_14():
        bool_0 = False
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        with pytest.raises(IndexError):
>           doubly_linked_list_0.__setitem__(bool_0, doubly_linked_list_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:152: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <linkedList1.DoublyLinkedList object at 0x7

112 : Job ID fbd857bc268d4c91b876252e4a6a05f1
test outcome: killed
linkedList1.py, start pos: (11, 20), end pos: (11, 21)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -8,7 +8,7 @@
     def __init__(self):
         self.head = None
-        self.size = 0
+        self.size = 1
         self.cursor = None
     def __len__(self):
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py FFFFFFFFFFFFFFFFFFFFFFFFF [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py FFFFFFFFFFFFFFFFFFFFFFFFFFFFFF [ 64%]
FFF                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py FFFFFFFFFFFFFFFFFFFFFFFFFFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<linkedList1.DoublyLinkedList object at 0x7f143801cdc0>)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:8: AssertionError
_________________________________ test_case_1 __________________________________
    def test_case_1():
        float_0 = 1673.4114
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       assert len(singly_linked_list_0) == 0
E       a

113 : Job ID fcb88e564c9544a1b34ed3c0c1e1f963
test outcome: killed
linkedList1.py, start pos: (11, 20), end pos: (11, 21)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -8,7 +8,7 @@
     def __init__(self):
         self.head = None
-        self.size = 0
+        self.size = -1
         self.cursor = None
     def __len__(self):
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py FFFFFFFFFFFFFFFFFFFFFFFFF [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py FFFFFFFFFFFFFFFFFFFFFFFFFFFFFF [ 64%]
FFF                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py FFFFFFFFFFFFFFFFFFFFFFFFFFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
>       assert len(doubly_linked_list_0) == 0
E       ValueError: __len__() should return >= 0
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:8: ValueError
_________________________________ test_case_1 __________________________________
    def test_case_1():
        float_0 = 1673.4114
        singly_linked_list_0 = module_0.SinglyLinkedList()
>       assert len(singly_linked_list_0) == 0
E       ValueError: __len__() should return >= 0
DYNAMOSA-MIO-MOSA/t

114 : Job ID d6a12cf9070143c0b09eee314eed5776
test outcome: killed
linkedList1.py, start pos: (35, 41), end pos: (35, 42)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size or index < 1:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......F....................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ...............F............. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        var_1 = doubly_linked_list_0.append(var_0)
        assert len(doubly_linked_list_0) == 1
>       var_2 = doubly_linked_list_0.__getitem__(var_0)
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py:73: 
_ _ _

115 : Job ID 9cd78200616d416cb3f2bb533b3f050c
SURVIVED
test outcome: survived
linkedList1.py, start pos: (35, 41), end pos: (35, 42)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -32,7 +32,7 @@
         efficient than a list() for lookups
     """
     def __getitem__(self, index):
-        if index >= self.size or index < 0:
+        if index >= self.size or index < -1:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

116 : Job ID a806e449d8de4d03b5ce07f498e135cb
test outcome: killed
linkedList1.py, start pos: (44, 41), end pos: (44, 42)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size or index < 1:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .........F......FFFF..F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........F.................... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ................F............ [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.__contains__(singly_linked_list_0)
        var_1 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 1
        var_2 = singly_linked_list_0.append(singly_linked_list_0)
        assert len(singly_linked_list_0) == 2
        var_3 = singly_linked_

117 : Job ID 5414883b629d42299d7cff13afb02d94
SURVIVED
test outcome: survived
linkedList1.py, start pos: (44, 41), end pos: (44, 42)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -41,7 +41,7 @@
             return cur.data
     def __setitem__(self, index, value):
-        if index >= self.size or index < 0:
+        if index >= self.size or index < -1:
             raise IndexError()
         else:
             cur = self.head
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

118 : Job ID bab83a66c52246079c10f0d06db71b14
test outcome: killed
linkedList1.py, start pos: (80, 21), end pos: (80, 22)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -77,7 +77,7 @@
             # [node]->[new_node]->None
             node.next = new_node
-        self.size += 1
+        self.size += 2
 class SinglyLinkedNode(object):
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ....F....F............... [ 27%]
.F.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F........FFFF............ [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F..F.....F....F...FF.F....FF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        float_0 = 1673.4114
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.append(singly_linked_list_0)
>       assert len(singly_linked_list_0) == 1
E       assert 2 == 1
E        +  where 2 = len(<linkedList1.SinglyLinkedList object at 0x7f373a8ba890>)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:34: AssertionError
_________________________________ test_case_9 __________________________________
    def test_cas

119 : Job ID ab245b9ef7b945d881c72c9191d3275e
test outcome: killed
linkedList1.py, start pos: (80, 21), end pos: (80, 22)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -77,7 +77,7 @@
             # [node]->[new_node]->None
             node.next = new_node
-        self.size += 1
+        self.size += 0
 class SinglyLinkedNode(object):
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ....F....F............... [ 27%]
.F.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .....F........FFFF............ [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .F..F.....F....F...FF.F....FF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        float_0 = 1673.4114
        singly_linked_list_0 = module_0.SinglyLinkedList()
        assert len(singly_linked_list_0) == 0
        var_0 = singly_linked_list_0.append(singly_linked_list_0)
>       assert len(singly_linked_list_0) == 1
E       assert 0 == 1
E        +  where 0 = len(<linkedList1.SinglyLinkedList object at 0x7fadd584e500>)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:34: AssertionError
_________________________________ test_case_9 __________________________________
    def test_cas

120 : Job ID 0a1d1e1fb4aa47a1a1fb33f9de6bf643
test outcome: killed
linkedList1.py, start pos: (120, 21), end pos: (120, 22)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -117,7 +117,7 @@
             new_node = DoublyLinkedNode(data)
             node.next = new_node
             new_node.prev = node
-        self.size += 1
+        self.size += 2
     def insert(self, data, index):
         if index >= self.size:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....FFF..F.FF.FFFFFFFFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FFF..F..F...F....FFFFFF.FFFF. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .FF..FFF.FFF.F..F.F.F.F.FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
>       assert len(doubly_linked_list_0) == 1
E       assert 2 == 1
E        +  where 2 = len(<linkedList1.DoublyLinkedList object at 0x7f39d8db6c80>)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:46: AssertionError
_________________________________ test_case_6

121 : Job ID dc0c4e57ff3d49cda342f87e04bd6b60
test outcome: killed
linkedList1.py, start pos: (120, 21), end pos: (120, 22)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -117,7 +117,7 @@
             new_node = DoublyLinkedNode(data)
             node.next = new_node
             new_node.prev = node
-        self.size += 1
+        self.size += 0
     def insert(self, data, index):
         if index >= self.size:
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .....FFF..F.FF.FFFFFFFFF. [ 27%]
FF.F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .FFF..F..F...F....FFFFFF.FFFF. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .FF..FFF.FFF.F..F.F.F.F.FFFFF [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(doubly_linked_list_0)
>       assert len(doubly_linked_list_0) == 1
E       assert 0 == 1
E        +  where 0 = len(<linkedList1.DoublyLinkedList object at 0x7f2057359e40>)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py:46: AssertionError
_________________________________ test_case_6

122 : Job ID 0cb6c990d6bd48b48ecd4618369e0783
test outcome: killed
linkedList1.py, start pos: (130, 36), end pos: (130, 37)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size - 2:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF...FF. [ 27%]
F..F                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1

123 : Job ID 46aa00278f0b4967b7e38afc3aad8177
test outcome: killed
linkedList1.py, start pos: (130, 36), end pos: (130, 37)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -127,7 +127,7 @@
             self.cursor = self.head
         else:
             # If this insertion should be an append
-            if index == self.size - 1:
+            if index == self.size - 0:
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................F....FF. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .........................FF... [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.........F...FF... [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1

124 : Job ID cf6c3d9d2fed4b8ba3c9981d51b6ede5
SURVIVED
test outcome: survived
linkedList1.py, start pos: (134, 26), end pos: (134, 27)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -131,7 +131,7 @@
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
-            elif index == 0:
+            elif index == 1:
                 #              _____   _____
                 # self.head|->|  A  | |  C  |
                 #           <-|_____| |_____|
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.43s ==============================

125 : Job ID b1f00f32055b4a4187655cab678419ca
SURVIVED
test outcome: survived
linkedList1.py, start pos: (134, 26), end pos: (134, 27)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -131,7 +131,7 @@
                 # We've got a method for that!
                 self.append(data)
             # If a new head needs to be added
-            elif index == 0:
+            elif index == -1:
                 #              _____   _____
                 # self.head|->|  A  | |  C  |
                 #           <-|_____| |_____|
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

126 : Job ID 258323940ae14ede9bc97dbb60848969
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 39), end pos: (151, 40)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index - 2):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

127 : Job ID e2629c0d9abc45c9a52a532ddff6c22e
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 39), end pos: (151, 40)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in range(index - 0):
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

128 : Job ID 6b9926101afa4260b16cfe58a87954cf
test outcome: killed
linkedList1.py, start pos: (171, 21), end pos: (171, 22)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -168,7 +168,7 @@
                 a.next = c
                 c.prev = a
-        self.size += 1
+        self.size += 2
 class DoublyLinkedNode(SinglyLinkedNode):
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF..FFF. [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.FFF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F.......FFF.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1
        var_2 = doubly_linked_list_0.__setitem__(var_0, var_1)
        var_3 = doubly_linked_list_0.insert(var_2, var_0)
>       assert len(doubly_linked_list_0) == 3
E
