129 : Job ID d9415fb8b4f14b5984b61878ec844906
test outcome: killed
linkedList1.py, start pos: (171, 21), end pos: (171, 22)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -168,7 +168,7 @@
                 a.next = c
                 c.prev = a
-        self.size += 1
+        self.size += 0
 class DoublyLinkedNode(SinglyLinkedNode):
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py .................FF..FFF. [ 27%]
FFFF                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py ......................F.FFF.F. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py .........FF.F.......FFF.FFF.F [100%]
=================================== FAILURES ===================================
_________________________________ test_case_17 _________________________________
    def test_case_17():
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.__contains__(doubly_linked_list_0)
        assert var_0 is False
        object_0 = module_1.object()
        var_1 = doubly_linked_list_0.append(object_0)
        assert len(doubly_linked_list_0) == 1
        var_2 = doubly_linked_list_0.__setitem__(var_0, var_1)
        var_3 = doubly_linked_list_0.insert(var_2, var_0)
>       assert len(doubly_linked_list_0) == 3
E

130 : Job ID 400789bc1e4c434886fad136d82ebe59
SURVIVED
test outcome: survived
linkedList1.py, start pos: (182, 16), end pos: (182, 17)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -179,7 +179,7 @@
 if __name__ == '__main__':
     test = SinglyLinkedList()
-    test.append(2)
+    test.append( 3)
     test.append(3)
     test.append(4)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

131 : Job ID 2e36cff56820496c8257a4fb2e2f0152
SURVIVED
test outcome: survived
linkedList1.py, start pos: (182, 16), end pos: (182, 17)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -179,7 +179,7 @@
 if __name__ == '__main__':
     test = SinglyLinkedList()
-    test.append(2)
+    test.append( 1)
     test.append(3)
     test.append(4)
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

132 : Job ID 9e20d55c4cf541528216da0b3ecab363
SURVIVED
test outcome: survived
linkedList1.py, start pos: (183, 16), end pos: (183, 17)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -180,7 +180,7 @@
 if __name__ == '__main__':
     test = SinglyLinkedList()
     test.append(2)
-    test.append(3)
+    test.append( 4)
     test.append(4)
     print (test[0])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

133 : Job ID e92ce89a6ffc45ecb633f22ddcfce4f5
SURVIVED
test outcome: survived
linkedList1.py, start pos: (183, 16), end pos: (183, 17)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -180,7 +180,7 @@
 if __name__ == '__main__':
     test = SinglyLinkedList()
     test.append(2)
-    test.append(3)
+    test.append( 2)
     test.append(4)
     print (test[0])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

134 : Job ID dcb20f8a62df463a8f432b9ac05fa0df
SURVIVED
test outcome: survived
linkedList1.py, start pos: (184, 16), end pos: (184, 17)
operator: core/NumberReplacer, occurrence: 22
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -181,7 +181,7 @@
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
-    test.append(4)
+    test.append( 5)
     print (test[0])
     print (test[1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

135 : Job ID e79300b3c665432185dc1721e9e644e8
SURVIVED
test outcome: survived
linkedList1.py, start pos: (184, 16), end pos: (184, 17)
operator: core/NumberReplacer, occurrence: 23
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -181,7 +181,7 @@
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
-    test.append(4)
+    test.append( 3)
     print (test[0])
     print (test[1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

136 : Job ID 8f80d380ee4a44589a6746dd8cfd8652
SURVIVED
test outcome: survived
linkedList1.py, start pos: (186, 16), end pos: (186, 17)
operator: core/NumberReplacer, occurrence: 24
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -183,7 +183,7 @@
     test.append(3)
     test.append(4)
-    print (test[0])
+    print (test[ 1])
     print (test[1])
     print (test[2])
     print (test[-1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

137 : Job ID 9953e7d3e40a4994aec2c644e4b26993
SURVIVED
test outcome: survived
linkedList1.py, start pos: (186, 16), end pos: (186, 17)
operator: core/NumberReplacer, occurrence: 25
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -183,7 +183,7 @@
     test.append(3)
     test.append(4)
-    print (test[0])
+    print (test[ -1])
     print (test[1])
     print (test[2])
     print (test[-1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

138 : Job ID 296ecfc1fb1a43e5b37a564118ff4008
SURVIVED
test outcome: survived
linkedList1.py, start pos: (187, 16), end pos: (187, 17)
operator: core/NumberReplacer, occurrence: 26
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -184,6 +184,6 @@
     test.append(4)
     print (test[0])
-    print (test[1])
+    print (test[ 2])
     print (test[2])
     print (test[-1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

139 : Job ID 866eb15872bc49608799a23f8a195c0f
SURVIVED
test outcome: survived
linkedList1.py, start pos: (187, 16), end pos: (187, 17)
operator: core/NumberReplacer, occurrence: 27
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -184,6 +184,6 @@
     test.append(4)
     print (test[0])
-    print (test[1])
+    print (test[ 0])
     print (test[2])
     print (test[-1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

140 : Job ID bc3bf3b91eac41a98ca93f1ba8f5203b
SURVIVED
test outcome: survived
linkedList1.py, start pos: (188, 16), end pos: (188, 17)
operator: core/NumberReplacer, occurrence: 28
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -185,5 +185,5 @@
     print (test[0])
     print (test[1])
-    print (test[2])
+    print (test[ 3])
     print (test[-1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

141 : Job ID 9daeeb670b6a44d598cb512665ed8e22
SURVIVED
test outcome: survived
linkedList1.py, start pos: (188, 16), end pos: (188, 17)
operator: core/NumberReplacer, occurrence: 29
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -185,5 +185,5 @@
     print (test[0])
     print (test[1])
-    print (test[2])
+    print (test[ 1])
     print (test[-1])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================

142 : Job ID 54d88bae1b144168a898f322bb045e71
SURVIVED
test outcome: survived
linkedList1.py, start pos: (189, 17), end pos: (189, 18)
operator: core/NumberReplacer, occurrence: 30
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -186,4 +186,4 @@
     print (test[0])
     print (test[1])
     print (test[2])
-    print (test[-1])
+    print (test[- 2])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

143 : Job ID ee64cc19360642b5889228c30429a394
SURVIVED
test outcome: survived
linkedList1.py, start pos: (189, 17), end pos: (189, 18)
operator: core/NumberReplacer, occurrence: 31
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -186,4 +186,4 @@
     print (test[0])
     print (test[1])
     print (test[2])
-    print (test[-1])
+    print (test[- 0])
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.42s ==============================

144 : Job ID 30d33a7c92d644b8ad9dc5b43ea7af65
test outcome: killed
linkedList1.py, start pos: (39, 21), end pos: (39, 33)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -36,7 +36,7 @@
             raise IndexError()
         else:
             cur = self.head
-            for x in range(index):
+            for x in []:
                 cur = cur.next
             return cur.data
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................F.. [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
=================================== FAILURES ===================================
_________________________________ test_case_22 _________________________________
    def test_case_22():
        bytes_0 = b'}\xd9\xff\xe7\xea\xfbPJk\x0328\x8b\xd4`'
        bool_0 = False
        singly_linked_node_0 = module_0.SinglyLinkedNode(bool_0)
        doubly_linked_list_0 = module_0.DoublyLinkedList()
        assert len(doubly_linked_list_0) == 0
        var_0 = doubly_linked_list_0.append(bool_0)
        assert len(doubly_linked_list_0) == 1
        var_1 = doubly_linked_list_0.__contains__(bytes_0)
        assert var_1 is False
        var_2 = doubl

146 : Job ID f436a6376a3645e7ac39ae01dca8f8a4
SURVIVED
test outcome: survived
linkedList1.py, start pos: (151, 25), end pos: (151, 41)
operator: core/ZeroIterationForLoop, occurrence: 2
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -148,7 +148,7 @@
             # It's between two nodes
             else:
                 a = self.head
-                for x in range(index - 1):
+                for x in []:
                     a = a.next
                 #  _____    _____
                 # |  A  |->|  B  |
DYNAMOSA-MIO-MOSA/test_linkedList1_DYNAMOSA.py ......................... [ 27%]
....                                                                     [ 31%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MIO.py .............................. [ 64%]
...                                                                      [ 68%]
DYNAMOSA-MIO-MOSA/test_linkedList1_MOSA.py ............................. [100%]
============================== 91 passed in 0.41s ==============================
