39 : Job ID f9f35977c003404380b342e8b6747afe
SURVIVED
test outcome: survived
linkedList1.py, start pos: (180, 12), end pos: (180, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1
--- mutation diff ---
--- alinkedList1.py
+++ blinkedList1.py
@@ -177,7 +177,7 @@
         super(DoublyLinkedNode, self).__init__(data)
         self.prev = None
-if __name__ == '__main__':
+if __name__ is '__main__':
     test = SinglyLinkedList()
     test.append(2)
     test.append(3)
RANDOM/test_linkedList1_RANDOM.py ...................................... [  1%]
........................................................................ [  5%]
........................................................................ [  8%]
........................................................................ [ 11%]
........................................................................ [ 14%]
........................................................................ [ 18%]
........................................................................ [ 21%]
........................................................................ [ 24%]
........................................................................ [ 27%]
........................................................................ [ 31%]
........................................................................ [ 34%]
........................................................................ [ 37%]
.......................................................
