1 : Job ID 95ebc6a6b6b44b469de54201d4a8faab
test outcome: killed
linkedList3.py, start pos: (26, 23), end pos: (26, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if self.__size != 0:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
timeout

2 : Job ID d4bf8dea6b1c4483a95766f14a8a5a09
test outcome: killed
linkedList3.py, start pos: (40, 23), end pos: (40, 25)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if self.__size != 0:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py .FF........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ...F..........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py .FF........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FFF.FF   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = '+(ff'
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(str_0)
        var_0 = singly_linked_list_0.remove()
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
E       AssertionError: assert 'builtins.NoneType' == 'linkedList3.Node'
E         - linkedList3.Node
E         + builtins.NoneType
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:13: AssertionError
_________________________________ test_case_2 _

3 : Job ID e1a473cf81fa4ec6943c0577788cbdc2
test outcome: killed
linkedList3.py, start pos: (77, 35), end pos: (77, 37)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size != 0 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py .....FF.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F..F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()

4 : Job ID 6ad0bfd4d90f430a8a69354cc52232cf
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 3
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ != "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.15s ==============================

5 : Job ID c6edd26550894745bb46ee416bc63f66
test outcome: killed
linkedList3.py, start pos: (26, 23), end pos: (26, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if self.__size < 0:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
timeout

6 : Job ID 7a31fe65fe5d4af7b5a8705778681ec3
test outcome: killed
linkedList3.py, start pos: (40, 23), end pos: (40, 25)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if self.__size < 0:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F..F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
>       assert node_0.value is None
E       assert <linkedList3.Node object at 0x7faa72813580> is None
E        +  where <linkedList3.Node object at 0x7faa72813580> = <linkedList3.Node object at 0x7faa72810040>.value
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:21: AssertionError
_________________________________ test_case_2 __________________________________
    def test_cas

7 : Job ID ec0273bdfbfb474cbf80ae27f28810c6
test outcome: killed
linkedList3.py, start pos: (77, 35), end pos: (77, 37)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size < 0 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py .....F........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F...   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()

8 : Job ID 4d587c33c14f49deb374660e564fa7da
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 3
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ < "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.12s ==============================

9 : Job ID fd4e2167c5384ad49c75b9d00e59eec3
SURVIVED
test outcome: survived
linkedList3.py, start pos: (26, 23), end pos: (26, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if self.__size <= 0:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.11s ==============================

10 : Job ID 063edad335b24a9b91b1a95c96f16eb7
SURVIVED
test outcome: survived
linkedList3.py, start pos: (40, 23), end pos: (40, 25)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if self.__size <= 0:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.12s ==============================

11 : Job ID 89e3879daed74b32a38ad620804d55d9
SURVIVED
test outcome: survived
linkedList3.py, start pos: (77, 35), end pos: (77, 37)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size <= 0 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.12s ==============================

12 : Job ID 07d1908edefe4ead8ce6f1567e258e96
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 3
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ <= "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.13s ==============================

13 : Job ID 75d01ea960334f149a001c44dcf98b6c
test outcome: killed
linkedList3.py, start pos: (26, 23), end pos: (26, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if self.__size > 0:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
timeout

14 : Job ID d587836a098949cabf7e77e1eae1b7d2
test outcome: killed
linkedList3.py, start pos: (40, 23), end pos: (40, 25)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if self.__size > 0:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py .FF.......F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ...F..........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py .FF.......F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FFF.FF   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = '+(ff'
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(str_0)
        var_0 = singly_linked_list_0.remove()
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
E       AssertionError: assert 'builtins.NoneType' == 'linkedList3.Node'
E         - linkedList3.Node
E         + builtins.NoneType
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:13: AssertionError
_________________________________ test_case_2 ____

15 : Job ID e593ed7d0865431891bb93f4a88edd74
test outcome: killed
linkedList3.py, start pos: (77, 35), end pos: (77, 37)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size > 0 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py .....FF.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F..F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()

16 : Job ID f3970b7bf6a3471cafb82ee6ea5d565c
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 3
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ > "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.14s ==============================

17 : Job ID 142cc2fd208f401eb676633976847fbd
test outcome: killed
linkedList3.py, start pos: (26, 23), end pos: (26, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if self.__size >= 0:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F..F.   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.ge

18 : Job ID aa0cdeae8e1e4e9286edf98c9dac6c20
test outcome: killed
linkedList3.py, start pos: (40, 23), end pos: (40, 25)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if self.__size >= 0:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py .F.........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ...F..........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py .F.........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FF..F.   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = '+(ff'
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(str_0)
        var_0 = singly_linked_list_0.remove()
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
E       AssertionError: assert 'builtins.NoneType' == 'linkedList3.Node'
E         - linkedList3.Node
E         + builtins.NoneType
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:13: AssertionError
_________________________________ test_case_3 __

19 : Job ID bd6df1c45a3c40a68b6834b241f0bccd
test outcome: killed
linkedList3.py, start pos: (77, 35), end pos: (77, 37)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size >= 0 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.......F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ......F.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.......F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py .......F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()

20 : Job ID 1d69193188f14a71bba116011a3aca32
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 3
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ >= "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.12s ==============================

21 : Job ID c65b2e6756f84635bc389b1f33192f8d
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ is "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
=============================== warnings summary ===============================
linkedList3.py:102
  /home/auri/temp/lucca/python_experiments/linkedList3/linkedList3.py:102: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if __name__ is "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 44 passed, 1 warning in 0.14s =========================

22 : Job ID c2185b52fa024fb5b1744072fb2d8437
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ is not "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
=============================== warnings summary ===============================
linkedList3.py:102
  /home/auri/temp/lucca/python_experiments/linkedList3/linkedList3.py:102: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if __name__ is not "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 44 passed, 1 warning in 0.13s =========================

23 : Job ID d4209bfac07b49238b39baa326cc66ff
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_GtE_Eq, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if self.__size == 1:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        complex_0 = -1570.48195 - 1139.15j
        none_type_0 = singly_linked_list_0.add(complex_0)
        int_0 = singly_linked_list_0.getSize()
        assert int_0 == 1
        none_type_1 = singly_linked_list_0.add(singly_linked_list_0)
        list_0 = singly_linked_list_0.toArray()
        int_1 = singly_linked_list_0.getSize()
        assert int_1 == 2
        node_0 = singly_linked_list_0.getHeadNode()
        node_1 =

24 : Job ID 462d697cfb74420b9f5d1695baaf1171
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_GtE_NotEq, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if self.__size != 1:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        complex_0 = -1570.48195 - 1139.15j
        none_type_0 = singly_linked_list_0.add(complex_0)
        int_0 = singly_linked_list_0.getSize()
        assert int_0 == 1
        none_type_1 = singly_linked_list_0.add(singly_linked_list_0)
        list_0 = singly_linked_list_0.toArray()
        int_1 = singly_linked_list_0.getSize()
        assert int_1 == 2
        node_0 = singly_linked_list_0.getHeadNode()
        node_1

25 : Job ID ea2794fa870a4f68a338fbd25c9f8b83
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_GtE_Lt, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if self.__size < 1:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        complex_0 = -1570.48195 - 1139.15j
        none_type_0 = singly_linked_list_0.add(complex_0)
        int_0 = singly_linked_list_0.getSize()
        assert int_0 == 1
        none_type_1 = singly_linked_list_0.add(singly_linked_list_0)
        list_0 = singly_linked_list_0.toArray()
        int_1 = singly_linked_list_0.getSize()
        assert int_1 == 2
        node_0 = singly_linked_list_0.getHeadNode()
        node_1 = s

26 : Job ID 65324de5fb374cbc899ab6fce69cd188
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_GtE_LtE, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if self.__size <= 1:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        complex_0 = -1570.48195 - 1139.15j
        none_type_0 = singly_linked_list_0.add(complex_0)
        int_0 = singly_linked_list_0.getSize()
        assert int_0 == 1
        none_type_1 = singly_linked_list_0.add(singly_linked_list_0)
        list_0 = singly_linked_list_0.toArray()
        int_1 = singly_linked_list_0.getSize()
        assert int_1 == 2
        node_0 = singly_linked_list_0.getHeadNode()
        node_1 =
