27 : Job ID 88a6fb309e9547b5a1a5837d50c2f04b
test outcome: killed
linkedList3.py, start pos: (42, 23), end pos: (42, 25)
operator: core/ReplaceComparisonOperator_GtE_Gt, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if self.__size > 1:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        complex_0 = -1570.48195 - 1139.15j
        none_type_0 = singly_linked_list_0.add(complex_0)
        int_0 = singly_linked_list_0.getSize()
        assert int_0 == 1
        none_type_1 = singly_linked_list_0.add(singly_linked_list_0)
        list_0 = singly_linked_list_0.toArray()
        int_1 = singly_linked_list_0.getSize()
        assert int_1 == 2
        node_0 = singly_linked_list_0.getHeadNode()
        node_1 = s

28 : Job ID 1e29d3d5ede742d9ac860174b8d4d152
test outcome: killed
linkedList3.py, start pos: (26, 11), end pos: (26, 27)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if not self.__size == 0:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
timeout

29 : Job ID 8782fca42b0a4e7dac57e7bdad420183
test outcome: killed
linkedList3.py, start pos: (40, 11), end pos: (40, 27)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if not self.__size == 0:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py .FF........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ...F..........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py .FF........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FFF.FF   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = '+(ff'
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(str_0)
        var_0 = singly_linked_list_0.remove()
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
E       AssertionError: assert 'builtins.NoneType' == 'linkedList3.Node'
E         - linkedList3.Node
E         + builtins.NoneType
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:13: AssertionError
_________________________________ test_case_2 ________________________

30 : Job ID 4663ba8227e449468e9fac7bf86a21f0
test outcome: killed
linkedList3.py, start pos: (42, 11), end pos: (42, 27)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if not self.__size >= 1:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        complex_0 = -1570.48195 - 1139.15j
        none_type_0 = singly_linked_list_0.add(complex_0)
        int_0 = singly_linked_list_0.getSize()
        assert int_0 == 1
        none_type_1 = singly_linked_list_0.add(singly_linked_list_0)
        list_0 = singly_linked_list_0.toArray()
        int_1 = singly_linked_list_0.getSize()
        assert int_1 == 2
        node_0 = singly_linked_list_0.getHeadNode()
        node_1 = singly_linked_list_0.g

31 : Job ID 49b7353bd708494cab06fd20ad2ba36d
test outcome: killed
linkedList3.py, start pos: (77, 23), end pos: (77, 39)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if not self.__size == 0 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py .....FF.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F..F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = singly_

32 : Job ID 4e7a69efcd4c48ac8ea484601cd4bb2b
SURVIVED
test outcome: survived
linkedList3.py, start pos: (85, 14), end pos: (85, 21)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -82,7 +82,7 @@
         arr = []
         current = self.__head
-        while current:
+        while not current:
             arr.append(current.value)
             current = current.next
         return arr
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.12s ==============================

34 : Job ID f96deac2b1824da182e7289171cfa764
SURVIVED
test outcome: survived
linkedList3.py, start pos: (102, 3), end pos: (102, 25)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if not __name__ == "__main__":
     pass
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.12s ==============================

35 : Job ID e40db9b33bdd46109918f66364f53992
test outcome: killed
linkedList3.py, start pos: (77, 15), end pos: (77, 19)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return False if self.__size == 0 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py .....F........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F...   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_

36 : Job ID 9c71cad27d7f48c1980d919c274ec6f2
test outcome: killed
linkedList3.py, start pos: (77, 45), end pos: (77, 50)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size == 0 else True
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.......F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ......F.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.......F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py .......F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1

37 : Job ID d316e0ba4aaa4fa6a28894582ba7be05
test outcome: killed
linkedList3.py, start pos: (19, 22), end pos: (19, 23)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -16,7 +16,7 @@
     def __init__(self):
         self.__sentinel = Node(None)
         self.__head = self.__sentinel
-        self.__size = 0
+        self.__size = 1
     def add(self, value: T) -> None:
timeout

38 : Job ID e99991a7cf3b4091a9cd8cf799ae1589
test outcome: killed
linkedList3.py, start pos: (19, 22), end pos: (19, 23)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -16,7 +16,7 @@
     def __init__(self):
         self.__sentinel = Node(None)
         self.__head = self.__sentinel
-        self.__size = 0
+        self.__size = -1
     def add(self, value: T) -> None:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py .FF.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ...F.FF.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py .FF.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FFF.FF   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = '+(ff'
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(str_0)
        var_0 = singly_linked_list_0.remove()
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
E       AssertionError: assert 'builtins.NoneType' == 'linkedList3.Node'
E         - linkedList3.Node
E         + builtins.NoneType
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:13: AssertionError
_________________________________ test_case_2 ____________________________

39 : Job ID f14e0991fb3f4ed1b89bdbceb30f1b15
test outcome: killed
linkedList3.py, start pos: (26, 26), end pos: (26, 27)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if self.__size == 1:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
timeout

40 : Job ID 02a9174ff7d74c05b9fa0b19a4a5176c
test outcome: killed
linkedList3.py, start pos: (26, 26), end pos: (26, 27)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -23,7 +23,7 @@
         """Add element to linked list."""
         newNode = Node(value)
-        if self.__size == 0:
+        if self.__size == -1:
             self.__head.next = newNode
             self.__head = newNode
             self.__size += 1
timeout

41 : Job ID b5252926002b4e16a0de4a8009f835ad
test outcome: killed
linkedList3.py, start pos: (29, 27), end pos: (29, 28)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -26,7 +26,7 @@
         if self.__size == 0:
             self.__head.next = newNode
             self.__head = newNode
-            self.__size += 1
+            self.__size += 2
         else:
             self.__sentinel.next = newNode
             newNode.next = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.......F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.......F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F..FF   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
>       assert int_0 == 1
E       assert 2 == 1
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:25: AssertionError
_____

42 : Job ID e453ac5b128444759abad9158f8459c3
test outcome: killed
linkedList3.py, start pos: (29, 27), end pos: (29, 28)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -26,7 +26,7 @@
         if self.__size == 0:
             self.__head.next = newNode
             self.__head = newNode
-            self.__size += 1
+            self.__size += 0
         else:
             self.__sentinel.next = newNode
             newNode.next = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py .FF.......F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ...F..F.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py .FF.......F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FF..FF   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = '+(ff'
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(str_0)
        var_0 = singly_linked_list_0.remove()
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
E       AssertionError: assert 'builtins.NoneType' == 'linkedList3.Node'
E         - linkedList3.Node
E         + builtins.NoneType
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:13: AssertionError
_

45 : Job ID d3c5ac91727d47f2b6bb24d0c5494dfd
test outcome: killed
linkedList3.py, start pos: (40, 26), end pos: (40, 27)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if self.__size == 1:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py .FF.......F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ...F..........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py .FF.......F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FFF..F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = '+(ff'
        singly_linked_list_0 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_0.add(str_0)
        var_0 = singly_linked_list_0.remove()
>       assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
E       AssertionError: assert 'builtins.NoneType' == 'linkedList3.Node'
E         - linkedList3.Node
E         + builtins.NoneType
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:13: AssertionError
_________________________________ test_case_2 ____________________

46 : Job ID 0ec811b166bb43e98dc06c7fc4150988
test outcome: killed
linkedList3.py, start pos: (40, 26), end pos: (40, 27)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -37,7 +37,7 @@
         """Remove node from linkedlist."""
-        if self.__size == 0:
+        if self.__size == -1:
             return None
         if self.__size >= 1:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F..F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
>       assert node_0.value is None
E       assert <linkedList3.Node object at 0x7fe3a0fc9ea0> is None
E        +  where <linkedList3.Node object at 0x7fe3a0fc9ea0> = <linkedList3.Node object at 0x7fe3a0fc9180>.value
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py:21: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():

47 : Job ID 3a52d8610df443368c398d61dddd891d
test outcome: killed
linkedList3.py, start pos: (42, 26), end pos: (42, 27)
operator: core/NumberReplacer, occurrence: 10
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if self.__size >= 2:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ...F....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        complex_0 = -1570.48195 - 1139.15j
        none_type_0 = singly_linked_list_0.add(complex_0)
        int_0 = singly_linked_list_0.getSize()
        assert int_0 == 1
        none_type_1 = singly_linked_list_0.add(singly_linked_list_0)
        list_0 = singly_linked_list_0.toArray()
        int_1 = singly_linked_list_0.getSize()
        assert int_1 == 2
        node_0 = singly_linked_list_0.getHeadNode()
        node_1 = singly_linked_lis

48 : Job ID ef4cdadcde1b41839c45b53640aa5491
SURVIVED
test outcome: survived
linkedList3.py, start pos: (42, 26), end pos: (42, 27)
operator: core/NumberReplacer, occurrence: 11
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -39,7 +39,7 @@
         if self.__size == 0:
             return None
-        if self.__size >= 1:
+        if self.__size >= 0:
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.13s ==============================

49 : Job ID 514fa7fac106450bb47e4bc383b02465
test outcome: killed
linkedList3.py, start pos: (46, 27), end pos: (46, 28)
operator: core/NumberReplacer, occurrence: 12
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -43,7 +43,7 @@
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
-            self.__size -= 1
+            self.__size -= 2
             return nodeToRemove
         else:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ..FF....   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        node_0 = singly_linked_list_0.getHeadNode()
        node_1 = singly_linked_list_0.getHeadNode()
        none_type_0 = singly_linked_list_0.add(node_1)
        var_0 = singly_linked_list_0.remove()
        assert node_0.next is None
        assert node_1.next is None
        assert f'{type(var_0).__module__}.{type(var_0).__qualname__}' == 'linkedList3.Node'
        assert f'{type(var_0.value).__module__}.{t

50 : Job ID 7e801fe851fc40faab0a0e9c6459bbbd
SURVIVED
test outcome: survived
linkedList3.py, start pos: (46, 27), end pos: (46, 28)
operator: core/NumberReplacer, occurrence: 13
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -43,7 +43,7 @@
             nodeToRemove = self.__head
             self.__sentinel.next = None
             self.__head = self.__sentinel
-            self.__size -= 1
+            self.__size -= 0
             return nodeToRemove
         else:
             nodeToRemove = self.__head
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.13s ==============================

51 : Job ID 1d6596376bf1410a8edc4f78da1535c6
SURVIVED
test outcome: survived
linkedList3.py, start pos: (52, 27), end pos: (52, 28)
operator: core/NumberReplacer, occurrence: 14
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -49,7 +49,7 @@
             nodeToRemove = self.__head
             self.__sentinel.next = self.__head.next
             self.__head = self.__sentinel.next
-            self.__size -= 1
+            self.__size -= 2
             return nodeToRemove
     def getHead(self) -> T:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.14s ==============================

52 : Job ID 306caae7b93946069ce9ab32bc1491be
SURVIVED
test outcome: survived
linkedList3.py, start pos: (52, 27), end pos: (52, 28)
operator: core/NumberReplacer, occurrence: 15
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -49,7 +49,7 @@
             nodeToRemove = self.__head
             self.__sentinel.next = self.__head.next
             self.__head = self.__sentinel.next
-            self.__size -= 1
+            self.__size -= 0
             return nodeToRemove
     def getHead(self) -> T:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ...........   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py ..............     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ...........       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ........   [100%]
============================== 44 passed in 0.14s ==============================

53 : Job ID 5fa7ab1c036c46eea2e7ced07beb00c9
test outcome: killed
linkedList3.py, start pos: (77, 38), end pos: (77, 39)
operator: core/NumberReplacer, occurrence: 16
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size == 1 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py .....FF.......     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F..F   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = si

54 : Job ID 77cafe62e4964779af3f572f40c64c78
test outcome: killed
linkedList3.py, start pos: (77, 38), end pos: (77, 39)
operator: core/NumberReplacer, occurrence: 17
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -74,7 +74,7 @@
         """Checks if linkedlist is empty."""
-        return True if self.__size == 0 else False
+        return True if self.__size == -1 else False
     def toArray(self) -> list:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_DYNAMOSA.py ..F.F.....F   [ 25%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MIO.py .....F........     [ 56%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_MOSA.py ..F.F.....F       [ 81%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_linkedList3_WHOLE_SUITE.py ....F...   [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        singly_linked_list_0 = module_0.SinglyLinkedList()
        var_0 = singly_linked_list_0.remove()
        node_0 = module_0.Node(var_0)
        assert node_0.value is None
        singly_linked_list_1 = module_0.SinglyLinkedList()
        none_type_0 = singly_linked_list_1.add(singly_linked_list_1)
        int_0 = singly_linked_list_1.getSize()
        assert int_0 == 1
        int_1 = singly_linked_list_1.getSize()
        assert int_1 == 1
        var_1 = singly_linked_list_1.getHead()
        var_2 = singly_linked_list_1.getHead()
        node_1 = s
