21 : Job ID d99a389a801b44bf84ee2742db7071b9
test outcome: killed
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ is "__main__":
     pass
timeout

22 : Job ID af2f5b8619894b048789c55485c34545
test outcome: killed
linkedList3.py, start pos: (102, 12), end pos: (102, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- alinkedList3.py
+++ blinkedList3.py
@@ -99,6 +99,6 @@
         return str(arr)
-if __name__ == "__main__":
+if __name__ is not "__main__":
     pass
timeout
