1 : Job ID aa55f5eb9f8f43089f3853f3990e7045
test outcome: killed
queue1.py, start pos: (23, 16), end pos: (23, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -20,7 +20,7 @@
 	def enqueue(self, item):
-		if self.front is None:
+		if self.front is not None:
 			new_node = QueueNode(item)
 			self.front = new_node
 			self.back = new_node
MOSA/test_queue1_MOSA.py F..F..FF                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
>       var_1 = queue_0.enqueue(queue_0)
MOSA/test_queue1_MOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue1.Queue object at 0x7f9efcc0bd90>
item = <queue1.Queue object at 0x7f9efcc0bd90>
    def enqueue(self, item):
    	if self.front is not None:
    		new_node = QueueNode(item)
    		self.front = new_node
    		self.back = new_node
    	else:
    		new_back = QueueNode(item)
>   		self.back.next = new_back
E     AttributeError: 'NoneType' object has no attribute 'next'
queue1.py:29: AttributeError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'

2 : Job ID 563696193bb74e8da0e01c971dc07da9
test outcome: killed
queue1.py, start pos: (35, 16), end pos: (35, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -32,7 +32,7 @@
 		self.size += 1
 	def dequeue(self):
-		if self.front is None:
+		if self.front is not None:
 			raise ValueError()
 		else:
 			front_node = self.front
MOSA/test_queue1_MOSA.py .F.F..F.                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        with pytest.raises(ValueError):
>           queue_0.dequeue()
MOSA/test_queue1_MOSA.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue1.Queue object at 0x7efe92b2aec0>
    def dequeue(self):
    	if self.front is not None:
    		raise ValueError()
    	else:
    		front_node = self.front
>   		self.front = self.front.next
E     AttributeError: 'NoneType' object has no attribute 'next'
queue1.py:39: AttributeError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queu

3 : Job ID 05dbdc24a50e4f7f9a7f85b9e6d1374a
test outcome: killed
queue1.py, start pos: (44, 16), end pos: (44, 18)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -41,7 +41,7 @@
 			return front_node.data
 	def peek(self):
-		if self.front is None:
+		if self.front is not None:
 			return None
 		return self.front.data
MOSA/test_queue1_MOSA.py ..F.....                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
>       var_0 = queue_0.peek()
MOSA/test_queue1_MOSA.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue1.Queue object at 0x7fc4f8d86c20>
    def peek(self):
    	if self.front is not None:
    		return None
>   	return self.front.data
E    AttributeError: 'NoneType' object has no attribute 'data'
queue1.py:46: AttributeError
=========================== short test summary info ============================
FAILED MOSA/test_queue1_MOSA.py::test_case_2 - AttributeError: 'NoneType' obj...
========================= 1 failed, 7 passed in 0.12s ==========================

4 : Job ID 5cf53cf51618476ab2a1b4f5a59de947
test outcome: killed
queue1.py, start pos: (23, 5), end pos: (23, 23)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -20,7 +20,7 @@
 	def enqueue(self, item):
-		if self.front is None:
+		if not self.front is None:
 			new_node = QueueNode(item)
 			self.front = new_node
 			self.back = new_node
MOSA/test_queue1_MOSA.py F..F..FF                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
>       var_1 = queue_0.enqueue(queue_0)
MOSA/test_queue1_MOSA.py:10: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue1.Queue object at 0x7f5ffb14aec0>
item = <queue1.Queue object at 0x7f5ffb14aec0>
    def enqueue(self, item):
    	if not self.front is None:
    		new_node = QueueNode(item)
    		self.front = new_node
    		self.back = new_node
    	else:
    		new_back = QueueNode(item)
>   		self.back.next = new_back
E     AttributeError: 'NoneType' object has no attribute 'next'
queue1.py:29: AttributeError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module

5 : Job ID b834b4937a124ebbb05b875eaf7c3d0a
test outcome: killed
queue1.py, start pos: (35, 5), end pos: (35, 23)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -32,7 +32,7 @@
 		self.size += 1
 	def dequeue(self):
-		if self.front is None:
+		if not self.front is None:
 			raise ValueError()
 		else:
 			front_node = self.front
MOSA/test_queue1_MOSA.py .F.F..F.                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        with pytest.raises(ValueError):
>           queue_0.dequeue()
MOSA/test_queue1_MOSA.py:17: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue1.Queue object at 0x7f8272b12fe0>
    def dequeue(self):
    	if not self.front is None:
    		raise ValueError()
    	else:
    		front_node = self.front
>   		self.front = self.front.next
E     AttributeError: 'NoneType' object has no attribute 'next'
queue1.py:39: AttributeError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        a

6 : Job ID 96bb324159964e5da67fecd43d511c06
test outcome: killed
queue1.py, start pos: (44, 5), end pos: (44, 23)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -41,7 +41,7 @@
 			return front_node.data
 	def peek(self):
-		if self.front is None:
+		if not self.front is None:
 			return None
 		return self.front.data
MOSA/test_queue1_MOSA.py ..F.....                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
>       var_0 = queue_0.peek()
MOSA/test_queue1_MOSA.py:22: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue1.Queue object at 0x7f0db31e2ec0>
    def peek(self):
    	if not self.front is None:
    		return None
>   	return self.front.data
E    AttributeError: 'NoneType' object has no attribute 'data'
queue1.py:46: AttributeError
=========================== short test summary info ============================
FAILED MOSA/test_queue1_MOSA.py::test_case_2 - AttributeError: 'NoneType' obj...
========================= 1 failed, 7 passed in 0.22s ==========================

7 : Job ID 7091246031ac4b39b4d58cc2c216a5bf
test outcome: killed
queue1.py, start pos: (12, 14), end pos: (12, 15)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -9,7 +9,7 @@
 	def __init__(self):
 		self.front = None
 		self.back = None
-		self.size = 0
+		self.size = 1
 	def __str__(self):
 		# TODO implement this later
MOSA/test_queue1_MOSA.py FFFFFFFF                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
>       assert len(queue_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<queue1.Queue object at 0x7fb2ded937c0>)
MOSA/test_queue1_MOSA.py:7: AssertionError
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
>       assert len(queue_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<queue1.Queue object at 0x7fb2deda47f0>)
MOSA/test_queue1_MOSA.py:15: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        queue_0 = module_0.Queue()
>       assert len(queue_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<queue1.Queue object at 0x7fb2def0efe0>)
MOSA/test_queue1_MOSA.py:21: AssertionError
_________________________________ test_case_3 __

8 : Job ID 0f6e600271b545f0b1b8c7f70b40fa46
test outcome: killed
queue1.py, start pos: (12, 14), end pos: (12, 15)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -9,7 +9,7 @@
 	def __init__(self):
 		self.front = None
 		self.back = None
-		self.size = 0
+		self.size = -1
 	def __str__(self):
 		# TODO implement this later
MOSA/test_queue1_MOSA.py FFFFFFFF                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
>       assert len(queue_0) == 0
E       ValueError: __len__() should return >= 0
MOSA/test_queue1_MOSA.py:7: ValueError
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
>       assert len(queue_0) == 0
E       ValueError: __len__() should return >= 0
MOSA/test_queue1_MOSA.py:15: ValueError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        queue_0 = module_0.Queue()
>       assert len(queue_0) == 0
E       ValueError: __len__() should return >= 0
MOSA/test_queue1_MOSA.py:21: ValueError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)

9 : Job ID 6660eb78c7d345b7b5f5926fe944a0c4
test outcome: killed
queue1.py, start pos: (32, 15), end pos: (32, 16)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -29,7 +29,7 @@
 			self.back.next = new_back
 			self.back = new_back
-		self.size += 1
+		self.size += 2
 	def dequeue(self):
 		if self.front is None:
MOSA/test_queue1_MOSA.py F..F..FF                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
        var_1 = queue_0.enqueue(queue_0)
>       assert len(queue_0) == 1
E       assert 2 == 1
E        +  where 2 = len(<queue1.Queue object at 0x7f31b7087e80>)
MOSA/test_queue1_MOSA.py:11: AssertionError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
>       assert len(queue_0) == 1
E       assert 2 == 1
E        +  where 2 = len(<queue1.Queue object at 0x7f31b7098a90>)
MOSA/test_queue1_MOSA.py:33: AssertionError
_________________________________ test_case_6 _______________

10 : Job ID bda7e7578fe347a0b61e3dada323ac1b
test outcome: killed
queue1.py, start pos: (32, 15), end pos: (32, 16)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -29,7 +29,7 @@
 			self.back.next = new_back
 			self.back = new_back
-		self.size += 1
+		self.size += 0
 	def dequeue(self):
 		if self.front is None:
MOSA/test_queue1_MOSA.py F..F..FF                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.__len__()
        assert var_0 == 0
        var_1 = queue_0.enqueue(queue_0)
>       assert len(queue_0) == 1
E       assert 0 == 1
E        +  where 0 = len(<queue1.Queue object at 0x7fc878216f80>)
MOSA/test_queue1_MOSA.py:11: AssertionError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
>       assert len(queue_0) == 1
E       assert 0 == 1
E        +  where 0 = len(<queue1.Queue object at 0x7fc878224a90>)
MOSA/test_queue1_MOSA.py:33: AssertionError
_________________________________ test_case_6 ______________

11 : Job ID 6aa879e3c32343a98471c4e0be597099
test outcome: killed
queue1.py, start pos: (40, 16), end pos: (40, 17)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -37,7 +37,7 @@
 		else:
 			front_node = self.front
 			self.front = self.front.next
-			self.size -= 1
+			self.size -= 2
 			return front_node.data
 	def peek(self):
MOSA/test_queue1_MOSA.py ...F..F.                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
        var_2 = queue_0.dequeue()
>       assert len(queue_0) == 0
E       ValueError: __len__() should return >= 0
MOSA/test_queue1_MOSA.py:36: ValueError
_________________________________ test_case_6 __________________________________
    def test_case_6():
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.dequeue()
>       assert len(queue_0) == 0
E       ValueError: __len__() should return >= 0
MOSA/test_queue1_MOSA.py:57: ValueError
=========

12 : Job ID 1ab0e913e39d4ce2ba02edae6cc3677f
test outcome: killed
queue1.py, start pos: (40, 16), end pos: (40, 17)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -37,7 +37,7 @@
 		else:
 			front_node = self.front
 			self.front = self.front.next
-			self.size -= 1
+			self.size -= 0
 			return front_node.data
 	def peek(self):
MOSA/test_queue1_MOSA.py ...F..F.                                        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = 'I*So4'
        queue_node_0 = module_0.QueueNode(str_0)
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.peek()
        var_2 = queue_0.dequeue()
>       assert len(queue_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<queue1.Queue object at 0x7faeeb6facb0>)
MOSA/test_queue1_MOSA.py:36: AssertionError
_________________________________ test_case_6 __________________________________
    def test_case_6():
        dict_0 = {}
        queue_0 = module_0.Queue()
        assert len(queue_0) == 0
        var_0 = queue_0.enqueue(dict_0)
        assert len(queue_0) == 1
        var_1 = queue_0.dequeue()
>       assert len(queue_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<queue

13 : Job ID 176f33b914dd4c4e95b83406acba81ec
SURVIVED
test outcome: survived
queue1.py, start pos: (49, 14), end pos: (49, 15)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -46,7 +46,7 @@
 		return self.front.data
 	def clear(self):
-		self.size = 0 
+		self.size = 1 
 		self.front = None
 		self.back = None
MOSA/test_queue1_MOSA.py ........                                        [100%]
============================== 8 passed in 0.11s ===============================

14 : Job ID 2e339eae4f1c45138917e5571d5d2529
SURVIVED
test outcome: survived
queue1.py, start pos: (49, 14), end pos: (49, 15)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- aqueue1.py
+++ bqueue1.py
@@ -46,7 +46,7 @@
 		return self.front.data
 	def clear(self):
-		self.size = 0 
+		self.size = -1 
 		self.front = None
 		self.back = None
MOSA/test_queue1_MOSA.py ........                                        [100%]
============================== 8 passed in 0.05s ===============================
