46 : Job ID a52a7a086b6e4b4982c5b0ee3628cf71
test outcome: killed
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ is "__main__":
     pass
timeout

47 : Job ID d764b411ded547aba3dd0ee5862ede7e
test outcome: killed
queue3.py, start pos: (193, 12), end pos: (193, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- aqueue3.py
+++ bqueue3.py
@@ -190,6 +190,6 @@
         return self.__queue.__str__()
-if __name__ == "__main__":
+if __name__ is not "__main__":
     pass
timeout
