1 : Job ID 4ab03199528748b9a45a6309eb79b47b
test outcome: killed
queue5.py, start pos: (30, 21), end pos: (30, 23)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if self.head != self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .F.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ...FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py ...FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ....FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.enqueue(queue_2)
        var_2 = queue_2.dequeue()

2 : Job ID a3a9eba3aaef46f1ac4af5fd173fbf14
test outcome: killed
queue5.py, start pos: (30, 21), end pos: (30, 23)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if self.head < self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .F.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ...FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py ...FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ....FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.enqueue(queue_2)
>       var_2 = queue_2.dequeue()
DYNAMOS

3 : Job ID 039d0837f2374b82b6e1e8233e7535fc
test outcome: killed
queue5.py, start pos: (30, 21), end pos: (30, 23)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if self.head <= self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .F.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ...FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py ...FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ....FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.enqueue(queue_2)
>       var_2 = queue_2.dequeue()
DYNAM

4 : Job ID 800f1a6d2e434f6198ceaa9c1456ba85
test outcome: killed
queue5.py, start pos: (30, 21), end pos: (30, 23)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if self.head > self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .F.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ...FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py ...FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ....FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.enqueue(queue_2)
>       var_2 = queue_2.dequeue()
DYNAMOS

5 : Job ID 9fabf44283184340a0737e8ba96a520b
test outcome: killed
queue5.py, start pos: (30, 21), end pos: (30, 23)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if self.head >= self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .F.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ...FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py ...FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ....FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.enqueue(queue_2)
>       var_2 = queue_2.dequeue()
DYNAM

6 : Job ID 97b06b0e904d4ce78de092f42f4341e6
SURVIVED
test outcome: survived
queue5.py, start pos: (30, 21), end pos: (30, 23)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if self.head is self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .....              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ......                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py .....                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ........        [100%]
============================== 24 passed in 0.08s ==============================

7 : Job ID c9f0b104b2634a32bdac96e4117e4f10
test outcome: killed
queue5.py, start pos: (30, 21), end pos: (30, 23)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if self.head is not self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .F.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ...FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py ...FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ....FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.enqueue(queue_2)
        var_2 = queue_2.dequeue()

8 : Job ID a64405b1330647c998c2cc93969db26d
test outcome: killed
queue5.py, start pos: (17, 21), end pos: (17, 23)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -14,7 +14,7 @@
     def enqueue(self, data):
         node = Node(data)
         # Empty list
-        if self.head is None and self.tail is None:
+        if self.head is not None and self.tail is None:
             self.head = node
             self.tail = node
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py FF.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py FF.FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py FF.FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py F.F.FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue5.Queue object at 0x7f45a2dffb50>
data = <queue5.Queue object at 0x7f45a2dffb50>
    def enqueue(self, data):
        node = Node(data)
        # Empty list
        if self.head is not None and self.tail is None:
            self.head = node

9 : Job ID 41cb30c0c68a49c4b0564b5f23416cee
test outcome: killed
queue5.py, start pos: (17, 43), end pos: (17, 45)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -14,7 +14,7 @@
     def enqueue(self, data):
         node = Node(data)
         # Empty list
-        if self.head is None and self.tail is None:
+        if self.head is None and self.tail is not None:
             self.head = node
             self.tail = node
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py FF.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py FF.FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py FF.FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py F.F.FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue5.Queue object at 0x7f2770f4f400>
data = <queue5.Queue object at 0x7f2770f4f400>
    def enqueue(self, data):
        node = Node(data)
        # Empty list
        if self.head is None and self.tail is not None:
            self.head = node

12 : Job ID d7a3a5955c7547678e5c0a6b6260fe55
test outcome: killed
queue5.py, start pos: (17, 11), end pos: (17, 50)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -14,7 +14,7 @@
     def enqueue(self, data):
         node = Node(data)
         # Empty list
-        if self.head is None and self.tail is None:
+        if not self.head is None and self.tail is None:
             self.head = node
             self.tail = node
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py FF.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py FF.FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py FF.FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py F.F.FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        queue_0 = module_0.Queue()
>       var_0 = queue_0.enqueue(queue_0)
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <queue5.Queue object at 0x7f36087ebbe0>
data = <queue5.Queue object at 0x7f36087ebbe0>
    def enqueue(self, data):
        node = Node(data)
        # Empty list
        if not self.head is None and self.tail is None:
            self.head = node
            self.tail = node
        e

14 : Job ID 8091b6b9ae16492ca0b4135b6584ae8a
test outcome: killed
queue5.py, start pos: (30, 11), end pos: (30, 33)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -27,7 +27,7 @@
             return None
         data = self.head.data
         # Remove only element from a one element list
-        if self.head == self.tail:
+        if not self.head == self.tail:
             self.head = None
             self.tail = None
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .F.FF              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ...FF.                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py ...FF                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ....FFF.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        queue_0 = module_0.Queue()
        bool_0 = True
        var_0 = queue_0.enqueue(queue_0)
        assert f'{type(queue_0.head).__module__}.{type(queue_0.head).__qualname__}' == 'queue5.Node'
        assert f'{type(queue_0.tail).__module__}.{type(queue_0.tail).__qualname__}' == 'queue5.Node'
        queue_1 = module_0.Queue()
        queue_2 = module_0.Queue()
        node_0 = module_0.Node(bool_0)
        var_1 = queue_2.enqueue(queue_2)
        var_2 = queue_2.dequeue()
        assert queue_2.hea

15 : Job ID 012e15ddfe334467986332b3597368e2
SURVIVED
test outcome: survived
queue5.py, start pos: (17, 29), end pos: (17, 32)
operator: core/ReplaceAndWithOr, occurrence: 0
--- mutation diff ---
--- aqueue5.py
+++ bqueue5.py
@@ -14,7 +14,7 @@
     def enqueue(self, data):
         node = Node(data)
         # Empty list
-        if self.head is None and self.tail is None:
+        if self.head is None or self.tail is None:
             self.head = node
             self.tail = node
         else:
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_DYNAMOSA.py .....              [ 20%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MIO.py ......                  [ 45%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_MOSA.py .....                  [ 66%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_queue5_WHOLE_SUITE.py ........        [100%]
============================== 24 passed in 0.08s ==============================
