   - [#  46] DDL sort1: 
--------------------------------------------------------------------------------
  85:             Sort.quick_sort(arr, first, pos - 1)
  86:             Sort.quick_sort(arr, pos + 1, last)
  87:     
  88:     
- 89:     @staticmethod
- 90:     def partition(arr, first, last):pivot = first
+ 89:     def partition(arr, first, last):
+ 90:         pivot = first
  91:         for pos in range(first, last):
  92:             if arr[pos] < arr[last]:
  93:                 (arr[pos], arr[pivot]) = (arr[pivot], arr[pos])
  94:                 pivot += 1
--------------------------------------------------------------------------------
[0.07093 s] survived
