1 : Job ID ac609b0834a94f14aec1bc3ec7b6277c
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a - b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

2 : Job ID 9a666ceba9eb4207a1b2ce714403cb9e
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a * b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

3 : Job ID 440e147b07714365aa5366cec9f0babb
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a / b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.14s ==============================

4 : Job ID cd66c740efd94f6ba91227cadeb6ed33
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a // b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

5 : Job ID 295d4ab4550d4908abb319ef0e904c0d
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a % b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

6 : Job ID dcd913723e2148d290902431d668d52b
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a ** b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

7 : Job ID 21519a01e9f74a7d98ee0e27c0711f67
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a >> b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

8 : Job ID b59172ddd89943f5af0e3bd80063a15d
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a << b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

9 : Job ID 630e4a86da6749a9bbe35a06eb0738c3
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a | b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

10 : Job ID ee36a2d3686348188b099daa9d98458f
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a & b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

11 : Job ID f729fe9b81284ef69b71cabdf2677090
SURVIVED
test outcome: survived
stack1.py, start pos: (94, 31), end pos: (94, 32)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -91,7 +91,7 @@
         module.
     '''
     stack = Stack()
-    ops = {'+': lambda a, b: a + b,
+    ops = {'+': lambda a, b: a ^ b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

12 : Job ID e38948b3e62143f1981ebd3e2169087b
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_Add, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a + b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

13 : Job ID 9512b85f407249faaa116f201f5da373
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_Mul, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a * b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

14 : Job ID 09aec1ba5d4a4bbb8a9fa59c4649ae0c
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_Div, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a / b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

15 : Job ID a13194892efe4ffb8b265d83f223f9ae
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_FloorDiv, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a // b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

16 : Job ID 0b6ff7b7a5f94d9aa692e00aff1b65c1
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_Mod, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a % b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

17 : Job ID 4b3e49e0de844b19a907fd812e39e58c
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_Pow, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a ** b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

18 : Job ID e09b69fa02c54f1caffcb015e2504c1c
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_RShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a >> b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.18s ==============================

19 : Job ID 67d410f2169d40299761a18df84660ef
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_LShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a << b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

20 : Job ID 49256cfd76db444c85646f884491f01d
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_BitOr, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a | b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

21 : Job ID 5be5424b60b141cebd064aa83985660c
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_BitAnd, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a & b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

22 : Job ID 0d739b67ec4b45b594d06afb1b171c00
SURVIVED
test outcome: survived
stack1.py, start pos: (95, 31), end pos: (95, 32)
operator: core/ReplaceBinaryOperator_Sub_BitXor, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -92,7 +92,7 @@
     '''
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
-           '-': lambda a, b: a - b,
+           '-': lambda a, b: a ^ b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

23 : Job ID 5843d13095d340dab03016926bcfdbed
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_Add, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a + b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

24 : Job ID 5efc7871f3e449d584cc5d44ac403a7e
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_Sub, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a - b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

25 : Job ID 71c5728d4d754470b6b31489a1656b66
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_Div, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a / b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

26 : Job ID fe00b886abd74bae948bb1b6d4a8dbbd
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_FloorDiv, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a // b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

27 : Job ID 8e58296681484c5790dab553e7cb5ef7
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_Mod, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a % b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

28 : Job ID 8f767b592ed64fdf9e35c5e803144a9e
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_Pow, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a ** b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

29 : Job ID a51b1140f72b49baaca87b6d21906314
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_RShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a >> b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

30 : Job ID 98b9680747e34aae9ae9c0911bf30d78
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_LShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a << b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

31 : Job ID 3d606483cae54fd9be5218442780f1ff
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_BitOr, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a | b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

32 : Job ID 7dc961eade5d4a518573e0af7dbe4b5e
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_BitAnd, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a & b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

33 : Job ID 0532caa212b3408cb5da952ac50a5bc2
SURVIVED
test outcome: survived
stack1.py, start pos: (96, 31), end pos: (96, 32)
operator: core/ReplaceBinaryOperator_Mul_BitXor, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -93,7 +93,7 @@
     stack = Stack()
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
-           '*': lambda a, b: a * b, 
+           '*': lambda a, b: a ^ b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

34 : Job ID 64ad2487c618494896ce33740ed4dfd1
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_Add, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a + b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

35 : Job ID 0f04805f41044185a1b9370f2ea3f303
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_Sub, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a - b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================
