36 : Job ID 0cb329bc19ea4efd98032f267d3d348b
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_Mul, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a * b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

37 : Job ID 953cbf9df14245d2ad43da4ab1f952af
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_FloorDiv, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a // b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

38 : Job ID 8ca54c641fdf46bfab961701e1a95548
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_Mod, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a % b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

39 : Job ID 39e0371b09ef45e193b514926d664444
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_Pow, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a ** b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

40 : Job ID efdc9725cd854c1d94e394dd643081c6
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_RShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a >> b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

41 : Job ID 1f25e802c39c45cda27bf809c14e8728
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_LShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a << b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

42 : Job ID c9dff0d349d0456989a980f48bb2193a
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_BitOr, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a | b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

43 : Job ID b16d35ce679f49b9939317134b27a9d1
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_BitAnd, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a & b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

44 : Job ID 26a5e7245607430791afc2b328e947b6
SURVIVED
test outcome: survived
stack1.py, start pos: (97, 31), end pos: (97, 32)
operator: core/ReplaceBinaryOperator_Div_BitXor, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -94,7 +94,7 @@
     ops = {'+': lambda a, b: a + b,
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
-           '/': lambda a, b: a / b,
+           '/': lambda a, b: a ^ b,
            '%': lambda a, b: a % b,
            '^': lambda a, b: a ** b,}
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

45 : Job ID d8b1e3592846454ea3643e2745b966e6
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_Add, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a + b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

46 : Job ID c3aae6985ab04a47b8b8904f6ebc3b57
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_Sub, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a - b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

47 : Job ID f41c5600c5c3440f9b4c367f4615f182
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_Mul, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a * b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

48 : Job ID 7556d360468e428d942124353285c97d
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_Div, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a / b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

49 : Job ID e237abb2df4a402390fe093d7d01c113
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_FloorDiv, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a // b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

50 : Job ID f6bccd26829244afad81ce0f4d678682
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_Pow, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a ** b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.14s ==============================

51 : Job ID 669071e03f7d40d1bce81b85f15da1f8
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_RShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a >> b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

52 : Job ID fc3533da4d6042278a162aecfb678e94
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_LShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a << b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.14s ==============================

53 : Job ID 4694e63dc9cc43c09e2215a50a66c276
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_BitOr, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a | b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.16s ==============================

54 : Job ID 384e17d2dbab4178b9c34b9ab1dcaf51
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_BitAnd, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a & b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.16s ==============================

55 : Job ID 4b575535b39f4a99a5bc9885eceb7030
SURVIVED
test outcome: survived
stack1.py, start pos: (98, 31), end pos: (98, 32)
operator: core/ReplaceBinaryOperator_Mod_BitXor, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -95,7 +95,7 @@
            '-': lambda a, b: a - b,
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
-           '%': lambda a, b: a % b,
+           '%': lambda a, b: a ^ b,
            '^': lambda a, b: a ** b,}
     # Split the string into a list using spaces
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.16s ==============================

56 : Job ID e4f7f98afd7e4d9ba404e1222e404251
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_Add, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a + b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

57 : Job ID fedd651112834927a2d511222a223db5
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_Sub, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a - b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

58 : Job ID d5f2cd05b1594f539d03a1d5849be208
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_Mul, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a * b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.14s ==============================

59 : Job ID 74a1dd778bb84826b67ba1085c850b33
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_Div, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a / b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.14s ==============================

60 : Job ID ebaab34d913c4c72a9413043b8c80d7e
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_FloorDiv, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a // b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.16s ==============================

61 : Job ID 957671b9bcd045c9a4ae0d81b18917c0
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_Mod, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a % b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

62 : Job ID 9f19c1e4d7c249a19994d9578d87ed6b
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_RShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a >> b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

63 : Job ID a296510643214179afc117d17486f517
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_LShift, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a << b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

64 : Job ID 9330e9313a074ec78fe95298833d6c19
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_BitOr, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a | b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

65 : Job ID f4dc101b83db450eb525f88594ca9ed8
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_BitAnd, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a & b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

66 : Job ID 200ffa1f0afc48dc9103e98e0c036b14
SURVIVED
test outcome: survived
stack1.py, start pos: (99, 31), end pos: (99, 33)
operator: core/ReplaceBinaryOperator_Pow_BitXor, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -96,7 +96,7 @@
            '*': lambda a, b: a * b, 
            '/': lambda a, b: a / b,
            '%': lambda a, b: a % b,
-           '^': lambda a, b: a ** b,}
+           '^': lambda a, b: a ^ b,}
     # Split the string into a list using spaces
     tokens = string.split(' ') 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

67 : Job ID 76aaea37450540e28ecbc4be2a1b3d0c
test outcome: killed
stack1.py, start pos: (66, 35), end pos: (66, 37)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if brackets[other] == character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .F.......F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .........F.FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'p(hy;{K\nEB];*A}L\\'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:14: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_9

68 : Job ID 4b7f7fb0f0f04a8c8df3b6d4159c6be1
test outcome: killed
stack1.py, start pos: (72, 18), end pos: (72, 20)
operator: core/ReplaceComparisonOperator_NotEq_Eq, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if stack.size == 0:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ......F..FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....FF...F...                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F....F.....FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'b#:{&1y=1zRW~A-l9@@y'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:45: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_cas
