69 : Job ID 5db1228dcf3147808243cc0fa4eeba28
test outcome: killed
stack1.py, start pos: (66, 35), end pos: (66, 37)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if brackets[other] < character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .........F.......        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = 'K*{g\\\nq1p\\j~,7`]'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:73: AssertionError
=========================== short test summary info ============================
FAILED MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py::test_case_9 - assert ...
========================= 1 failed, 45 passed in 0.26s =========================

70 : Job ID 30e19df4c019443d88406936bcbe924a
test outcome: killed
stack1.py, start pos: (72, 18), end pos: (72, 20)
operator: core/ReplaceComparisonOperator_NotEq_Lt, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if stack.size < 0:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ......F........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ......F.......                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .....F...........        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'b#:{&1y=1zRW~A-l9@@y'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:45: AssertionError
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = "X(@\\>u'G"
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py:44: AssertionError
_________________________________ test_case_5 ____

71 : Job ID 5d4f2b922d574f3e9a6a04fed8ac1dec
test outcome: killed
stack1.py, start pos: (66, 35), end pos: (66, 37)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if brackets[other] <= character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .........F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .........F.FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = 'K*{g\\\nq1p\\j~,7`]'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:73: AssertionError
_________________________________ te

72 : Job ID 3872a250b5aa40729056c53e6f08c6ad
test outcome: killed
stack1.py, start pos: (72, 18), end pos: (72, 20)
operator: core/ReplaceComparisonOperator_NotEq_LtE, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if stack.size <= 0:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ......F..FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....FF...F...                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F....F.....FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'b#:{&1y=1zRW~A-l9@@y'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:45: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_ca

73 : Job ID 77b5b8fee4db4c4db2b70fda0dc0ad99
SURVIVED
test outcome: survived
stack1.py, start pos: (66, 35), end pos: (66, 37)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if brackets[other] > character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.22s ==============================

74 : Job ID 01cc7d98e4424116bf81715c0b3064b1
SURVIVED
test outcome: survived
stack1.py, start pos: (72, 18), end pos: (72, 20)
operator: core/ReplaceComparisonOperator_NotEq_Gt, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if stack.size > 0:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

75 : Job ID 78983e73618445f2b063100f97214f86
test outcome: killed
stack1.py, start pos: (66, 35), end pos: (66, 37)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if brackets[other] >= character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .........F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ...........FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_11 _________________________________
    def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError
_________________________________ test

76 : Job ID 27c64f45892b4fc08ce5a063b72c2f4e
test outcome: killed
stack1.py, start pos: (72, 18), end pos: (72, 20)
operator: core/ReplaceComparisonOperator_NotEq_GtE, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if stack.size >= 0:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .........FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....F....F...                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F..........FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_10 _________________________________
    def test_case_10():
        str_0 = '\\=m'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:65: AssertionError
_________________________________ test_case_5 ___________

77 : Job ID 1dbe941dc3ef4d70b9426a58bf3b092f
test outcome: killed
stack1.py, start pos: (66, 35), end pos: (66, 37)
operator: core/ReplaceComparisonOperator_NotEq_Is, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if brackets[other] is character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .F.......F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .........F.FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'p(hy;{K\nEB];*A}L\\'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:14: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_9

78 : Job ID 773dfdefbafa4eb1b6fd4f16f70f807f
SURVIVED
test outcome: survived
stack1.py, start pos: (66, 35), end pos: (66, 37)
operator: core/ReplaceComparisonOperator_NotEq_IsNot, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if brackets[other] is not character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

79 : Job ID 10808481f85940c3a09a8a10501a69c4
test outcome: killed
stack1.py, start pos: (130, 18), end pos: (130, 19)
operator: core/ReplaceComparisonOperator_Gt_Eq, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if stack.size == 1:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...F...........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ..............F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
string = '4'
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the characters of
            operations to lambda functions. It's similar to saying:
            def add(a,b):
                return a + b
            and then doing:
            print add(4,5)
            >>> 9
            The add function can also be accessed via the ``operator``
            module.
        '''
        stack = Stack()
        ops = {'+': lambd

80 : Job ID 4598d5b95a624cc0b58dbaf925da319a
SURVIVED
test outcome: survived
stack1.py, start pos: (130, 18), end pos: (130, 19)
operator: core/ReplaceComparisonOperator_Gt_NotEq, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if stack.size != 1:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.14s ==============================

81 : Job ID 689d484852b84cbd88e553704fb57814
SURVIVED
test outcome: survived
stack1.py, start pos: (130, 18), end pos: (130, 19)
operator: core/ReplaceComparisonOperator_Gt_Lt, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if stack.size < 1:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.14s ==============================

82 : Job ID 1cbee3b788764810960edf6d643c8853
test outcome: killed
stack1.py, start pos: (130, 18), end pos: (130, 19)
operator: core/ReplaceComparisonOperator_Gt_LtE, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if stack.size <= 1:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...F...........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ..............F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
string = '4'
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the characters of
            operations to lambda functions. It's similar to saying:
            def add(a,b):
                return a + b
            and then doing:
            print add(4,5)
            >>> 9
            The add function can also be accessed via the ``operator``
            module.
        '''
        stack = Stack()
        ops = {'+': lamb

83 : Job ID 18b494cad53943cbab4b39346b0c8f12
test outcome: killed
stack1.py, start pos: (130, 18), end pos: (130, 19)
operator: core/ReplaceComparisonOperator_Gt_GtE, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if stack.size >= 1:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...F...........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ..............F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
string = '4'
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the characters of
            operations to lambda functions. It's similar to saying:
            def add(a,b):
                return a + b
            and then doing:
            print add(4,5)
            >>> 9
            The add function can also be accessed via the ``operator``
            module.
        '''
        stack = Stack()
        ops = {'+': lamb

84 : Job ID c8f3bbdc15f44735977bc9515f4f7511
SURVIVED
test outcome: survived
stack1.py, start pos: (15, 20), end pos: (15, 22)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -12,7 +12,7 @@
         return self.size
     def push(self, item):
-        if self.top is None:
+        if self.top is not None:
             self.top = StackNode(item)
         else:
             #self.top->[item1]->None
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.15s ==============================

86 : Job ID dac28d67ef4f4175b9bfbccf20ca3d96
test outcome: killed
stack1.py, start pos: (39, 20), end pos: (39, 22)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 2
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -36,7 +36,7 @@
             return top_data
     def peek(self):
-        if self.top is None:
+        if self.top is not None:
             raise ValueError()
         else:
             return self.top.data
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ....FF.........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..F........F..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .FF..............        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        with pytest.raises(ValueError):
>           stack_0.peek()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack1.Stack object at 0x7f4c92e4b610>
    def peek(self):
        if self.top is not None:
            raise ValueError()
        else:
>           return self.top.data
E           AttributeError: 'NoneType' object has no attribute 'data'
stack1.py:42: AttributeError
_________________________________ test_case_5 __________________________________
    def te

87 : Job ID 1b18b0e0ff0447f6888a3d2ce141d97c
SURVIVED
test outcome: survived
stack1.py, start pos: (15, 11), end pos: (15, 27)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -12,7 +12,7 @@
         return self.size
     def push(self, item):
-        if self.top is None:
+        if not self.top is None:
             self.top = StackNode(item)
         else:
             #self.top->[item1]->None
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

89 : Job ID 6bce5b866f2942caa3e24ef1d341797e
test outcome: killed
stack1.py, start pos: (39, 11), end pos: (39, 27)
operator: core/AddNot, occurrence: 2
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -36,7 +36,7 @@
             return top_data
     def peek(self):
-        if self.top is None:
+        if not self.top is None:
             raise ValueError()
         else:
             return self.top.data
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ....FF.........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..F........F..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .FF..............        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        with pytest.raises(ValueError):
>           stack_0.peek()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:31: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack1.Stack object at 0x7f205429f6a0>
    def peek(self):
        if not self.top is None:
            raise ValueError()
        else:
>           return self.top.data
E           AttributeError: 'NoneType' object has no attribute 'data'
stack1.py:42: AttributeError
_________________________________ test_case_5 __________________________________
    def test_case_5():
        stack_0

90 : Job ID 8c2ed18392514a4fad0869c05cef6de0
test outcome: killed
stack1.py, start pos: (57, 11), end pos: (57, 39)
operator: core/AddNot, occurrence: 3
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -54,7 +54,7 @@
     for character in string:
         # Keys being the left-side brackets
-        if character in brackets.keys():
+        if not character in brackets.keys():
             stack.push(character)
         # Values being the right-side brackets
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .F.....FFFF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ...FFF....FF.F                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F........F.FFF...        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'p(hy;{K\nEB];*A}L\\'
>       var_0 = module_0.check_parenthesis(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
string = 'p(hy;{K\nEB];*A}L\\'
    def check_parenthesis(string):
        stack = Stack()
        # We're using a dict which allows us to do some fun things!
        brackets = {'{':'}', '[':']', '(':')'}
        for character in string:
            # Keys being the left-side brackets
            if not character in brackets.keys():
                stack.push(character)
            # Value

91 : Job ID 742078714e4548be9e8f0749557d04cb
test outcome: killed
stack1.py, start pos: (61, 11), end pos: (61, 41)
operator: core/AddNot, occurrence: 4
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -58,7 +58,7 @@
             stack.push(character)
         # Values being the right-side brackets
-        if character in brackets.values():
+        if not character in brackets.values():
             try:
                 other = stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .......F.FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....F....FF..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F..........FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        str_0 = '}'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:50: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_10 _________________________________
    def test_case_10():
        str_0 = '\\=m

92 : Job ID 5b4238632be24e88962fb3d39a4f3ad9
test outcome: killed
stack1.py, start pos: (66, 19), end pos: (66, 47)
operator: core/AddNot, occurrence: 5
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -63,7 +63,7 @@
                 other = stack.pop()
                 # Check for it's pair using the dict earlier
-                if brackets[other] != character:
+                if not brackets[other] != character:
                     return False
             except ValueError:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .F.......F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .........F.FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'p(hy;{K\nEB];*A}L\\'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:14: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_9 _______________________

93 : Job ID 73f9cf922bfd43aea1bf3d633643b712
test outcome: killed
stack1.py, start pos: (72, 7), end pos: (72, 22)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if not stack.size != 0:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ......F..FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....FF...F...                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F....F.....FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'b#:{&1y=1zRW~A-l9@@y'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:45: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_10 ____________________
