94 : Job ID 5582ea809e4f4bb7ae0a2f07beae36ef
test outcome: killed
stack1.py, start pos: (106, 11), end pos: (106, 34)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -103,7 +103,7 @@
     for character in tokens:
         # Check if it's an operator
-        if character in ops.keys():
+        if not character in ops.keys():
             try:
                 # Get our last two values
                 right = stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...F...........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ..............F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1.py:118: in postfix_eval
    raise e
stack1.py:109: in postfix_eval
    right = stack.pop()
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack1.Stack object at 0x7f895e41f850>
    def pop(self):
        if self.top is None:
>           raise ValueError()
E           ValueError
stack1.py:30: ValueError
_________________________________ test_case_0 _______________

95 : Job ID 73a8a86535664f4685da3c21e5783c9f
test outcome: killed
stack1.py, start pos: (130, 7), end pos: (130, 21)
operator: core/AddNot, occurrence: 8
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if not stack.size > 1:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...F...........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ..............F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
string = '4'
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the characters of
            operations to lambda functions. It's similar to saying:
            def add(a,b):
                return a + b
            and then doing:
            print add(4,5)
            >>> 9
            The add function can also be accessed via the ``operator``
            module.
        '''
        stack = Stack()
        ops = {'+': lambda a, b: a + b,

96 : Job ID c6ff3ee8221349b5b47fc004ad495119
test outcome: killed
stack1.py, start pos: (76, 15), end pos: (76, 19)
operator: core/ReplaceTrueWithFalse, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -73,7 +73,7 @@
         return False
     else:
         # If we've made it all the way through without incident
-        return True
+        return False
 def postfix_eval(string):
     ''' Here we setup a dictionary relating the characters of 
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .........FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....F....F...                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F..........FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_10 _________________________________
    def test_case_10():
        str_0 = '\\=m'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:65: AssertionError
_________________________________ test_case_5 __________________________________
    def test_case_5():

97 : Job ID 41e163d1656a449bb5c197cda0eb4b34
test outcome: killed
stack1.py, start pos: (67, 27), end pos: (67, 32)
operator: core/ReplaceFalseWithTrue, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -64,7 +64,7 @@
                 # Check for it's pair using the dict earlier
                 if brackets[other] != character:
-                    return False
+                    return True
             except ValueError:
                 return False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .F......F......                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ...F..........                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .........F.......        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'p(hy;{K\nEB];*A}L\\'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:14: AssertionError
_________________________________ test_case_8 __________________________________
    def test_case_8():
        str_0 = '+J\x0c(]a~lH\n#jd3)*-k&['
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:55: AssertionError
_________________________________ test_case_3 ______________________________

98 : Job ID db590174478744499183190a482fcbf0
test outcome: killed
stack1.py, start pos: (70, 23), end pos: (70, 28)
operator: core/ReplaceFalseWithTrue, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -67,7 +67,7 @@
                     return False
             except ValueError:
-                return False
+                return True
     # Make one last check that we don't have any extras
     if stack.size != 0:
         return False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .......F.......                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ....F......F.F                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .............F...        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        str_0 = '}'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:50: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        str_0 = 't)z?xNb)'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py:31: AssertionError
_________________________________ test_case_11 _________________________________
    def test_case_11():
        str_0 =

99 : Job ID 561c9e04409e4d678e951f2330933572
test outcome: killed
stack1.py, start pos: (73, 15), end pos: (73, 20)
operator: core/ReplaceFalseWithTrue, occurrence: 2
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -70,7 +70,7 @@
                 return False
     # Make one last check that we don't have any extras
     if stack.size != 0:
-        return False
+        return True
     else:
         # If we've made it all the way through without incident
         return True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ......F........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ......F.......                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .....F...........        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'b#:{&1y=1zRW~A-l9@@y'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:45: AssertionError
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = "X(@\\>u'G"
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py:44: AssertionError
_________________________________ test_case_5 ________________________________

100 : Job ID af5042b46830475f9dd0780c844ba31f
test outcome: killed
stack1.py, start pos: (69, 19), end pos: (69, 29)
operator: core/ExceptionReplacer, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -66,7 +66,7 @@
                 if brackets[other] != character:
                     return False
-            except ValueError:
+            except CosmicRayTestingException:
                 return False
     # Make one last check that we don't have any extras
     if stack.size != 0:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .......F.......                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ....F......F.F                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .............F...        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
string = '}'
    def check_parenthesis(string):
        stack = Stack()
        # We're using a dict which allows us to do some fun things!
        brackets = {'{':'}', '[':']', '(':')'}
        for character in string:
            # Keys being the left-side brackets
            if character in brackets.keys():
                stack.push(character)
            # Values being the right-side brackets
            if character in brackets.values():
                try:
>                   other = stack.pop()
stack1.py:63: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

101 : Job ID e3bb593d5d044683a652f950eea6e46e
test outcome: killed
stack1.py, start pos: (117, 19), end pos: (117, 29)
operator: core/ExceptionReplacer, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -114,7 +114,7 @@
                 stack.push(result)
             # If there aren't enough operands, raise it.
-            except ValueError as e:
+            except CosmicRayTestingException as e:
                 raise e
         else:
             # Else it's either a number or garbage
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ............F..                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ............FF                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F................        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_12 _________________________________
string = '/'
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the characters of
            operations to lambda functions. It's similar to saying:
            def add(a,b):
                return a + b
            and then doing:
            print add(4,5)
            >>> 9
            The add function can also be accessed via the ``operator``
            module.
        '''
        stack = Stack()
        ops = {'+': lambda a, b: a + b,
               '-': lambda a, b: a - b,
               '*': lambda a, b: a * b,
               '/': lambda a, b:

102 : Job ID 95677753c58944d4bd6856214bd4cb56
test outcome: killed
stack1.py, start pos: (126, 19), end pos: (126, 29)
operator: core/ExceptionReplacer, occurrence: 2
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -123,7 +123,7 @@
                 value = int(character)
                 stack.push(value)
-            except ValueError as e:
+            except CosmicRayTestingException as e:
                 raise e
     # If we have too many operands or operators
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...........F...                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....F...FFF..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .......FF......F.        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_11 _________________________________
string = "y{7'|-D6V"
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the characters of
            operations to lambda functions. It's similar to saying:
            def add(a,b):
                return a + b
            and then doing:
            print add(4,5)
            >>> 9
            The add function can also be accessed via the ``operator``
            module.
        '''
        stack = Stack()
        ops = {'+': lambda a, b: a + b,
               '-': lambda a, b: a - b,
               '*': lambda a, b: a * b,
               '/': lambda a, b: a / b,
               '%': l

103 : Job ID 7760f866f58340d09fa07073969e02d4
test outcome: killed
stack1.py, start pos: (8, 20), end pos: (8, 21)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -5,7 +5,7 @@
 class Stack(object):
     def __init__(self):
-        self.size = 0
+        self.size = 1
         self.top  = None
     def __len__(self):
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py F.FFFF...FF..FF                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py FFF..F.FF.FF..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py FFF...FFFF.FF.F.F        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        stack_0 = module_0.Stack()
>       assert len(stack_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<stack1.Stack object at 0x7f330b4ac940>)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:7: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        stack_0 = module_0.Stack()
>       assert len(stack_0) == 0
E       assert 1 == 0
E        +  where 1 = len(<stack1.Stack object at 0x7f330b772ad0>)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:18: AssertionError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)

104 : Job ID eeb40e325150405f9aa746e4b23475f1
test outcome: killed
stack1.py, start pos: (8, 20), end pos: (8, 21)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -5,7 +5,7 @@
 class Stack(object):
     def __init__(self):
-        self.size = 0
+        self.size = -1
         self.top  = None
     def __len__(self):
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py F.F.FFF..FF..FF                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .FF..FFFF.FF..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py FFF..FFFFF.FF...F        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        stack_0 = module_0.Stack()
>       assert len(stack_0) == 0
E       ValueError: __len__() should return >= 0
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:7: ValueError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        stack_0 = module_0.Stack()
>       assert len(stack_0) == 0
E       ValueError: __len__() should return >= 0
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:18: ValueError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       assert len(stack_0) == 0
E       ValueError: __len__() should return >= 0
MIO-MOSA-WHOLE_SUITE/test_stack1_MI

105 : Job ID 8c1704e61c71463f9f7da4bce534e1dd
test outcome: killed
stack1.py, start pos: (26, 21), end pos: (26, 22)
operator: core/NumberReplacer, occurrence: 2
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -23,7 +23,7 @@
             self.top = item2
             item2.next = item1
-        self.size += 1
+        self.size += 2
     def pop(self):
         if self.top is None:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py F..F.F...F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.......F.FF..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .FF........FF.F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_0 = stack_0.push(stack_0)
>       assert len(stack_0) == 1
E       assert 2 == 1
E        +  where 2 = len(<stack1.Stack object at 0x7f2f22ae4760>)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:9: AssertionError
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
string = '4'
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the charact

106 : Job ID 049d98e8e42c4f2aa1dca6d2691d3cbf
test outcome: killed
stack1.py, start pos: (26, 21), end pos: (26, 22)
operator: core/NumberReplacer, occurrence: 3
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -23,7 +23,7 @@
             self.top = item2
             item2.next = item1
-        self.size += 1
+        self.size += 0
     def pop(self):
         if self.top is None:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py F....FF..F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ......F.F.FF..                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .FF..F.....FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_0 = stack_0.push(stack_0)
>       assert len(stack_0) == 1
E       assert 0 == 1
E        +  where 0 = len(<stack1.Stack object at 0x7f03ac448280>)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:9: AssertionError
_________________________________ test_case_5 __________________________________
    def test_case_5():
        stack_0 = module_0.Stack()
        assert len(stack_0) == 0
        var_0 = stack_0.push(stack_0)
>       assert len(stack_0) == 1
E       assert 0 == 1
E        +  where 0 = len(<stack1.Stack object at 0x7f03ac424640>)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:37: AssertionError
______

107 : Job ID f0324a77fa4d400889cae033737439e4
test outcome: killed
stack1.py, start pos: (35, 25), end pos: (35, 26)
operator: core/NumberReplacer, occurrence: 4
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -32,7 +32,7 @@
             top_data = self.top.data
             # Skip over the top and set the next to the top
             self.top = self.top.next
-            self.size -= 1
+            self.size -= 2
             return top_data
     def peek(self):
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .........F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ...........FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_11 _________________________________
    def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError
_________________________________ test_case_12 _________________________________

108 : Job ID 12823dfc45574770be15ca6e8136f27c
test outcome: killed
stack1.py, start pos: (35, 25), end pos: (35, 26)
operator: core/NumberReplacer, occurrence: 5
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -32,7 +32,7 @@
             top_data = self.top.data
             # Skip over the top and set the next to the top
             self.top = self.top.next
-            self.size -= 1
+            self.size -= 0
             return top_data
     def peek(self):
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .........F.....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ...........FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_11 _________________________________
    def test_case_11():
        str_0 = 'a"e{v#}1l$1\rqjR!'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py:88: AssertionError
_________________________________ test_case_12 _________________________________

109 : Job ID bead6d00656e4904b1cf0749650561c1
test outcome: killed
stack1.py, start pos: (72, 21), end pos: (72, 22)
operator: core/NumberReplacer, occurrence: 6
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if stack.size != 1:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ......F..FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....FF...F...                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F....F.....FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'b#:{&1y=1zRW~A-l9@@y'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:45: AssertionError
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_10 ______________

110 : Job ID 9d55b1d8c56e426a992df585b68e9f51
test outcome: killed
stack1.py, start pos: (72, 21), end pos: (72, 22)
operator: core/NumberReplacer, occurrence: 7
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -69,7 +69,7 @@
             except ValueError:
                 return False
     # Make one last check that we don't have any extras
-    if stack.size != 0:
+    if stack.size != -1:
         return False
     else:
         # If we've made it all the way through without incident
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .........FF....                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py .....F....F...                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py F..........FF....        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_9 __________________________________
    def test_case_9():
        str_0 = '1~ZY[]TI0m%"BbE3G^'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:60: AssertionError
_________________________________ test_case_10 _________________________________
    def test_case_10():
        str_0 = '\\=m'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is True
E       assert False is True
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:65: AssertionError
_________________________________ test_case_5 ______________________________

111 : Job ID 79c010742fcf4eeeaade33fb57b1f1e4
SURVIVED
test outcome: survived
stack1.py, start pos: (130, 20), end pos: (130, 21)
operator: core/NumberReplacer, occurrence: 8
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if stack.size > 2:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...............                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ..............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .................        [100%]
============================== 46 passed in 0.23s ==============================

112 : Job ID fef91c8897ce43c881bc9b8566c6e267
test outcome: killed
stack1.py, start pos: (130, 20), end pos: (130, 21)
operator: core/NumberReplacer, occurrence: 9
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -127,7 +127,7 @@
                 raise e
     # If we have too many operands or operators
-    if stack.size > 1:
+    if stack.size > 0:
         raise ValueError()
     return stack.pop()
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...F...........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ..............F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
string = '4'
    def postfix_eval(string):
        ''' Here we setup a dictionary relating the characters of
            operations to lambda functions. It's similar to saying:
            def add(a,b):
                return a + b
            and then doing:
            print add(4,5)
            >>> 9
            The add function can also be accessed via the ``operator``
            module.
        '''
        stack = Stack()
        ops = {'+': lambda a, b: a + b,

113 : Job ID 0c2705fa204b42f7841037fade83f9b2
test outcome: killed
stack1.py, start pos: (55, 21), end pos: (55, 27)
operator: core/ZeroIterationForLoop, occurrence: 0
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -52,7 +52,7 @@
     # We're using a dict which allows us to do some fun things!
     brackets = {'{':'}', '[':']', '(':')'}
-    for character in string:
+    for character in []:
         # Keys being the left-side brackets
         if character in brackets.keys():
             stack.push(character)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py .F....FFF......                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py ...FF.F....F.F                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py .....F...F...F...        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        str_0 = 'p(hy;{K\nEB];*A}L\\'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:14: AssertionError
_________________________________ test_case_6 __________________________________
    def test_case_6():
        str_0 = 'b#:{&1y=1zRW~A-l9@@y'
        var_0 = module_0.check_parenthesis(str_0)
>       assert var_0 is False
E       assert True is False
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:45: AssertionError
_________________________________
