114 : Job ID 7ecc6f42bdfd44d2b0c754f40b3b06b5
test outcome: killed
stack1.py, start pos: (104, 21), end pos: (104, 27)
operator: core/ZeroIterationForLoop, occurrence: 1
--- mutation diff ---
--- astack1.py
+++ bstack1.py
@@ -101,7 +101,7 @@
     # Split the string into a list using spaces
     tokens = string.split(' ') 
-    for character in tokens:
+    for character in []:
         # Check if it's an operator
         if character in ops.keys():
             try:
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py ...F...........                  [ 32%]
MIO-MOSA-WHOLE_SUITE/test_stack1_MOSA.py F.............                  [ 63%]
MIO-MOSA-WHOLE_SUITE/test_stack1_WHOLE_SUITE.py ..............F..        [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        str_0 = '4'
>       var_0 = module_0.postfix_eval(str_0)
MIO-MOSA-WHOLE_SUITE/test_stack1_MIO.py:24: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
stack1.py:133: in postfix_eval
    return stack.pop()
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack1.Stack object at 0x7f5a1450b910>
    def pop(self):
        if self.top is None:
>           raise ValueError()
E           ValueError
stack1.py:30: ValueError
_________________________________ test_case_0 __________________________________
    def test_case_0():
