1 : Job ID 77e63bcc19364d8a9497739cfe4ca7a8
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" - str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for -: 'str' and 'str'") raised in repr()] Stack object at 0x7fe2fa2495d0>
    def __repr__(self):
        """show representation."""
>       return "stack:" - str(self.stack)
E       TypeError: unsupported operand type(s) for -: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.14s ==========================

2 : Job ID 8b060f169221486e9a4c90b07bf8cad8
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" * str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("can't multiply sequence by non-int of type 'str'") raised in repr()] Stack object at 0x7f4c97ffd4e0>
    def __repr__(self):
        """show representation."""
>       return "stack:" * str(self.stack)
E       TypeError: can't multiply sequence by non-int of type 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: can't multiply sequ...
========================= 1 failed, 4 passed in 0.07s ==========================

3 : Job ID 57b587da0fc048b2ae4db5ffab3f5f31
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" / str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for /: 'str' and 'str'") raised in repr()] Stack object at 0x7ff9152094b0>
    def __repr__(self):
        """show representation."""
>       return "stack:" / str(self.stack)
E       TypeError: unsupported operand type(s) for /: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.14s ==========================

4 : Job ID 38c4ce4c617a46e8a38c0f04b9307f8a
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" // str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for //: 'str' and 'str'") raised in repr()] Stack object at 0x7f8c10d294b0>
    def __repr__(self):
        """show representation."""
>       return "stack:" // str(self.stack)
E       TypeError: unsupported operand type(s) for //: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.13s ==========================

5 : Job ID f4bc0322b49942819e45d05628371728
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" % str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError('not all arguments converted during string formatting') raised in repr()] Stack object at 0x7fdf741654e0>
    def __repr__(self):
        """show representation."""
>       return "stack:" % str(self.stack)
E       TypeError: not all arguments converted during string formatting
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: not all arguments c...
========================= 1 failed, 4 passed in 0.07s ==========================

6 : Job ID d2290ea900004fa8a998e5fcdd59753b
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" ** str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for ** or pow(): 'str' and 'str'") raised in repr()] Stack object at 0x7f764917d570>
    def __repr__(self):
        """show representation."""
>       return "stack:" ** str(self.stack)
E       TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.14s ==========================

7 : Job ID f8ec27c53bb8459dac31f4fb55b2ef17
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" >> str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for >>: 'str' and 'str'") raised in repr()] Stack object at 0x7f148b30d5d0>
    def __repr__(self):
        """show representation."""
>       return "stack:" >> str(self.stack)
E       TypeError: unsupported operand type(s) for >>: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.14s ==========================

8 : Job ID ea11ad16821b4ad7bdb8ad8e983eb762
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" << str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for <<: 'str' and 'str'") raised in repr()] Stack object at 0x7fd94ee75630>
    def __repr__(self):
        """show representation."""
>       return "stack:" << str(self.stack)
E       TypeError: unsupported operand type(s) for <<: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.12s ==========================

9 : Job ID bc85825eb4084707bbd9f41c1984d43b
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" | str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for |: 'str' and 'str'") raised in repr()] Stack object at 0x7f6b93fc9ea0>
    def __repr__(self):
        """show representation."""
>       return "stack:" | str(self.stack)
E       TypeError: unsupported operand type(s) for |: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.15s ==========================

10 : Job ID ab824edd26ed406b82362142c03a05e5
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" & str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for &: 'str' and 'str'") raised in repr()] Stack object at 0x7fbac2741600>
    def __repr__(self):
        """show representation."""
>       return "stack:" & str(self.stack)
E       TypeError: unsupported operand type(s) for &: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.16s ==========================

11 : Job ID 6ff58a01f9cd40d0b0ef936c8f0f1ea9
test outcome: killed
stack2.py, start pos: (27, 24), end pos: (27, 25)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -24,5 +24,5 @@
     def __repr__(self):
         """show representation."""
-        return "stack:" + str(self.stack)
+        return "stack:" ^ str(self.stack)
MOSA/test_stack2_MOSA.py ....F                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.__repr__()
MOSA/test_stack2_MOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <[TypeError("unsupported operand type(s) for ^: 'str' and 'str'") raised in repr()] Stack object at 0x7fb1c26b14e0>
    def __repr__(self):
        """show representation."""
>       return "stack:" ^ str(self.stack)
E       TypeError: unsupported operand type(s) for ^: 'str' and 'str'
stack2.py:27: TypeError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_4 - TypeError: unsupported operand...
========================= 1 failed, 4 passed in 0.09s ==========================

12 : Job ID 6b7a951e785e401ea28851a94da021f3
test outcome: killed
stack2.py, start pos: (13, 31), end pos: (13, 33)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -10,7 +10,7 @@
     def isEmpty(self):
         """Determines whether stack is empty. O(1) performance"""
-        return len(self.stack) == 0
+        return len(self.stack) != 0
     def push(self, v):
         """Push v onto the stack. O(1) performance."""
MOSA/test_stack2_MOSA.py .F.F.                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        stack_1 = module_0.Stack()
        var_1 = stack_1.push(stack_1)
>       var_2 = stack_1.pop()
MOSA/test_stack2_MOSA.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = stack:[stack:[...]]
    def pop(self):
        """Remove topmost element and return it. O(1) performance."""
        if self.isEmpty():
>           raise Exception('Stack is empty.')
E           Exception: Stack is empty.
stack2.py:22: Exception
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        stack_0 = module_0.Stack()
        var_0 = stack_0.isEmpty()
>

13 : Job ID 8a7e40a835504b07b23ea7a172e0a10a
test outcome: killed
stack2.py, start pos: (13, 31), end pos: (13, 33)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -10,7 +10,7 @@
     def isEmpty(self):
         """Determines whether stack is empty. O(1) performance"""
-        return len(self.stack) == 0
+        return len(self.stack) < 0
     def push(self, v):
         """Push v onto the stack. O(1) performance."""
MOSA/test_stack2_MOSA.py ...F.                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        stack_0 = module_0.Stack()
        var_0 = stack_0.isEmpty()
>       assert var_0 is True
E       assert False is True
MOSA/test_stack2_MOSA.py:35: AssertionError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_3 - assert False is True
========================= 1 failed, 4 passed in 0.07s ==========================

14 : Job ID f737432812c04eefa7796223a0295a2b
SURVIVED
test outcome: survived
stack2.py, start pos: (13, 31), end pos: (13, 33)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -10,7 +10,7 @@
     def isEmpty(self):
         """Determines whether stack is empty. O(1) performance"""
-        return len(self.stack) == 0
+        return len(self.stack) <= 0
     def push(self, v):
         """Push v onto the stack. O(1) performance."""
MOSA/test_stack2_MOSA.py .....                                           [100%]
============================== 5 passed in 0.05s ===============================

15 : Job ID 6a6cfcf1b95046878c6cf4ea82c86747
test outcome: killed
stack2.py, start pos: (13, 31), end pos: (13, 33)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -10,7 +10,7 @@
     def isEmpty(self):
         """Determines whether stack is empty. O(1) performance"""
-        return len(self.stack) == 0
+        return len(self.stack) > 0
     def push(self, v):
         """Push v onto the stack. O(1) performance."""
MOSA/test_stack2_MOSA.py .F.F.                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        stack_1 = module_0.Stack()
        var_1 = stack_1.push(stack_1)
>       var_2 = stack_1.pop()
MOSA/test_stack2_MOSA.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = stack:[stack:[...]]
    def pop(self):
        """Remove topmost element and return it. O(1) performance."""
        if self.isEmpty():
>           raise Exception('Stack is empty.')
E           Exception: Stack is empty.
stack2.py:22: Exception
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        stack_0 = module_0.Stack()
        var_0 = stack_0.isEmpty()
>

16 : Job ID 19eef28f10eb4389958b6647e3208ebe
test outcome: killed
stack2.py, start pos: (13, 31), end pos: (13, 33)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -10,7 +10,7 @@
     def isEmpty(self):
         """Determines whether stack is empty. O(1) performance"""
-        return len(self.stack) == 0
+        return len(self.stack) >= 0
     def push(self, v):
         """Push v onto the stack. O(1) performance."""
MOSA/test_stack2_MOSA.py .F...                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        stack_1 = module_0.Stack()
        var_1 = stack_1.push(stack_1)
>       var_2 = stack_1.pop()
MOSA/test_stack2_MOSA.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = stack:[stack:[...]]
    def pop(self):
        """Remove topmost element and return it. O(1) performance."""
        if self.isEmpty():
>           raise Exception('Stack is empty.')
E           Exception: Stack is empty.
stack2.py:22: Exception
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_1 - Exception: Stack is empty.
========================= 1 failed, 4 passed i

17 : Job ID e5c334dccfaa4e768a28b0b69dc9a3bb
test outcome: killed
stack2.py, start pos: (21, 11), end pos: (21, 25)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -18,7 +18,7 @@
     def pop(self):
         """Remove topmost element and return it. O(1) performance."""
-        if self.isEmpty():
+        if not self.isEmpty():
             raise Exception('Stack is empty.')
         return self.stack.pop()
MOSA/test_stack2_MOSA.py .F...                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        stack_1 = module_0.Stack()
        var_1 = stack_1.push(stack_1)
>       var_2 = stack_1.pop()
MOSA/test_stack2_MOSA.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = stack:[stack:[...]]
    def pop(self):
        """Remove topmost element and return it. O(1) performance."""
        if not self.isEmpty():
>           raise Exception('Stack is empty.')
E           Exception: Stack is empty.
stack2.py:22: Exception
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_1 - Exception: Stack is empty.
========================= 1 failed, 4 passed in 0.15s ==========================

18 : Job ID 99dbcc92757248eebd6554f2da24fdde
test outcome: killed
stack2.py, start pos: (13, 34), end pos: (13, 35)
operator: core/NumberReplacer, occurrence: 0
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -10,7 +10,7 @@
     def isEmpty(self):
         """Determines whether stack is empty. O(1) performance"""
-        return len(self.stack) == 0
+        return len(self.stack) == 1
     def push(self, v):
         """Push v onto the stack. O(1) performance."""
MOSA/test_stack2_MOSA.py .F.F.                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        stack_1 = module_0.Stack()
        var_1 = stack_1.push(stack_1)
>       var_2 = stack_1.pop()
MOSA/test_stack2_MOSA.py:15: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = stack:[stack:[...]]
    def pop(self):
        """Remove topmost element and return it. O(1) performance."""
        if self.isEmpty():
>           raise Exception('Stack is empty.')
E           Exception: Stack is empty.
stack2.py:22: Exception
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        stack_0 = module_0.Stack()
        var_0 = stack_0.isEmpty()
>       assert var_0 is

19 : Job ID 548b8e37c1bd4ef986ae0d6b13351048
test outcome: killed
stack2.py, start pos: (13, 34), end pos: (13, 35)
operator: core/NumberReplacer, occurrence: 1
--- mutation diff ---
--- astack2.py
+++ bstack2.py
@@ -10,7 +10,7 @@
     def isEmpty(self):
         """Determines whether stack is empty. O(1) performance"""
-        return len(self.stack) == 0
+        return len(self.stack) == -1
     def push(self, v):
         """Push v onto the stack. O(1) performance."""
MOSA/test_stack2_MOSA.py ...F.                                           [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        stack_0 = module_0.Stack()
        var_0 = stack_0.isEmpty()
>       assert var_0 is True
E       assert False is True
MOSA/test_stack2_MOSA.py:35: AssertionError
=========================== short test summary info ============================
FAILED MOSA/test_stack2_MOSA.py::test_case_3 - assert False is True
========================= 1 failed, 4 passed in 0.08s ==========================
