4 : Job ID 289caaf820d74db5b7345667dc915ceb
test outcome: killed
stack3.py, start pos: (125, 46), end pos: (125, 48)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 3
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() != 0 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .......F.....F...       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ...........FF........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ..FF.....            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:59: AssertionError
_________________________________ test_case_13 _________________________________
    def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:108: AssertionError
_________________________________ test_case_11 ___

5 : Job ID c11bb6c87b0d4b8f94ea7321625c2d78
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 4
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ != "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.24s ==============================

9 : Job ID 7f1eb4a0534841f9b8470e3b37067683
test outcome: killed
stack3.py, start pos: (125, 46), end pos: (125, 48)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 3
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() < 0 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .......F.........       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ...........F.........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ..F......            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:59: AssertionError
_________________________________ test_case_11 _________________________________
    def test_case_11():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py:63: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        stack_0 = module_0.Sta

10 : Job ID e223ef7565f944ca8f229505d8792e31
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 4
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ < "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.24s ==============================

14 : Job ID 930a0569cdfd4804b5fccb616e6200f9
SURVIVED
test outcome: survived
stack3.py, start pos: (125, 46), end pos: (125, 48)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 3
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() <= 0 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.23s ==============================

15 : Job ID 64e32fdc4e534d8cbc29a42252245ad4
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 4
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ <= "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.34s ==============================

19 : Job ID c61c5421b4e54994b31a750b45d1a7db
test outcome: killed
stack3.py, start pos: (125, 46), end pos: (125, 48)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 3
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() > 0 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .......F.....F...       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ...........FF........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ..FF.....            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:59: AssertionError
_________________________________ test_case_13 _________________________________
    def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:108: AssertionError
_________________________________ test_case_11 ______

20 : Job ID 3724ff44d8314d67a0fc4ca23c155f0f
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 4
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ > "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.31s ==============================

24 : Job ID 81afb6faf9284c2bbbca3652071ebb37
test outcome: killed
stack3.py, start pos: (125, 46), end pos: (125, 48)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 3
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() >= 0 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .............F...       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ............F........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ...F.....            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_13 _________________________________
    def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:108: AssertionError
_________________________________ test_case_12 _________________________________
    def test_case_12():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py:69: AssertionError
__________

25 : Job ID 32a1cc06f44847c28cce979c9c170bc5
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 4
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ >= "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.23s ==============================

26 : Job ID bb741ab9943445e1afa4e3c1e5e13958
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ is "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
=============================== warnings summary ===============================
stack3.py:140
  /home/auri/temp/lucca/python_experiments/stack3/stack3.py:140: SyntaxWarning: "is" with a literal. Did you mean "=="?
    if __name__ is "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 47 passed, 1 warning in 0.23s =========================

27 : Job ID 242f465dbe8e49fba4048f7bf009438d
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 12), end pos: (140, 14)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if __name__ is not "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
=============================== warnings summary ===============================
stack3.py:140
  /home/auri/temp/lucca/python_experiments/stack3/stack3.py:140: SyntaxWarning: "is not" with a literal. Did you mean "!="?
    if __name__ is not "__main__":
-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
======================== 47 passed, 1 warning in 0.23s =========================

33 : Job ID 872d1111dbb548c498f1dccf8469b3a5
SURVIVED
test outcome: survived
stack3.py, start pos: (137, 44), end pos: (137, 45)
operator: core/ReplaceUnaryOperator_USub_UAdd, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -134,7 +134,7 @@
         """Get string representation of the stack."""
-        return str(self.__stack.toArray()[::-1])
+        return str(self.__stack.toArray()[::+1])
 if __name__ == "__main__":
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.23s ==============================

34 : Job ID 4b8b50e6d9024972979b68b0ab47bcc2
SURVIVED
test outcome: survived
stack3.py, start pos: (137, 44), end pos: (137, 45)
operator: core/ReplaceUnaryOperator_USub_Invert, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -134,7 +134,7 @@
         """Get string representation of the stack."""
-        return str(self.__stack.toArray()[::-1])
+        return str(self.__stack.toArray()[::~1])
 if __name__ == "__main__":
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.23s ==============================

35 : Job ID 7cc2233f478e4d8bb5016cdf35a7f841
test outcome: killed
stack3.py, start pos: (137, 44), end pos: (137, 45)
operator: core/ReplaceUnaryOperator_USub_Not, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -134,7 +134,7 @@
         """Get string representation of the stack."""
-        return str(self.__stack.toArray()[::-1])
+        return str(self.__stack.toArray()[::not 1])
 if __name__ == "__main__":
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .....F......F....       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ....................F        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ...F.....            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        stack_0 = module_0.Stack()
>       str_0 = stack_0.__str__()
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack3.Stack object at 0x7f3ab6511e10>
    def __str__(self) -> str:
        """Get string representation of the stack."""
>       return str(self.__stack.toArray()[::not 1])
E       ValueError: slice step cannot be zero
stack3.py:137: ValueError
_________________________________ test_case_12 _________________________________
    def test_case_12():
        stack_0 = module_0.Stack()
>       str_0 = stack_0.__str__()
DYNAMO

36 : Job ID d42ff488315a47bda2a7e8b2c5134388
SURVIVED
test outcome: survived
stack3.py, start pos: (137, 44), end pos: (137, 45)
operator: core/ReplaceUnaryOperator_Delete_USub, occurrence: 0
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -134,7 +134,7 @@
         """Get string representation of the stack."""
-        return str(self.__stack.toArray()[::-1])
+        return str(self.__stack.toArray()[::1])
 if __name__ == "__main__":
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.23s ==============================

43 : Job ID b90df60b688940c6a3a70142200e4d80
test outcome: killed
stack3.py, start pos: (125, 23), end pos: (125, 50)
operator: core/AddNot, occurrence: 6
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if not self.__stack.getSize() == 0 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .......F.....F...       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ...........FF........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ..FF.....            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:59: AssertionError
_________________________________ test_case_13 _________________________________
    def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:108: AssertionError
_________________________________ test_case_11 __________________________

44 : Job ID 53469c9843c74e45be238add8d5eebf0
SURVIVED
test outcome: survived
stack3.py, start pos: (140, 3), end pos: (140, 25)
operator: core/AddNot, occurrence: 7
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -137,6 +137,6 @@
         return str(self.__stack.toArray()[::-1])
-if __name__ == "__main__":
+if not __name__ == "__main__":
     pass
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.23s ==============================

46 : Job ID 29c63a4410e145a0b24e6744f3a90be0
test outcome: killed
stack3.py, start pos: (125, 15), end pos: (125, 19)
operator: core/ReplaceTrueWithFalse, occurrence: 1
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return False if self.__stack.getSize() == 0 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .......F.........       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ...........F.........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ..F......            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:59: AssertionError
_________________________________ test_case_11 _________________________________
    def test_case_11():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py:63: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        stack_0 = module_0.Stack()

48 : Job ID c3d53fef7a8d413994bbfa56e3d73d3e
test outcome: killed
stack3.py, start pos: (125, 56), end pos: (125, 61)
operator: core/ReplaceFalseWithTrue, occurrence: 1
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() == 0 else True
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .............F...       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ............F........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ...F.....            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_13 _________________________________
    def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:108: AssertionError
_________________________________ test_case_12 _________________________________
    def test_case_12():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py:69: AssertionError
_______________________

67 : Job ID bdba32f42668491e8b11cb69f13de5b6
test outcome: killed
stack3.py, start pos: (125, 49), end pos: (125, 50)
operator: core/NumberReplacer, occurrence: 18
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() == 1 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .......F.....F...       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ...........FF........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ..F......            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:59: AssertionError
_________________________________ test_case_13 _________________________________
    def test_case_13():
        stack_0 = module_0.Stack()
        none_type_0 = stack_0.push(stack_0)
        var_0 = stack_0.peek()
        bool_0 = var_0.isEmpty()
>       assert bool_0 is False
E       assert True is False
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:108: AssertionError
_________________________________ test_case_11 _____________________

68 : Job ID 9250ffc8ce664ce295119ee111f97fe8
test outcome: killed
stack3.py, start pos: (125, 49), end pos: (125, 50)
operator: core/NumberReplacer, occurrence: 19
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -122,7 +122,7 @@
         """Check if stack is empty."""
-        return True if self.__stack.getSize() == 0 else False
+        return True if self.__stack.getSize() == -1 else False
     def getSize(self) -> int:
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .......F.........       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ...........F.........        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ..F......            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:59: AssertionError
_________________________________ test_case_11 _________________________________
    def test_case_11():
        stack_0 = module_0.Stack()
        bool_0 = stack_0.isEmpty()
>       assert bool_0 is True
E       assert False is True
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py:63: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        stack_0 = module_0.Stack()

69 : Job ID 1d93681cf8854808beda2bddc79c3a98
SURVIVED
test outcome: survived
stack3.py, start pos: (137, 45), end pos: (137, 46)
operator: core/NumberReplacer, occurrence: 20
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -134,7 +134,7 @@
         """Get string representation of the stack."""
-        return str(self.__stack.toArray()[::-1])
+        return str(self.__stack.toArray()[::- 2])
 if __name__ == "__main__":
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .................       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py .....................        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py .........            [100%]
============================== 47 passed in 0.24s ==============================

70 : Job ID 8a258badde734b7d964d6e05e3d33fed
test outcome: killed
stack3.py, start pos: (137, 45), end pos: (137, 46)
operator: core/NumberReplacer, occurrence: 21
--- mutation diff ---
--- astack3.py
+++ bstack3.py
@@ -134,7 +134,7 @@
         """Get string representation of the stack."""
-        return str(self.__stack.toArray()[::-1])
+        return str(self.__stack.toArray()[::- 0])
 if __name__ == "__main__":
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py .....F......F....       [ 36%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_MIO.py ....................F        [ 80%]
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_WHOLE_SUITE.py ...F.....            [100%]
=================================== FAILURES ===================================
_________________________________ test_case_5 __________________________________
    def test_case_5():
        stack_0 = module_0.Stack()
>       str_0 = stack_0.__str__()
DYNAMOSA-MIO-WHOLE_SUITE/test_stack3_DYNAMOSA.py:48: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack3.Stack object at 0x7fc531ddf040>
    def __str__(self) -> str:
        """Get string representation of the stack."""
>       return str(self.__stack.toArray()[::- 0])
E       ValueError: slice step cannot be zero
stack3.py:137: ValueError
_________________________________ test_case_12 _________________________________
    def test_case_12():
        stack_0 = module_0.Stack()
>       str_0 = stack_0.__str__()
DYNAMOSA-MIO-WHOLE_SUITE
