1 : Job ID eead98d1d2d44b0a9ce572e9f6894db3
test outcome: killed
stack5.py, start pos: (10, 20), end pos: (10, 22)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 0
--- mutation diff ---
--- astack5.py
+++ bstack5.py
@@ -7,7 +7,7 @@
         self.top = Node(data, self.top)
     def pop(self):
-        if self.top is None:
+        if self.top is not None:
             return None
         data = self.top.data
         self.top = self.top.next
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py FF...F             [ 24%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MIO.py F.....                  [ 48%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MOSA.py FF...F                 [ 72%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_WHOLE_SUITE.py FFF..F.         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.pop()
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack5.Stack object at 0x7f750794ab90>
    def pop(self):
        if self.top is not None:
            return None
>       data = self.top.data
E       AttributeError: 'NoneType' object has no attribute 'data'
stack5.py:12: AttributeError
_________________________________ test_case_1 __________________________________

2 : Job ID 34fae5d9cd3d4242a43826149c9234c0
SURVIVED
test outcome: survived
stack5.py, start pos: (20, 27), end pos: (20, 29)
operator: core/ReplaceComparisonOperator_Is_IsNot, occurrence: 1
--- mutation diff ---
--- astack5.py
+++ bstack5.py
@@ -17,7 +17,7 @@
         return self.top.data if self.top is not None else None
     def is_empty(self):
-        return self.peek() is None
+        return self.peek() is not None
 class Node(object):
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py ......             [ 24%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MIO.py ......                  [ 48%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MOSA.py ......                 [ 72%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_WHOLE_SUITE.py .......         [100%]
============================== 25 passed in 0.07s ==============================

3 : Job ID 0d16b05f17d14682ab517125d50590db
test outcome: killed
stack5.py, start pos: (17, 41), end pos: (17, 47)
operator: core/ReplaceComparisonOperator_IsNot_Is, occurrence: 0
--- mutation diff ---
--- astack5.py
+++ bstack5.py
@@ -14,7 +14,7 @@
         return data
     def peek(self):
-        return self.top.data if self.top is not None else None
+        return self.top.data if self.top is None else None
     def is_empty(self):
         return self.peek() is None
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py ...F.F             [ 24%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MIO.py F..F..                  [ 48%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MOSA.py ...F.F                 [ 72%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_WHOLE_SUITE.py ....FF.         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.peek()
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack5.Stack object at 0x7fc6a4f265f0>
    def peek(self):
>       return self.top.data if self.top is None else None
E       AttributeError: 'NoneType' object has no attribute 'data'
stack5.py:17: AttributeError
_________________________________ test_case_5 __________________________________
    def te

4 : Job ID 43fef84c616845dab307ff8fcbc0b184
test outcome: killed
stack5.py, start pos: (10, 11), end pos: (10, 27)
operator: core/AddNot, occurrence: 0
--- mutation diff ---
--- astack5.py
+++ bstack5.py
@@ -7,7 +7,7 @@
         self.top = Node(data, self.top)
     def pop(self):
-        if self.top is None:
+        if not self.top is None:
             return None
         data = self.top.data
         self.top = self.top.next
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py FF...F             [ 24%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MIO.py F.....                  [ 48%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MOSA.py FF...F                 [ 72%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_WHOLE_SUITE.py FFF..F.         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.pop()
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack5.Stack object at 0x7f3c00f6e8f0>
    def pop(self):
        if not self.top is None:
            return None
>       data = self.top.data
E       AttributeError: 'NoneType' object has no attribute 'data'
stack5.py:12: AttributeError
_________________________________ test_case_1 __________________________________
    def test_case_1():

5 : Job ID 399ed7a23091437cbaa39ddba55a04c5
test outcome: killed
stack5.py, start pos: (17, 32), end pos: (17, 52)
operator: core/AddNot, occurrence: 1
--- mutation diff ---
--- astack5.py
+++ bstack5.py
@@ -14,7 +14,7 @@
         return data
     def peek(self):
-        return self.top.data if self.top is not None else None
+        return self.top.data if not self.top is not None else None
     def is_empty(self):
         return self.peek() is None
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py ...F.F             [ 24%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MIO.py F..F..                  [ 48%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_MOSA.py ...F.F                 [ 72%]
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_WHOLE_SUITE.py ....FF.         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.peek()
DYNAMOSA-MIO-MOSA-WHOLE_SUITE/test_stack5_DYNAMOSA.py:26: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
self = <stack5.Stack object at 0x7f7b6286e5f0>
    def peek(self):
>       return self.top.data if not self.top is not None else None
E       AttributeError: 'NoneType' object has no attribute 'data'
stack5.py:17: AttributeError
_________________________________ test_case_5 __________________________________
    def test_case_5():
