   - [#   1] CDI stack5: 
--------------------------------------------------------------------------------
   1: class Stack(object):
   2:     
-  3:     def __init__(self, top=None):
-  4:         self.top = top
-  5:     
+  3:     @classmethod
+  4:     def __init__(self, top=None):
+  5:         self.top = top
   6:     def push(self, data):
   7:         self.top = Node(data, self.top)
   8:     
   9:     def pop(self):
--------------------------------------------------------------------------------
[0.05403 s] survived

   - [#   2] CDI stack5: 
--------------------------------------------------------------------------------
   2:     
   3:     def __init__(self, top=None):
   4:         self.top = top
   5:     
-  6:     def push(self, data):
-  7:         self.top = Node(data, self.top)
-  8:     
+  6:     @classmethod
+  7:     def push(self, data):
+  8:         self.top = Node(data, self.top)
   9:     def pop(self):
  10:         if self.top is None:
  11:             return None
  12:         data = self.top.data
--------------------------------------------------------------------------------
[0.09771 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.push(stack_0)

DYNAMOSA/test_stack5_DYNAMOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack5.Stack'>, data = <stack5.Stack object at 0x7f8b2776d3f0>

>   ???
E   AttributeError: type object 'Stack' has no attribute 'top'. Did you mean: 'pop'?

stack5:8: AttributeError

   - [#   3] CDI stack5: 
--------------------------------------------------------------------------------
   5:     
   6:     def push(self, data):
   7:         self.top = Node(data, self.top)
   8:     
-  9:     def pop(self):
- 10:         if self.top is None:
- 11:             return None
- 12:         data = self.top.data
- 13:         self.top = self.top.next
- 14:         return data
- 15:     
+  9:     @classmethod
+ 10:     def pop(self):
+ 11:         if self.top is None:
+ 12:             return None
+ 13:         data = self.top.data
+ 14:         self.top = self.top.next
+ 15:         return data
  16:     def peek(self):
  17:         return self.top.data if self.top is not None else None
  18:     
  19:     def is_empty(self):
--------------------------------------------------------------------------------
[0.08710 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack5.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute 'top'. Did you mean: 'pop'?

stack5:11: AttributeError

   - [#   4] CDI stack5: 
--------------------------------------------------------------------------------
  12:         data = self.top.data
  13:         self.top = self.top.next
  14:         return data
  15:     
- 16:     def peek(self):
- 17:         return self.top.data if self.top is not None else None
- 18:     
+ 16:     @classmethod
+ 17:     def peek(self):
+ 18:         return self.top.data if self.top is not None else None
  19:     def is_empty(self):
  20:         return self.peek() is None
  21: 
  22: class Node(object):
--------------------------------------------------------------------------------
[0.09133 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_3

def test_case_3():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.peek()

DYNAMOSA/test_stack5_DYNAMOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <class 'stack5.Stack'>

>   ???
E   AttributeError: type object 'Stack' has no attribute 'top'. Did you mean: 'pop'?

stack5:18: AttributeError

   - [#   6] CDI stack5: 
--------------------------------------------------------------------------------
  20:         return self.peek() is None
  21: 
  22: class Node(object):
  23:     
- 24:     def __init__(self, data, next=None):
- 25:         self.data = data
- 26:         self.next = next
+ 24:     @classmethod
+ 25:     def __init__(self, data, next=None):
+ 26:         self.data = data
+ 27:         self.next = next
--------------------------------------------------------------------------------
[0.06446 s] survived

   - [#   7] COI stack5: 
--------------------------------------------------------------------------------
   6:     def push(self, data):
   7:         self.top = Node(data, self.top)
   8:     
   9:     def pop(self):
- 10:         if self.top is None:
+ 10:         if not (self.top is None):
  11:             return None
  12:         data = self.top.data
  13:         self.top = self.top.next
  14:         return data
--------------------------------------------------------------------------------
[0.09033 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b278197e0>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

stack5:12: AttributeError

   - [#  13] SDI stack5: 
--------------------------------------------------------------------------------
  20:         return self.peek() is None
  21: 
  22: class Node(object):
  23:     
- 24:     def __init__(self, data, next=None):
- 25:         self.data = data
- 26:         self.next = next
+ 24:     @staticmethod
+ 25:     def __init__(self, data, next=None):
+ 26:         self.data = data
+ 27:         self.next = next
--------------------------------------------------------------------------------
[0.08299 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
>       var_1 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b27792050>

>   ???
E   AttributeError: 'Node' object has no attribute 'data'

stack5:12: AttributeError

   - [#  14] SDL stack5: 
--------------------------------------------------------------------------------
   1: class Stack(object):
   2:     
   3:     def __init__(self, top=None):
-  4:         self.top = top
+  4:         pass
   5:     
   6:     def push(self, data):
   7:         self.top = Node(data, self.top)
   8:     
--------------------------------------------------------------------------------
[0.08789 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b275f2dd0>

>   ???
E   AttributeError: 'Stack' object has no attribute 'top'. Did you mean: 'pop'?

stack5:10: AttributeError

   - [#  15] SDL stack5: 
--------------------------------------------------------------------------------
   3:     def __init__(self, top=None):
   4:         self.top = top
   5:     
   6:     def push(self, data):
-  7:         self.top = Node(data, self.top)
+  7:         pass
   8:     
   9:     def pop(self):
  10:         if self.top is None:
  11:             return None
--------------------------------------------------------------------------------
[0.11189 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        var_1 = stack_0.pop()
        assert stack_0.top is None
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack5.Stack'
E       AssertionError

DYNAMOSA/test_stack5_DYNAMOSA.py:15: AssertionError

   - [#  16] SDL stack5: 
--------------------------------------------------------------------------------
   7:         self.top = Node(data, self.top)
   8:     
   9:     def pop(self):
  10:         if self.top is None:
- 11:             return None
+ 11:             pass
  12:         data = self.top.data
  13:         self.top = self.top.next
  14:         return data
  15:     
--------------------------------------------------------------------------------
[0.08411 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b275f1870>

>   ???
E   AttributeError: 'NoneType' object has no attribute 'data'

stack5:12: AttributeError

   - [#  17] SDL stack5: 
--------------------------------------------------------------------------------
   8:     
   9:     def pop(self):
  10:         if self.top is None:
  11:             return None
- 12:         data = self.top.data
+ 12:         pass
  13:         self.top = self.top.next
  14:         return data
  15:     
  16:     def peek(self):
--------------------------------------------------------------------------------
[0.08733 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
>       var_1 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b2784d2a0>

>   ???
E   NameError: name 'data' is not defined

stack5:14: NameError

   - [#  18] SDL stack5: 
--------------------------------------------------------------------------------
   9:     def pop(self):
  10:         if self.top is None:
  11:             return None
  12:         data = self.top.data
- 13:         self.top = self.top.next
+ 13:         pass
  14:         return data
  15:     
  16:     def peek(self):
  17:         return self.top.data if self.top is not None else None
--------------------------------------------------------------------------------
[0.07812 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        var_1 = stack_0.pop()
>       assert stack_0.top is None
E       AssertionError

DYNAMOSA/test_stack5_DYNAMOSA.py:14: AssertionError

   - [#  19] SDL stack5: 
--------------------------------------------------------------------------------
  10:         if self.top is None:
  11:             return None
  12:         data = self.top.data
  13:         self.top = self.top.next
- 14:         return data
+ 14:         pass
  15:     
  16:     def peek(self):
  17:         return self.top.data if self.top is not None else None
  18:     
--------------------------------------------------------------------------------
[0.08380 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
        var_1 = stack_0.pop()
        assert stack_0.top is None
>       assert f'{type(var_1).__module__}.{type(var_1).__qualname__}' == 'stack5.Stack'
E       AssertionError

DYNAMOSA/test_stack5_DYNAMOSA.py:15: AssertionError

   - [#  20] SDL stack5: 
--------------------------------------------------------------------------------
  13:         self.top = self.top.next
  14:         return data
  15:     
  16:     def peek(self):
- 17:         return self.top.data if self.top is not None else None
+ 17:         pass
  18:     
  19:     def is_empty(self):
  20:         return self.peek() is None
  21: 
--------------------------------------------------------------------------------
[0.05890 s] survived

   - [#  21] SDL stack5: 
--------------------------------------------------------------------------------
  16:     def peek(self):
  17:         return self.top.data if self.top is not None else None
  18:     
  19:     def is_empty(self):
- 20:         return self.peek() is None
+ 20:         pass
  21: 
  22: class Node(object):
  23:     
  24:     def __init__(self, data, next=None):
--------------------------------------------------------------------------------
[0.06070 s] survived

   - [#  22] SDL stack5: 
--------------------------------------------------------------------------------
  21: 
  22: class Node(object):
  23:     
  24:     def __init__(self, data, next=None):
- 25:         self.data = data
+ 25:         pass
  26:         self.next = next
--------------------------------------------------------------------------------
[0.07540 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
>       var_1 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b2784f550>

>   ???
E   AttributeError: 'Node' object has no attribute 'data'

stack5:12: AttributeError

   - [#  23] SDL stack5: 
--------------------------------------------------------------------------------
  22: class Node(object):
  23:     
  24:     def __init__(self, data, next=None):
  25:         self.data = data
- 26:         self.next = next
+ 26:         pass
--------------------------------------------------------------------------------
[0.08708 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
>       var_1 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b2776ce50>

>   ???
E   AttributeError: 'Node' object has no attribute 'next'

stack5:13: AttributeError

   - [#  26] SVD stack5: 
--------------------------------------------------------------------------------
   3:     def __init__(self, top=None):
   4:         self.top = top
   5:     
   6:     def push(self, data):
-  7:         self.top = Node(data, self.top)
+  7:         self.top = Node(data, top)
   8:     
   9:     def pop(self):
  10:         if self.top is None:
  11:             return None
--------------------------------------------------------------------------------
[0.08833 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.push(stack_0)

DYNAMOSA/test_stack5_DYNAMOSA.py:12: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b275f0a60>
data = <stack5.Stack object at 0x7f8b275f0a60>

>   ???
E   NameError: name 'top' is not defined

stack5:7: NameError

   - [#  27] SVD stack5: 
--------------------------------------------------------------------------------
   6:     def push(self, data):
   7:         self.top = Node(data, self.top)
   8:     
   9:     def pop(self):
- 10:         if self.top is None:
+ 10:         if top is None:
  11:             return None
  12:         data = self.top.data
  13:         self.top = self.top.next
  14:         return data
--------------------------------------------------------------------------------
[0.09779 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_0

def test_case_0():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:7: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b275f23b0>

>   ???
E   NameError: name 'top' is not defined

stack5:10: NameError

   - [#  28] SVD stack5: 
--------------------------------------------------------------------------------
   8:     
   9:     def pop(self):
  10:         if self.top is None:
  11:             return None
- 12:         data = self.top.data
+ 12:         data = top.data
  13:         self.top = self.top.next
  14:         return data
  15:     
  16:     def peek(self):
--------------------------------------------------------------------------------
[0.11188 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
>       var_1 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b27602d70>

>   ???
E   NameError: name 'top' is not defined

stack5:12: NameError

   - [#  30] SVD stack5: 
--------------------------------------------------------------------------------
   9:     def pop(self):
  10:         if self.top is None:
  11:             return None
  12:         data = self.top.data
- 13:         self.top = self.top.next
+ 13:         self.top = top.next
  14:         return data
  15:     
  16:     def peek(self):
  17:         return self.top.data if self.top is not None else None
--------------------------------------------------------------------------------
[0.09878 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_1

def test_case_1():
        stack_0 = module_0.Stack()
        var_0 = stack_0.push(stack_0)
>       var_1 = stack_0.pop()

DYNAMOSA/test_stack5_DYNAMOSA.py:13: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b275f2530>

>   ???
E   NameError: name 'top' is not defined

stack5:13: NameError

   - [#  31] SVD stack5: 
--------------------------------------------------------------------------------
  13:         self.top = self.top.next
  14:         return data
  15:     
  16:     def peek(self):
- 17:         return self.top.data if self.top is not None else None
+ 17:         return self.top.data if top is not None else None
  18:     
  19:     def is_empty(self):
  20:         return self.peek() is None
  21: 
--------------------------------------------------------------------------------
[0.08882 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_3

def test_case_3():
        stack_0 = module_0.Stack()
>       var_0 = stack_0.peek()

DYNAMOSA/test_stack5_DYNAMOSA.py:27: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b2776eef0>

>   ???
E   NameError: name 'top' is not defined

stack5:17: NameError

   - [#  32] SVD stack5: 
--------------------------------------------------------------------------------
  13:         self.top = self.top.next
  14:         return data
  15:     
  16:     def peek(self):
- 17:         return self.top.data if self.top is not None else None
+ 17:         return top.data if self.top is not None else None
  18:     
  19:     def is_empty(self):
  20:         return self.peek() is None
  21: 
--------------------------------------------------------------------------------
[0.05635 s] survived

   - [#  33] SVD stack5: 
--------------------------------------------------------------------------------
  16:     def peek(self):
  17:         return self.top.data if self.top is not None else None
  18:     
  19:     def is_empty(self):
- 20:         return self.peek() is None
+ 20:         return peek() is None
  21: 
  22: class Node(object):
  23:     
  24:     def __init__(self, data, next=None):
--------------------------------------------------------------------------------
[0.12686 s] killed by DYNAMOSA/test_stack5_DYNAMOSA.py::test_case_5

def test_case_5():
        stack_0 = module_0.Stack()
        var_0 = stack_0.pop()
        none_type_0 = None
>       var_1 = stack_0.is_empty()

DYNAMOSA/test_stack5_DYNAMOSA.py:39: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

self = <stack5.Stack object at 0x7f8b2776d150>

>   ???
E   NameError: name 'peek' is not defined

stack5:20: NameError
